ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h

#ifndef CH32V30XXX_H
#define CH32V30XXX_H

#ifdef __cplusplus
extern "C" {
#endif

#ifndef __IM
  #define __IM   volatile const
#endif
#ifndef __OM
  #define __OM   volatile
#endif
#ifndef __IOM
  #define __IOM  volatile
#endif

#include <stdint.h>

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40023C00) RNG Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register                                           */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t RNGEN      : 1;            /*!< [2..2] Random number generator enable                                     */
      __IOM uint32_t IE         : 1;            /*!< [3..3] Interrupt enable                                                   */
    } bit;
  } CR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) status register                                            */
    
    struct {
      __IM  uint32_t DRDY       : 1;            /*!< [0..0] Data ready                                                         */
      __IM  uint32_t CECS       : 1;            /*!< [1..1] Clock error current status                                         */
      __IM  uint32_t SECS       : 1;            /*!< [2..2] Seed error current status                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t CEIS       : 1;            /*!< [5..5] Clock error interrupt status                                       */
      __IOM uint32_t SEIS       : 1;            /*!< [6..6] Seed error interrupt status                                        */
    } bit;
  } SR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) data register                                              */
    
    struct {
      __IM  uint32_t RNDATA     : 32;           /*!< [31..0] Random data                                                       */
    } bit;
  } DR;
} RNG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40005C00) USB Structure                                              */
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000000) endpoint 0 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP0R;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000004) endpoint 1 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP1R;
  __IM  uint16_t  RESERVED1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000008) endpoint 2 register                                        */
    
