ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP2R;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000000C) endpoint 3 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP3R;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000010) endpoint 4 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP4R;
  __IM  uint16_t  RESERVED4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000014) endpoint 5 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP5R;
  __IM  uint16_t  RESERVED5;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000018) endpoint 6 register                                        */
    
