ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP6R;
  __IM  uint16_t  RESERVED6;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001C) endpoint 7 register                                        */
    
    struct {
      __IOM uint16_t EA         : 4;            /*!< [3..0] Endpoint address                                                   */
      __IOM uint16_t STAT_TX    : 2;            /*!< [5..4] Status bits, for transmission transfers                            */
      __IOM uint16_t DTOG_TX    : 1;            /*!< [6..6] Data Toggle, for transmission transfers                            */
      __IOM uint16_t CTR_TX     : 1;            /*!< [7..7] Correct Transfer for transmission                                  */
      __IOM uint16_t EP_KIND    : 1;            /*!< [8..8] Endpoint kind                                                      */
      __IOM uint16_t EP_TYPE    : 2;            /*!< [10..9] Endpoint type                                                     */
      __IOM uint16_t SETUP      : 1;            /*!< [11..11] Setup transaction completed                                      */
      __IOM uint16_t STAT_RX    : 2;            /*!< [13..12] Status bits, for reception transfers                             */
      __IOM uint16_t DTOG_RX    : 1;            /*!< [14..14] Data Toggle, for reception transfers                             */
      __IOM uint16_t CTR_RX     : 1;            /*!< [15..15] Correct transfer for reception                                   */
    } bit;
  } EP7R;
  __IM  uint16_t  RESERVED7;
  __IM  uint32_t  RESERVED8[8];
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000040) control register                                           */
    
    struct {
      __IOM uint16_t FRES       : 1;            /*!< [0..0] Force USB Reset                                                    */
      __IOM uint16_t PDWN       : 1;            /*!< [1..1] Power down                                                         */
      __IOM uint16_t LPMODE     : 1;            /*!< [2..2] Low-power mode                                                     */
      __IOM uint16_t FSUSP      : 1;            /*!< [3..3] Force suspend                                                      */
      __IOM uint16_t RESUME     : 1;            /*!< [4..4] Resume request                                                     */
      __IM  uint16_t            : 3;
      __IOM uint16_t ESOFM      : 1;            /*!< [8..8] Expected start of frame interrupt mask                             */
      __IOM uint16_t SOFM       : 1;            /*!< [9..9] Start of frame interrupt mask                                      */
      __IOM uint16_t RESETM     : 1;            /*!< [10..10] USB reset interrupt mask                                         */
      __IOM uint16_t SUSPM      : 1;            /*!< [11..11] Suspend mode interrupt mask                                      */
      __IOM uint16_t WKUPM      : 1;            /*!< [12..12] Wakeup interrupt mask                                            */
      __IOM uint16_t ERRM       : 1;            /*!< [13..13] Error interrupt mask                                             */
      __IOM uint16_t PMAOVRM    : 1;            /*!< [14..14] Packet memory area over / underrun interrupt mask                */
      __IOM uint16_t CTRM       : 1;            /*!< [15..15] Correct transfer interrupt mask                                  */
    } bit;
  } CNTR;
  __IM  uint16_t  RESERVED9;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000044) interrupt status register                                  */
    
    struct {
      __IOM uint16_t EP_ID      : 4;            /*!< [3..0] Endpoint Identifier                                                */
      __IOM uint16_t DIR        : 1;            /*!< [4..4] Direction of transaction                                           */
      __IM  uint16_t            : 3;
      __IOM uint16_t ESOF       : 1;            /*!< [8..8] Expected start frame                                               */
      __IOM uint16_t SOF        : 1;            /*!< [9..9] start of frame                                                     */
      __IOM uint16_t RESET      : 1;            /*!< [10..10] reset request                                                    */
      __IOM uint16_t SUSP       : 1;            /*!< [11..11] Suspend mode request                                             */
      __IOM uint16_t WKUP       : 1;            /*!< [12..12] Wakeup                                                           */
      __IOM uint16_t ERR        : 1;            /*!< [13..13] Error                                                            */
      __IOM uint16_t PMAOVR     : 1;            /*!< [14..14] Packet memory area over / underrun                               */
      __IOM uint16_t CTR        : 1;            /*!< [15..15] Correct transfer                                                 */
    } bit;
  } ISTR;
  __IM  uint16_t  RESERVED10;
  
  union {
    __IM  uint16_t reg;                         /*!< (@ 0x00000048) frame number register                                      */
    
