ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint16_t FN         : 11;           /*!< [10..0] Frame number                                                      */
      __IM  uint16_t LSOF       : 2;            /*!< [12..11] Lost SOF                                                         */
      __IM  uint16_t LCK        : 1;            /*!< [13..13] Locked                                                           */
      __IM  uint16_t RXDM       : 1;            /*!< [14..14] Receive data - line status                                       */
      __IM  uint16_t RXDP       : 1;            /*!< [15..15] Receive data + line status                                       */
    } bit;
  } FNR;
  __IM  uint16_t  RESERVED11;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000004C) device address                                             */
    
    struct {
      __IOM uint16_t ADD        : 7;            /*!< [6..0] Device address                                                     */
      __IOM uint16_t EF         : 1;            /*!< [7..7] Enable function                                                    */
    } bit;
  } DADDR;
  __IM  uint16_t  RESERVED12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Buffer table address                                       */
    
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t BTABLE     : 13;           /*!< [15..3] Buffer table                                                      */
    } bit;
  } BTABLE;
} USB_Type;                                     /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                           CAN1                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40006400) CAN1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) CAN Master control register                                */
    
    struct {
      __IOM uint32_t INRQ       : 1;            /*!< [0..0] Initialization request                                             */
      __IOM uint32_t SLEEP      : 1;            /*!< [1..1] Sleep mode request                                                 */
      __IOM uint32_t TXFP       : 1;            /*!< [2..2] Transmit FIFO priority                                             */
      __IOM uint32_t RFLM       : 1;            /*!< [3..3] Receive FIFO locked mode                                           */
      __IOM uint32_t NART       : 1;            /*!< [4..4] No automatic retransmission                                        */
      __IOM uint32_t AWUM       : 1;            /*!< [5..5] Automatic wakeup mode                                              */
      __IOM uint32_t ABOM       : 1;            /*!< [6..6] Automatic bus-off management                                       */
      __IOM uint32_t TTCM       : 1;            /*!< [7..7] Time triggered communication mode                                  */
      __IM  uint32_t            : 7;
      __IOM uint32_t RESET      : 1;            /*!< [15..15] Software master reset                                            */
      __IOM uint32_t DBF        : 1;            /*!< [16..16] Debug freeze                                                     */
    } bit;
  } CTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) CAN master status register                                 */
    
    struct {
      __IM  uint32_t INAK       : 1;            /*!< [0..0] Initialization acknowledge                                         */
      __IM  uint32_t SLAK       : 1;            /*!< [1..1] Sleep acknowledge                                                  */
      __IOM uint32_t ERRI       : 1;            /*!< [2..2] Error interrupt                                                    */
      __IOM uint32_t WKUI       : 1;            /*!< [3..3] Wakeup interrupt                                                   */
      __IOM uint32_t SLAKI      : 1;            /*!< [4..4] Sleep acknowledge interrupt                                        */
      __IM  uint32_t            : 3;
      __IM  uint32_t TXM        : 1;            /*!< [8..8] Transmit mode                                                      */
      __IM  uint32_t RXM        : 1;            /*!< [9..9] Receive mode                                                       */
      __IM  uint32_t SAMP       : 1;            /*!< [10..10] Last sample point                                                */
      __IM  uint32_t RX         : 1;            /*!< [11..11] Rx signal                                                        */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) CAN transmit status register                               */
    
    struct {
      __IOM uint32_t RQCP0      : 1;            /*!< [0..0] Request completed mailbox0                                         */
      __IOM uint32_t TXOK0      : 1;            /*!< [1..1] Transmission OK of mailbox0                                        */
      __IOM uint32_t ALST0      : 1;            /*!< [2..2] Arbitration lost for mailbox0                                      */
      __IOM uint32_t TERR0      : 1;            /*!< [3..3] Transmission error of mailbox0                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ0      : 1;            /*!< [7..7] Abort request for mailbox0                                         */
      __IOM uint32_t RQCP1      : 1;            /*!< [8..8] Request completed mailbox1                                         */
      __IOM uint32_t TXOK1      : 1;            /*!< [9..9] Transmission OK of mailbox1                                        */
      __IOM uint32_t ALST1      : 1;            /*!< [10..10] Arbitration lost for mailbox1                                    */
      __IOM uint32_t TERR1      : 1;            /*!< [11..11] Transmission error of mailbox1                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ1      : 1;            /*!< [15..15] Abort request for mailbox 1                                      */
      __IOM uint32_t RQCP2      : 1;            /*!< [16..16] Request completed mailbox2                                       */
      __IOM uint32_t TXOK2      : 1;            /*!< [17..17] Transmission OK of mailbox 2                                     */
      __IOM uint32_t ALST2      : 1;            /*!< [18..18] Arbitration lost for mailbox 2                                   */
      __IOM uint32_t TERR2      : 1;            /*!< [19..19] Transmission error of mailbox 2                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t ABRQ2      : 1;            /*!< [23..23] Abort request for mailbox 2                                      */
      __IM  uint32_t CODE       : 2;            /*!< [25..24] Mailbox code                                                     */
      __IM  uint32_t TME0       : 1;            /*!< [26..26] Transmit mailbox 0 empty                                         */
      __IM  uint32_t TME1       : 1;            /*!< [27..27] Transmit mailbox 1 empty                                         */
      __IM  uint32_t TME2       : 1;            /*!< [28..28] Transmit mailbox 2 empty                                         */
      __IM  uint32_t LOW0       : 1;            /*!< [29..29] Lowest priority flag for mailbox 0                               */
      __IM  uint32_t LOW1       : 1;            /*!< [30..30] Lowest priority flag for mailbox 1                               */
      __IM  uint32_t LOW2       : 1;            /*!< [31..31] Lowest priority flag for mailbox 2                               */
    } bit;
  } TSTATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) CAN receive FIFO 0 register                                */
    
