ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t FMP0       : 2;            /*!< [1..0] FIFO 0 message pending                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL0      : 1;            /*!< [3..3] FIFO 0 full                                                        */
      __IOM uint32_t FOVR0      : 1;            /*!< [4..4] FIFO 0 overrun                                                     */
      __IOM uint32_t RFOM0      : 1;            /*!< [5..5] Release FIFO 0 output mailbox                                      */
    } bit;
  } RFIFO0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CAN receive FIFO 1 register                                */
    
    struct {
      __IM  uint32_t FMP1       : 2;            /*!< [1..0] FIFO 1 message pending                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t FULL1      : 1;            /*!< [3..3] FIFO 1 full                                                        */
      __IOM uint32_t FOVR1      : 1;            /*!< [4..4] FIFO 1 overrun                                                     */
      __IOM uint32_t RFOM1      : 1;            /*!< [5..5] Release FIFO 1 output mailbox                                      */
    } bit;
  } RFIFO1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) CAN interrupt enable register                              */
    
    struct {
      __IOM uint32_t TMEIE      : 1;            /*!< [0..0] Transmit mailbox empty interrupt  enable                           */
      __IOM uint32_t FMPIE0     : 1;            /*!< [1..1] FIFO message pending interrupt  enable                             */
      __IOM uint32_t FFIE0      : 1;            /*!< [2..2] FIFO full interrupt  enable                                        */
      __IOM uint32_t FOVIE0     : 1;            /*!< [3..3] FIFO overrun interrupt  enable                                     */
      __IOM uint32_t FMPIE1     : 1;            /*!< [4..4] FIFO message pending interrupt  enable                             */
      __IOM uint32_t FFIE1      : 1;            /*!< [5..5] FIFO full interrupt  enable                                        */
      __IOM uint32_t FOVIE1     : 1;            /*!< [6..6] FIFO overrun interrupt  enable                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t EWGIE      : 1;            /*!< [8..8] Error warning interrupt  enable                                    */
      __IOM uint32_t EPVIE      : 1;            /*!< [9..9] Error passive interrupt  enable                                    */
      __IOM uint32_t BOFIE      : 1;            /*!< [10..10] Bus-off interrupt  enable                                        */
      __IOM uint32_t LECIE      : 1;            /*!< [11..11] Last error code interrupt  enable                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t ERRIE      : 1;            /*!< [15..15] Error interrupt  enable                                          */
      __IOM uint32_t WKUIE      : 1;            /*!< [16..16] Wakeup interrupt  enable                                         */
      __IOM uint32_t SLKIE      : 1;            /*!< [17..17] Sleep interrupt  enable                                          */
    } bit;
  } INTENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) CAN error status register                                  */
    
    struct {
      __IM  uint32_t EWGF       : 1;            /*!< [0..0] Error warning  flag                                                */
      __IM  uint32_t EPVF       : 1;            /*!< [1..1] Error passive  flag                                                */
      __IM  uint32_t BOFF       : 1;            /*!< [2..2] Bus-off  flag                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t LEC        : 3;            /*!< [6..4] Last error code                                                    */
      __IM  uint32_t            : 9;
      __IM  uint32_t TEC        : 8;            /*!< [23..16] Least significant byte of the 9-bit transmit error
                                                     counter                                                                   */
      __IM  uint32_t REC        : 8;            /*!< [31..24] Receive error counter                                            */
    } bit;
  } ERRSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) CAN bit timing register                                    */
    
    struct {
      __IOM uint32_t BRP        : 10;           /*!< [9..0] Baud rate prescaler                                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t TS1        : 4;            /*!< [19..16] Time segment 1                                                   */
      __IOM uint32_t TS2        : 3;            /*!< [22..20] Time segment 2                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t SJW        : 2;            /*!< [25..24] Resynchronization jump width                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t LBKM       : 1;            /*!< [30..30] Loop back mode (debug)                                           */
      __IOM uint32_t SILM       : 1;            /*!< [31..31] Silent mode (debug)                                              */
    } bit;
  } BTIMR;
  __IM  uint32_t  RESERVED[88];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) CAN TX mailbox identifier register                         */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] Transmit mailbox request                                           */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] Remote transmission request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] Identifier extension                                               */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] extended identifier                                               */
      __IOM uint32_t STID       : 11;           /*!< [31..21] Standard identifier                                              */
    } bit;
  } TXMIR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000184) CAN mailbox data length control and time stamp
                                                                    register                                                   */
    
