ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data length code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] Transmit global time                                               */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] Message time stamp                                               */
    } bit;
  } TXMDTR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000188) CAN mailbox data low register                              */
    
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] Data byte 0                                                        */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] Data byte 1                                                       */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] Data byte 2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] Data byte 3                                                      */
    } bit;
  } TXMDLR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000018C) CAN mailbox data high register                             */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] Data byte 4                                                        */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] Data byte 5                                                       */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] Data byte 6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] Data byte 7                                                      */
    } bit;
  } TXMDHR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) CAN TX mailbox identifier register                         */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] Transmit mailbox request                                           */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] Remote transmission request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] Identifier extension                                               */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] extended identifier                                               */
      __IOM uint32_t STID       : 11;           /*!< [31..21] Standard identifier                                              */
    } bit;
  } TXMIR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000194) CAN mailbox data length control and time stamp
                                                                    register                                                   */
    
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data length code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] Transmit global time                                               */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] Message time stamp                                               */
    } bit;
  } TXMDTR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000198) CAN mailbox data low register                              */
    
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] Data byte 0                                                        */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] Data byte 1                                                       */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] Data byte 2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] Data byte 3                                                      */
    } bit;
  } TXMDLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000019C) CAN mailbox data high register                             */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] Data byte 4                                                        */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] Data byte 5                                                       */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] Data byte 6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] Data byte 7                                                      */
    } bit;
  } TXMDHR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A0) CAN TX mailbox identifier register                         */
    
    struct {
      __IOM uint32_t TXRQ       : 1;            /*!< [0..0] Transmit mailbox request                                           */
      __IOM uint32_t RTR        : 1;            /*!< [1..1] Remote transmission request                                        */
      __IOM uint32_t IDE        : 1;            /*!< [2..2] Identifier extension                                               */
      __IOM uint32_t EXID       : 18;           /*!< [20..3] extended identifier                                               */
      __IOM uint32_t STID       : 11;           /*!< [31..21] Standard identifier                                              */
    } bit;
  } TXMIR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A4) CAN mailbox data length control and time stamp
                                                                    register                                                   */
    
