ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DLC        : 4;            /*!< [3..0] Data length code                                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t TGT        : 1;            /*!< [8..8] Transmit global time                                               */
      __IM  uint32_t            : 7;
      __IOM uint32_t TIME       : 16;           /*!< [31..16] Message time stamp                                               */
    } bit;
  } TXMDTR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001A8) CAN mailbox data low register                              */
    
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] Data byte 0                                                        */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] Data byte 1                                                       */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] Data byte 2                                                      */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] Data byte 3                                                      */
    } bit;
  } TXMDLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000001AC) CAN mailbox data high register                             */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] Data byte 4                                                        */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] Data byte 5                                                       */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] Data byte 6                                                      */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] Data byte 7                                                      */
    } bit;
  } TXMDHR2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B0) CAN receive FIFO mailbox identifier register               */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< [1..1] Remote transmission request                                        */
      __IM  uint32_t IDE        : 1;            /*!< [2..2] Identifier extension                                               */
      __IM  uint32_t EXID       : 18;           /*!< [20..3] extended identifier                                               */
      __IM  uint32_t STID       : 11;           /*!< [31..21] Standard identifier                                              */
    } bit;
  } RXMIR0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B4) CAN receive FIFO mailbox data length control
                                                                    and time stamp  register                                   */
    
    struct {
      __IM  uint32_t DLC        : 4;            /*!< [3..0] Data length code                                                   */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< [15..8] Filter match index                                                */
      __IM  uint32_t TIME       : 16;           /*!< [31..16] Message time stamp                                               */
    } bit;
  } RXMDTR0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001B8) CAN receive FIFO mailbox data low register                 */
    
    struct {
      __IM  uint32_t DATA0      : 8;            /*!< [7..0] Data Byte 0                                                        */
      __IM  uint32_t DATA1      : 8;            /*!< [15..8] Data Byte 1                                                       */
      __IM  uint32_t DATA2      : 8;            /*!< [23..16] Data Byte 2                                                      */
      __IM  uint32_t DATA3      : 8;            /*!< [31..24] Data Byte 3                                                      */
    } bit;
  } RXMDLR0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001BC) CAN receive FIFO mailbox data high register                */
    
    struct {
      __IM  uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } RXMDHR0;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C0) CAN receive FIFO mailbox identifier register               */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t RTR        : 1;            /*!< [1..1] Remote transmission request                                        */
      __IM  uint32_t IDE        : 1;            /*!< [2..2] Identifier extension                                               */
      __IM  uint32_t EXID       : 18;           /*!< [20..3] extended identifier                                               */
      __IM  uint32_t STID       : 11;           /*!< [31..21] Standard identifier                                              */
    } bit;
  } RXMIR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C4) CAN receive FIFO mailbox data length control
                                                                    and time stamp  register                                   */
    
    struct {
      __IM  uint32_t DLC        : 4;            /*!< [3..0] Data length code                                                   */
      __IM  uint32_t            : 4;
      __IM  uint32_t FMI        : 8;            /*!< [15..8] Filter match index                                                */
      __IM  uint32_t TIME       : 16;           /*!< [31..16] Message time stamp                                               */
    } bit;
  } RXMDTR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001C8) CAN receive FIFO mailbox data low register                 */
    
