ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t DATA0      : 8;            /*!< [7..0] Data Byte 0                                                        */
      __IM  uint32_t DATA1      : 8;            /*!< [15..8] Data Byte 1                                                       */
      __IM  uint32_t DATA2      : 8;            /*!< [23..16] Data Byte 2                                                      */
      __IM  uint32_t DATA3      : 8;            /*!< [31..24] Data Byte 3                                                      */
    } bit;
  } RXMDLR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000001CC) CAN receive FIFO mailbox data high register                */
    
    struct {
      __IM  uint32_t DATA4      : 8;            /*!< [7..0] DATA4                                                              */
      __IM  uint32_t DATA5      : 8;            /*!< [15..8] DATA5                                                             */
      __IM  uint32_t DATA6      : 8;            /*!< [23..16] DATA6                                                            */
      __IM  uint32_t DATA7      : 8;            /*!< [31..24] DATA7                                                            */
    } bit;
  } RXMDHR1;
  __IM  uint32_t  RESERVED1[12];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000200) CAN filter master register                                 */
    
    struct {
      __IOM uint32_t FINIT      : 1;            /*!< [0..0] Filter init mode                                                   */
      __IM  uint32_t            : 7;
      __IOM uint32_t CAN2SB     : 6;            /*!< [13..8] CAN2 start bank                                                   */
    } bit;
  } FCTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000204) CAN filter mode register                                   */
    
    struct {
      __IOM uint32_t FBM0       : 1;            /*!< [0..0] Filter mode                                                        */
      __IOM uint32_t FBM1       : 1;            /*!< [1..1] Filter mode                                                        */
      __IOM uint32_t FBM2       : 1;            /*!< [2..2] Filter mode                                                        */
      __IOM uint32_t FBM3       : 1;            /*!< [3..3] Filter mode                                                        */
      __IOM uint32_t FBM4       : 1;            /*!< [4..4] Filter mode                                                        */
      __IOM uint32_t FBM5       : 1;            /*!< [5..5] Filter mode                                                        */
      __IOM uint32_t FBM6       : 1;            /*!< [6..6] Filter mode                                                        */
      __IOM uint32_t FBM7       : 1;            /*!< [7..7] Filter mode                                                        */
      __IOM uint32_t FBM8       : 1;            /*!< [8..8] Filter mode                                                        */
      __IOM uint32_t FBM9       : 1;            /*!< [9..9] Filter mode                                                        */
      __IOM uint32_t FBM10      : 1;            /*!< [10..10] Filter mode                                                      */
      __IOM uint32_t FBM11      : 1;            /*!< [11..11] Filter mode                                                      */
      __IOM uint32_t FBM12      : 1;            /*!< [12..12] Filter mode                                                      */
      __IOM uint32_t FBM13      : 1;            /*!< [13..13] Filter mode                                                      */
    } bit;
  } FMCFGR;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000020C) CAN filter scale register                                  */
    
    struct {
      __IOM uint32_t FSC0       : 1;            /*!< [0..0] Filter scale configuration                                         */
      __IOM uint32_t FSC1       : 1;            /*!< [1..1] Filter scale configuration                                         */
      __IOM uint32_t FSC2       : 1;            /*!< [2..2] Filter scale configuration                                         */
      __IOM uint32_t FSC3       : 1;            /*!< [3..3] Filter scale configuration                                         */
      __IOM uint32_t FSC4       : 1;            /*!< [4..4] Filter scale configuration                                         */
      __IOM uint32_t FSC5       : 1;            /*!< [5..5] Filter scale configuration                                         */
      __IOM uint32_t FSC6       : 1;            /*!< [6..6] Filter scale configuration                                         */
      __IOM uint32_t FSC7       : 1;            /*!< [7..7] Filter scale configuration                                         */
      __IOM uint32_t FSC8       : 1;            /*!< [8..8] Filter scale configuration                                         */
      __IOM uint32_t FSC9       : 1;            /*!< [9..9] Filter scale configuration                                         */
      __IOM uint32_t FSC10      : 1;            /*!< [10..10] Filter scale configuration                                       */
      __IOM uint32_t FSC11      : 1;            /*!< [11..11] Filter scale configuration                                       */
      __IOM uint32_t FSC12      : 1;            /*!< [12..12] Filter scale configuration                                       */
      __IOM uint32_t FSC13      : 1;            /*!< [13..13] Filter scale configuration                                       */
    } bit;
  } FSCFGR;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000214) CAN filter FIFO assignment register                        */
    
    struct {
      __IOM uint32_t FFA0       : 1;            /*!< [0..0] Filter FIFO assignment for filter 0                                */
      __IOM uint32_t FFA1       : 1;            /*!< [1..1] Filter FIFO assignment for filter 1                                */
      __IOM uint32_t FFA2       : 1;            /*!< [2..2] Filter FIFO assignment for filter 2                                */
      __IOM uint32_t FFA3       : 1;            /*!< [3..3] Filter FIFO assignment for filter 3                                */
      __IOM uint32_t FFA4       : 1;            /*!< [4..4] Filter FIFO assignment for filter 4                                */
      __IOM uint32_t FFA5       : 1;            /*!< [5..5] Filter FIFO assignment for filter 5                                */
      __IOM uint32_t FFA6       : 1;            /*!< [6..6] Filter FIFO assignment for filter 6                                */
      __IOM uint32_t FFA7       : 1;            /*!< [7..7] Filter FIFO assignment for filter 7                                */
      __IOM uint32_t FFA8       : 1;            /*!< [8..8] Filter FIFO assignment for filter 8                                */
      __IOM uint32_t FFA9       : 1;            /*!< [9..9] Filter FIFO assignment for filter 9                                */
      __IOM uint32_t FFA10      : 1;            /*!< [10..10] Filter FIFO assignment for filter 10                             */
      __IOM uint32_t FFA11      : 1;            /*!< [11..11] Filter FIFO assignment for filter 11                             */
      __IOM uint32_t FFA12      : 1;            /*!< [12..12] Filter FIFO assignment for filter 12                             */
      __IOM uint32_t FFA13      : 1;            /*!< [13..13] Filter FIFO assignment for filter 13                             */
    } bit;
  } FAFIFOR;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000021C) CAN filter activation register                             */
    
