ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t FACT0      : 1;            /*!< [0..0] Filter active                                                      */
      __IOM uint32_t FACT1      : 1;            /*!< [1..1] Filter active                                                      */
      __IOM uint32_t FACT2      : 1;            /*!< [2..2] Filter active                                                      */
      __IOM uint32_t FACT3      : 1;            /*!< [3..3] Filter active                                                      */
      __IOM uint32_t FACT4      : 1;            /*!< [4..4] Filter active                                                      */
      __IOM uint32_t FACT5      : 1;            /*!< [5..5] Filter active                                                      */
      __IOM uint32_t FACT6      : 1;            /*!< [6..6] Filter active                                                      */
      __IOM uint32_t FACT7      : 1;            /*!< [7..7] Filter active                                                      */
      __IOM uint32_t FACT8      : 1;            /*!< [8..8] Filter active                                                      */
      __IOM uint32_t FACT9      : 1;            /*!< [9..9] Filter active                                                      */
      __IOM uint32_t FACT10     : 1;            /*!< [10..10] Filter active                                                    */
      __IOM uint32_t FACT11     : 1;            /*!< [11..11] Filter active                                                    */
      __IOM uint32_t FACT12     : 1;            /*!< [12..12] Filter active                                                    */
      __IOM uint32_t FACT13     : 1;            /*!< [13..13] Filter active                                                    */
    } bit;
  } FWR;
  __IM  uint32_t  RESERVED5[8];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000240) Filter bank 0 register 1                                   */
    
    struct {
      __IOM uint32_t FB0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IOM uint32_t FB1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IOM uint32_t FB2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IOM uint32_t FB3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IOM uint32_t FB4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IOM uint32_t FB5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IOM uint32_t FB6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IOM uint32_t FB7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IOM uint32_t FB8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IOM uint32_t FB9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IOM uint32_t FB10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IOM uint32_t FB11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IOM uint32_t FB12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IOM uint32_t FB13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IOM uint32_t FB14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IOM uint32_t FB15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IOM uint32_t FB16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IOM uint32_t FB17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IOM uint32_t FB18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IOM uint32_t FB19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IOM uint32_t FB20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IOM uint32_t FB21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IOM uint32_t FB22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IOM uint32_t FB23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IOM uint32_t FB24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IOM uint32_t FB25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IOM uint32_t FB26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IOM uint32_t FB27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IOM uint32_t FB28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IOM uint32_t FB29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IOM uint32_t FB30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IOM uint32_t FB31       : 1;            /*!< [31..31] Filter bits                                                      */
    } bit;
  } F0R1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000244) Filter bank 0 register 2                                   */
    
