ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t FB0        : 1;            /*!< [0..0] Filter bits                                                        */
      __IOM uint32_t FB1        : 1;            /*!< [1..1] Filter bits                                                        */
      __IOM uint32_t FB2        : 1;            /*!< [2..2] Filter bits                                                        */
      __IOM uint32_t FB3        : 1;            /*!< [3..3] Filter bits                                                        */
      __IOM uint32_t FB4        : 1;            /*!< [4..4] Filter bits                                                        */
      __IOM uint32_t FB5        : 1;            /*!< [5..5] Filter bits                                                        */
      __IOM uint32_t FB6        : 1;            /*!< [6..6] Filter bits                                                        */
      __IOM uint32_t FB7        : 1;            /*!< [7..7] Filter bits                                                        */
      __IOM uint32_t FB8        : 1;            /*!< [8..8] Filter bits                                                        */
      __IOM uint32_t FB9        : 1;            /*!< [9..9] Filter bits                                                        */
      __IOM uint32_t FB10       : 1;            /*!< [10..10] Filter bits                                                      */
      __IOM uint32_t FB11       : 1;            /*!< [11..11] Filter bits                                                      */
      __IOM uint32_t FB12       : 1;            /*!< [12..12] Filter bits                                                      */
      __IOM uint32_t FB13       : 1;            /*!< [13..13] Filter bits                                                      */
      __IOM uint32_t FB14       : 1;            /*!< [14..14] Filter bits                                                      */
      __IOM uint32_t FB15       : 1;            /*!< [15..15] Filter bits                                                      */
      __IOM uint32_t FB16       : 1;            /*!< [16..16] Filter bits                                                      */
      __IOM uint32_t FB17       : 1;            /*!< [17..17] Filter bits                                                      */
      __IOM uint32_t FB18       : 1;            /*!< [18..18] Filter bits                                                      */
      __IOM uint32_t FB19       : 1;            /*!< [19..19] Filter bits                                                      */
      __IOM uint32_t FB20       : 1;            /*!< [20..20] Filter bits                                                      */
      __IOM uint32_t FB21       : 1;            /*!< [21..21] Filter bits                                                      */
      __IOM uint32_t FB22       : 1;            /*!< [22..22] Filter bits                                                      */
      __IOM uint32_t FB23       : 1;            /*!< [23..23] Filter bits                                                      */
      __IOM uint32_t FB24       : 1;            /*!< [24..24] Filter bits                                                      */
      __IOM uint32_t FB25       : 1;            /*!< [25..25] Filter bits                                                      */
      __IOM uint32_t FB26       : 1;            /*!< [26..26] Filter bits                                                      */
      __IOM uint32_t FB27       : 1;            /*!< [27..27] Filter bits                                                      */
      __IOM uint32_t FB28       : 1;            /*!< [28..28] Filter bits                                                      */
      __IOM uint32_t FB29       : 1;            /*!< [29..29] Filter bits                                                      */
      __IOM uint32_t FB30       : 1;            /*!< [30..30] Filter bits                                                      */
      __IOM uint32_t FB31       : 1;            /*!< [31..31] Filter bits                                                      */
    } bit;
  } F27R2;
} CAN1_Type;                                    /*!< Size = 800 (0x320)                                                        */



/* =========================================================================================================================== */
/* ================                                       ETHERNET_MAC                                        ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40028000) ETHERNET_MAC Structure                                     */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Ethernet MAC configuration register (ETH_MACCR)            */
    
    struct {
      __IOM uint32_t TCES       : 1;            /*!< [0..0] Send clock selection bit                                           */
      __IOM uint32_t TCF        : 1;            /*!< [1..1] Send clock reversal                                                */
      __IOM uint32_t RE         : 1;            /*!< [2..2] Receiver enable                                                    */
      __IOM uint32_t TE         : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IOM uint32_t DC         : 1;            /*!< [4..4] Deferral check                                                     */
      __IOM uint32_t BL         : 2;            /*!< [6..5] Back-off limit                                                     */
      __IOM uint32_t APCS       : 1;            /*!< [7..7] Automatic pad/CRC stripping                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t RD         : 1;            /*!< [9..9] Retry disable                                                      */
      __IOM uint32_t IPCO       : 1;            /*!< [10..10] IPv4 checksum offload                                            */
      __IOM uint32_t DM         : 1;            /*!< [11..11] Duplex mode                                                      */
      __IOM uint32_t LM         : 1;            /*!< [12..12] Loopback mode                                                    */
      __IOM uint32_t ROD        : 1;            /*!< [13..13] Receive own disable                                              */
      __IOM uint32_t FES        : 1;            /*!< [14..14] Fast Ethernet speed                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CSD        : 1;            /*!< [16..16] Carrier sense disable                                            */
      __IOM uint32_t IFG        : 3;            /*!< [19..17] Interframe gap                                                   */
      __IOM uint32_t IRE        : 1;            /*!< [20..20] 10MPHY 50Ω set                                                  */
      __IOM uint32_t PDI        : 1;            /*!< [21..21] 10MPHY TX DRIVER bisa current                                    */
      __IOM uint32_t JD         : 1;            /*!< [22..22] Jabber disable                                                   */
      __IOM uint32_t WD         : 1;            /*!< [23..23] Watchdog disable                                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t TCD        : 3;            /*!< [31..29] SEND clock delay                                                 */
    } bit;
  } MACCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Ethernet MAC frame filter register (ETH_MACCFFR)           */
    
