ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t PM         : 1;            /*!< [0..0] Promiscuous mode                                                   */
      __IOM uint32_t HU         : 1;            /*!< [1..1] Hash unicast                                                       */
      __IOM uint32_t HM         : 1;            /*!< [2..2] Hash multicast                                                     */
      __IOM uint32_t DAIF       : 1;            /*!< [3..3] Destination address inverse filtering                              */
      __IOM uint32_t PAM        : 1;            /*!< [4..4] Pass all multicast                                                 */
      __IOM uint32_t BFD        : 1;            /*!< [5..5] Broadcast frames disable                                           */
      __IOM uint32_t PCF        : 2;            /*!< [7..6] Pass control frames                                                */
      __IOM uint32_t SAIF       : 1;            /*!< [8..8] Source address inverse filtering                                   */
      __IOM uint32_t SAF        : 1;            /*!< [9..9] Source address filter                                              */
      __IOM uint32_t HPF        : 1;            /*!< [10..10] Hash or perfect filter                                           */
      __IM  uint32_t            : 20;
      __IOM uint32_t RA         : 1;            /*!< [31..31] Receive all                                                      */
    } bit;
  } MACFFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Ethernet MAC hash table high register                      */
    
    struct {
      __IOM uint32_t HTH        : 32;           /*!< [31..0] Hash table high                                                   */
    } bit;
  } MACHTHR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Ethernet MAC hash table low register                       */
    
    struct {
      __IOM uint32_t HTL        : 32;           /*!< [31..0] Hash table low                                                    */
    } bit;
  } MACHTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Ethernet MAC MII address register (ETH_MACMIIAR)           */
    
    struct {
      __IOM uint32_t MB         : 1;            /*!< [0..0] MII busy                                                           */
      __IOM uint32_t MW         : 1;            /*!< [1..1] MII write                                                          */
      __IOM uint32_t CR         : 3;            /*!< [4..2] Clock range                                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t MR         : 5;            /*!< [10..6] MII register                                                      */
      __IOM uint32_t PA         : 5;            /*!< [15..11] PHY address                                                      */
    } bit;
  } MACMIIAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Ethernet MAC MII data register (ETH_MACMIIDR)              */
    
    struct {
      __IOM uint32_t MD         : 16;           /*!< [15..0] MII data                                                          */
    } bit;
  } MACMIIDR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Ethernet MAC flow control register (ETH_MACFCR)            */
    
    struct {
      __IOM uint32_t FCB_BPA    : 1;            /*!< [0..0] Flow control busy/back pressure activate                           */
      __IOM uint32_t TFCE       : 1;            /*!< [1..1] Transmit flow control enable                                       */
      __IOM uint32_t RFCE       : 1;            /*!< [2..2] Receive flow control enable                                        */
      __IOM uint32_t UPFD       : 1;            /*!< [3..3] Unicast pause frame detect                                         */
      __IOM uint32_t PLT        : 2;            /*!< [5..4] Pause low threshold                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t ZQPD       : 1;            /*!< [7..7] Zero-quanta pause disable                                          */
      __IM  uint32_t            : 8;
      __IOM uint32_t PT         : 16;           /*!< [31..16] Pass control frames                                              */
    } bit;
  } MACFCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Ethernet MAC VLAN tag register (ETH_MACVLANTR)             */
    
    struct {
      __IOM uint32_t VLANTI     : 16;           /*!< [15..0] VLAN tag identifier (for receive frames)                          */
      __IOM uint32_t VLANTC     : 1;            /*!< [16..16] 12-bit VLAN tag comparison                                       */
    } bit;
  } MACVLANTR;
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  MACRWUFFR;                    /*!< (@ 0x00000028) Ethernet MAC remote wakeup frame filter register
                                                                    (ETH_MACRWUFFR)                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Ethernet MAC PMT control and status register
                                                                    (ETH_MACPMTCSR)                                            */
    
    struct {
      __IOM uint32_t PD         : 1;            /*!< [0..0] Power down                                                         */
      __IOM uint32_t MPE        : 1;            /*!< [1..1] Magic Packet enable                                                */
      __IOM uint32_t WFE        : 1;            /*!< [2..2] Wakeup frame enable                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t MPR        : 1;            /*!< [5..5] Magic packet received                                              */
      __IOM uint32_t WFR        : 1;            /*!< [6..6] Wakeup frame received                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t GU         : 1;            /*!< [9..9] Global unicast                                                     */
      __IM  uint32_t            : 21;
      __IOM uint32_t WFFRPR     : 1;            /*!< [31..31] Wakeup frame filter register pointer reset                       */
    } bit;
  } MACPMTCSR;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Ethernet MAC interrupt status register (ETH_MACSR)         */
    
