ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t PMTS       : 1;            /*!< [3..3] PMT status                                                         */
      __IOM uint32_t MMCS       : 1;            /*!< [4..4] MMC status                                                         */
      __IOM uint32_t MMCRS      : 1;            /*!< [5..5] MMC receive status                                                 */
      __IOM uint32_t MMCTS      : 1;            /*!< [6..6] MMC transmit status                                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t TSTS       : 1;            /*!< [9..9] Time stamp trigger status                                          */
    } bit;
  } MACSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Ethernet MAC interrupt mask register (ETH_MACIMR)          */
    
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t PMTIM      : 1;            /*!< [3..3] PMT interrupt mask                                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t TSTIM      : 1;            /*!< [9..9] Time stamp trigger interrupt mask                                  */
    } bit;
  } MACIMR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Ethernet MAC address 0 high register (ETH_MACA0HR)         */
    
    struct {
      __IOM uint32_t MACA0H     : 16;           /*!< [15..0] MAC address0 high                                                 */
      __IM  uint32_t            : 15;
      __IM  uint32_t MO         : 1;            /*!< [31..31] Always 1                                                         */
    } bit;
  } MACA0HR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Ethernet MAC address 0 low register                        */
    
    struct {
      __IOM uint32_t MACA0L     : 32;           /*!< [31..0] MAC address0 low                                                  */
    } bit;
  } MACA0LR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Ethernet MAC address 1 high register (ETH_MACA1HR)         */
    
    struct {
      __IOM uint32_t MACA1H     : 16;           /*!< [15..0] MAC address1 high                                                 */
      __IM  uint32_t            : 8;
      __IOM uint32_t MBC        : 6;            /*!< [29..24] Mask byte control                                                */
      __IOM uint32_t SA         : 1;            /*!< [30..30] Source address                                                   */
      __IOM uint32_t AE         : 1;            /*!< [31..31] Address enable                                                   */
    } bit;
  } MACA1HR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Ethernet MAC address1 low register                         */
    
    struct {
      __IOM uint32_t MACA1L     : 32;           /*!< [31..0] MAC address1 low                                                  */
    } bit;
  } MACA1LR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Ethernet MAC address 2 high register (ETH_MACA2HR)         */
    
    struct {
      __IOM uint32_t ETH_MACA2HR : 16;          /*!< [15..0] Ethernet MAC address 2 high register                              */
      __IM  uint32_t            : 8;
      __IOM uint32_t MBC        : 6;            /*!< [29..24] Mask byte control                                                */
      __IOM uint32_t SA         : 1;            /*!< [30..30] Source address                                                   */
      __IOM uint32_t AE         : 1;            /*!< [31..31] Address enable                                                   */
    } bit;
  } MACA2HR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Ethernet MAC address 2 low register                        */
    
    struct {
      __IOM uint32_t MACA2L     : 31;           /*!< [30..0] MAC address2 low                                                  */
    } bit;
  } MACA2LR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Ethernet MAC address 3 high register (ETH_MACA3HR)         */
    
    struct {
      __IOM uint32_t MACA3H     : 16;           /*!< [15..0] MAC address3 high                                                 */
      __IM  uint32_t            : 8;
      __IOM uint32_t MBC        : 6;            /*!< [29..24] Mask byte control                                                */
      __IOM uint32_t SA         : 1;            /*!< [30..30] Source address                                                   */
      __IOM uint32_t AE         : 1;            /*!< [31..31] Address enable                                                   */
    } bit;
  } MACA3HR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Ethernet MAC address 3 low register                        */
    
    struct {
      __IOM uint32_t MBCA3L     : 32;           /*!< [31..0] MAC address3 low                                                  */
    } bit;
  } MACA3LR;
} ETHERNET_MAC_Type;                            /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                       ETHERNET_MMC                                        ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40028100) ETHERNET_MMC Structure                                     */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Ethernet MMC control register (ETH_MMCCR)                  */
    
