ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CR         : 1;            /*!< [0..0] Counter reset                                                      */
      __IOM uint32_t CSR        : 1;            /*!< [1..1] Counter stop rollover                                              */
      __IOM uint32_t ROR        : 1;            /*!< [2..2] Reset on read                                                      */
      __IM  uint32_t            : 28;
      __IOM uint32_t MCF        : 1;            /*!< [31..31] MMC counter freeze                                               */
    } bit;
  } MMCCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Ethernet MMC receive interrupt register (ETH_MMCRIR)       */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t RFCES      : 1;            /*!< [5..5] Received frames CRC error status                                   */
      __IOM uint32_t RFAES      : 1;            /*!< [6..6] Received frames alignment error status                             */
      __IM  uint32_t            : 10;
      __IOM uint32_t RGUFS      : 1;            /*!< [17..17] Received Good Unicast Frames Status                              */
    } bit;
  } MMCRIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Ethernet MMC transmit interrupt register (ETH_MMCTIR)      */
    
    struct {
      __IM  uint32_t            : 14;
      __IOM uint32_t TGFSCS     : 1;            /*!< [14..14] Transmitted good frames single collision status                  */
      __IOM uint32_t TGFMSCS    : 1;            /*!< [15..15] Transmitted good frames more single collision status             */
      __IM  uint32_t            : 5;
      __IOM uint32_t TGFS       : 1;            /*!< [21..21] Transmitted good frames status                                   */
    } bit;
  } MMCTIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Ethernet MMC receive interrupt mask register
                                                                    (ETH_MMCRIMR)                                              */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t RFCEM      : 1;            /*!< [5..5] Received frame CRC error mask                                      */
      __IOM uint32_t RFAEM      : 1;            /*!< [6..6] Received frames alignment error mask                               */
      __IM  uint32_t            : 10;
      __IOM uint32_t RGUFM      : 1;            /*!< [17..17] Received good unicast frames mask                                */
    } bit;
  } MMCRIMR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Ethernet MMC transmit interrupt mask register
                                                                    (ETH_MMCTIMR)                                              */
    
    struct {
      __IM  uint32_t            : 14;
      __IOM uint32_t TGFSCM     : 1;            /*!< [14..14] Transmitted good frames single collision mask                    */
      __IOM uint32_t TGFMSCM    : 1;            /*!< [15..15] Transmitted good frames more single collision mask               */
      __IM  uint32_t            : 5;
      __IOM uint32_t TGFM       : 1;            /*!< [21..21] Transmitted good frames mask                                     */
    } bit;
  } MMCTIMR;
  __IM  uint32_t  RESERVED[14];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) Ethernet MMC transmitted good frames after a
                                                                    single collision counter                                   */
    
    struct {
      __IM  uint32_t TGFSCC     : 32;           /*!< [31..0] Transmitted good frames after a single collision counter          */
    } bit;
  } MMCTGFSCCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000050) Ethernet MMC transmitted good frames after more
                                                                    than a single collision                                    */
    
    struct {
      __IM  uint32_t TGFMSCC    : 32;           /*!< [31..0] Transmitted good frames after more than a single collision
                                                     counter                                                                   */
    } bit;
  } MMCTGFMSCCR;
  __IM  uint32_t  RESERVED1[5];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000068) Ethernet MMC transmitted good frames counter
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t TGFC       : 32;           /*!< [31..0] Transmitted good frames counter                                   */
    } bit;
  } MMCTGFCR;
  __IM  uint32_t  RESERVED2[10];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000094) Ethernet MMC received frames with CRC error counter
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t RFCFC      : 32;           /*!< [31..0] Received frames with CRC error counter                            */
    } bit;
  } MMCRFCECR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000098) Ethernet MMC received frames with alignment error
                                                                    counter register                                           */
    
    struct {
      __IM  uint32_t RFAEC      : 32;           /*!< [31..0] Received frames with alignment error counter                      */
    } bit;
  } MMCRFAECR;
  __IM  uint32_t  RESERVED3[10];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000C4) MMC received good unicast frames counter register          */
    
    struct {
      __IM  uint32_t RGUFC      : 32;           /*!< [31..0] Received good unicast frames counter                              */
    } bit;
  } MMCRGUFCR;
} ETHERNET_MMC_Type;                            /*!< Size = 200 (0xc8)                                                         */



/* =========================================================================================================================== */
/* ================                                       ETHERNET_PTP                                        ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40028700) ETHERNET_PTP Structure                                     */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Ethernet PTP time stamp control register (ETH_PTPTSCR)     */
    
