ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t TSE        : 1;            /*!< [0..0] Time stamp enable                                                  */
      __IOM uint32_t TSFCU      : 1;            /*!< [1..1] Time stamp fine or coarse update                                   */
      __IOM uint32_t TSSTI      : 1;            /*!< [2..2] Time stamp system time initialize                                  */
      __IOM uint32_t TSSTU      : 1;            /*!< [3..3] Time stamp system time update                                      */
      __IOM uint32_t TSITE      : 1;            /*!< [4..4] Time stamp interrupt trigger enable                                */
      __IOM uint32_t TSARU      : 1;            /*!< [5..5] Time stamp addend register update                                  */
    } bit;
  } PTPTSCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Ethernet PTP subsecond increment register                  */
    
    struct {
      __IOM uint32_t STSSI      : 8;            /*!< [7..0] System time subsecond increment                                    */
    } bit;
  } PTPSSIR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Ethernet PTP time stamp high register                      */
    
    struct {
      __IM  uint32_t STS        : 32;           /*!< [31..0] System time second                                                */
    } bit;
  } PTPTSHR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Ethernet PTP time stamp low register (ETH_PTPTSLR)         */
    
    struct {
      __IM  uint32_t STSS       : 31;           /*!< [30..0] System time subseconds                                            */
      __IM  uint32_t STPNS      : 1;            /*!< [31..31] System time positive or negative sign                            */
    } bit;
  } PTPTSLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Ethernet PTP time stamp high update register               */
    
    struct {
      __IOM uint32_t TSUS       : 32;           /*!< [31..0] Time stamp update second                                          */
    } bit;
  } PTPTSHUR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Ethernet PTP time stamp low update register (ETH_PTPTSLUR) */
    
    struct {
      __IOM uint32_t TSUSS      : 31;           /*!< [30..0] Time stamp update subseconds                                      */
      __IOM uint32_t TSUPNS     : 1;            /*!< [31..31] Time stamp update positive or negative sign                      */
    } bit;
  } PTPTSLUR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Ethernet PTP time stamp addend register                    */
    
    struct {
      __IOM uint32_t TSA        : 32;           /*!< [31..0] Time stamp addend                                                 */
    } bit;
  } PTPTSAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Ethernet PTP target time high register                     */
    
    struct {
      __IOM uint32_t TTSH       : 32;           /*!< [31..0] Target time stamp high                                            */
    } bit;
  } PTPTTHR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Ethernet PTP target time low register                      */
    
    struct {
      __IOM uint32_t TTSL       : 32;           /*!< [31..0] Target time stamp low                                             */
    } bit;
  } PTPTTLR;
} ETHERNET_PTP_Type;                            /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                       ETHERNET_DMA                                        ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40029000) ETHERNET_DMA Structure                                     */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Ethernet DMA bus mode register                             */
    
    struct {
      __IOM uint32_t SR         : 1;            /*!< [0..0] Software reset                                                     */
      __IOM uint32_t DA         : 1;            /*!< [1..1] DMA Arbitration                                                    */
      __IOM uint32_t DSL        : 5;            /*!< [6..2] Descriptor skip length                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t PBL        : 6;            /*!< [13..8] Programmable burst length                                         */
      __IOM uint32_t RTPR       : 2;            /*!< [15..14] Rx Tx priority ratio                                             */
      __IOM uint32_t FB         : 1;            /*!< [16..16] Fixed burst                                                      */
      __IOM uint32_t RDP        : 6;            /*!< [22..17] Rx DMA PBL                                                       */
      __IOM uint32_t USP        : 1;            /*!< [23..23] Use separate PBL                                                 */
      __IOM uint32_t FPM        : 1;            /*!< [24..24] 4xPBL mode                                                       */
      __IOM uint32_t AAB        : 1;            /*!< [25..25] Address-aligned beats                                            */
    } bit;
  } DMABMR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Ethernet DMA transmit poll demand register                 */
    
    struct {
      __IOM uint32_t TPD        : 32;           /*!< [31..0] Transmit poll demand                                              */
    } bit;
  } DMATPDR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) EHERNET DMA receive poll demand register                   */
    
