ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t RPD        : 32;           /*!< [31..0] Receive poll demand                                               */
    } bit;
  } DMARPDR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Ethernet DMA receive descriptor list address
                                                                    register                                                   */
    
    struct {
      __IOM uint32_t SRL        : 32;           /*!< [31..0] Start of receive list                                             */
    } bit;
  } DMARDLAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Ethernet DMA transmit descriptor list address
                                                                    register                                                   */
    
    struct {
      __IOM uint32_t STL        : 32;           /*!< [31..0] Start of transmit list                                            */
    } bit;
  } DMATDLAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Ethernet DMA status register                               */
    
    struct {
      __IOM uint32_t TS         : 1;            /*!< [0..0] Transmit status                                                    */
      __IOM uint32_t TPSS       : 1;            /*!< [1..1] Transmit process stopped status                                    */
      __IOM uint32_t TBUS       : 1;            /*!< [2..2] Transmit buffer unavailable status                                 */
      __IOM uint32_t TJTS       : 1;            /*!< [3..3] Transmit jabber timeout status                                     */
      __IOM uint32_t ROS        : 1;            /*!< [4..4] Receive overflow status                                            */
      __IOM uint32_t TUS        : 1;            /*!< [5..5] Transmit underflow status                                          */
      __IOM uint32_t RS         : 1;            /*!< [6..6] Receive status                                                     */
      __IOM uint32_t RBUS       : 1;            /*!< [7..7] Receive buffer unavailable status                                  */
      __IOM uint32_t RPSS       : 1;            /*!< [8..8] Receive process stopped status                                     */
      __IOM uint32_t PWTS       : 1;            /*!< [9..9] Receive watchdog timeout status                                    */
      __IOM uint32_t ETS        : 1;            /*!< [10..10] Early transmit status                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t FBES       : 1;            /*!< [13..13] Fatal bus error status                                           */
      __IOM uint32_t ERS        : 1;            /*!< [14..14] Early receive status                                             */
      __IOM uint32_t AIS        : 1;            /*!< [15..15] Abnormal interrupt summary                                       */
      __IOM uint32_t NIS        : 1;            /*!< [16..16] Normal interrupt summary                                         */
      __IM  uint32_t RPS        : 3;            /*!< [19..17] Receive process state                                            */
      __IM  uint32_t TPS        : 3;            /*!< [22..20] Transmit process state                                           */
      __IM  uint32_t EBS        : 3;            /*!< [25..23] Error bits status                                                */
      __IM  uint32_t            : 1;
      __IM  uint32_t MMCS       : 1;            /*!< [27..27] MMC status                                                       */
      __IM  uint32_t PMTS       : 1;            /*!< [28..28] PMT status                                                       */
      __IM  uint32_t TSTS       : 1;            /*!< [29..29] Time stamp trigger status                                        */
      __IM  uint32_t            : 1;
      __IM  uint32_t IPLS       : 1;            /*!< [31..31] 10MPHY Physical layer variation                                  */
    } bit;
  } DMASR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Ethernet DMA operation mode register                       */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t SR         : 1;            /*!< [1..1] SR                                                                 */
      __IOM uint32_t OSF        : 1;            /*!< [2..2] OSF                                                                */
      __IOM uint32_t RTC        : 2;            /*!< [4..3] RTC                                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t FUGF       : 1;            /*!< [6..6] FUGF                                                               */
      __IOM uint32_t FEF        : 1;            /*!< [7..7] FEF                                                                */
      __IM  uint32_t            : 5;
      __IOM uint32_t ST         : 1;            /*!< [13..13] ST                                                               */
      __IOM uint32_t TTC        : 3;            /*!< [16..14] TTC                                                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t FTF        : 1;            /*!< [20..20] FTF                                                              */
      __IOM uint32_t TSF        : 1;            /*!< [21..21] TSF                                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t DFRF       : 1;            /*!< [24..24] DFRF                                                             */
      __IOM uint32_t RSF        : 1;            /*!< [25..25] RSF                                                              */
      __IOM uint32_t DTCEFD     : 1;            /*!< [26..26] DTCEFD                                                           */
    } bit;
  } DMAOMR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Ethernet DMA interrupt enable register                     */
    
