ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t TIE        : 1;            /*!< [0..0] Transmit interrupt enable                                          */
      __IOM uint32_t TPSIE      : 1;            /*!< [1..1] Transmit process stopped interrupt enable                          */
      __IOM uint32_t TBUIE      : 1;            /*!< [2..2] Transmit buffer unavailable interrupt enable                       */
      __IOM uint32_t TJTIE      : 1;            /*!< [3..3] Transmit jabber timeout interrupt enable                           */
      __IOM uint32_t ROIE       : 1;            /*!< [4..4] Overflow interrupt enable                                          */
      __IOM uint32_t TUIE       : 1;            /*!< [5..5] Underflow interrupt enable                                         */
      __IOM uint32_t RIE        : 1;            /*!< [6..6] Receive interrupt enable                                           */
      __IOM uint32_t RBUIE      : 1;            /*!< [7..7] Receive buffer unavailable interrupt enable                        */
      __IOM uint32_t RPSIE      : 1;            /*!< [8..8] Receive process stopped interrupt enable                           */
      __IOM uint32_t RWTIE      : 1;            /*!< [9..9] receive watchdog timeout interrupt enable                          */
      __IOM uint32_t ETIE       : 1;            /*!< [10..10] Early transmit interrupt enable                                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t FBEIE      : 1;            /*!< [13..13] Fatal bus error interrupt enable                                 */
      __IOM uint32_t ERIE       : 1;            /*!< [14..14] Early receive interrupt enable                                   */
      __IOM uint32_t AISE       : 1;            /*!< [15..15] Abnormal interrupt summary enable                                */
      __IOM uint32_t NISE       : 1;            /*!< [16..16] Normal interrupt summary enable                                  */
      __IM  uint32_t            : 14;
      __IOM uint32_t IPLE       : 1;            /*!< [31..31] 10M Physical layer connection                                    */
    } bit;
  } DMAIER;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Ethernet DMA missed frame and buffer overflow
                                                                    counter register                                           */
    
    struct {
      __IM  uint32_t MFC        : 16;           /*!< [15..0] Missed frames by the controller                                   */
      __IM  uint32_t OMFC       : 1;            /*!< [16..16] Overflow bit for missed frame counter                            */
      __IM  uint32_t MFA        : 11;           /*!< [27..17] Missed frames by the application                                 */
      __IM  uint32_t OFOC       : 1;            /*!< [28..28] Overflow bit for FIFO overflow counter                           */
    } bit;
  } DMAMFBOCR;
  __IM  uint32_t  RESERVED[9];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) Ethernet DMA current host transmit descriptor
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t HTDAP      : 32;           /*!< [31..0] Host transmit descriptor address pointer                          */
    } bit;
  } DMACHTDR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) Ethernet DMA current host receive descriptor
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t HRDAP      : 32;           /*!< [31..0] Host receive descriptor address pointer                           */
    } bit;
  } DMACHRDR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000050) Ethernet DMA current host transmit buffer address
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t HTBAP      : 32;           /*!< [31..0] Host transmit buffer address pointer                              */
    } bit;
  } DMACHTBAR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000054) Ethernet DMA current host receive buffer address
                                                                    register                                                   */
    
    struct {
      __IM  uint32_t HRBAP      : 32;           /*!< [31..0] Host receive buffer address pointer                               */
    } bit;
  } DMACHRBAR;
} ETHERNET_DMA_Type;                            /*!< Size = 88 (0x58)                                                          */



/* =========================================================================================================================== */
/* ================                                           SDIO                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40018000) SDIO Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Bits 1:0 = PWRCTRL: Power supply control bits              */
    
    struct {
      __IOM uint32_t PWRCTRL    : 2;            /*!< [1..0] Power supply control bits                                          */
    } bit;
  } POWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) SDI clock control register (SDIO_CLKCR)                    */
    
    struct {
      __IOM uint32_t CLKDIV     : 8;            /*!< [7..0] Clock divide factor                                                */
      __IOM uint32_t CLKEN      : 1;            /*!< [8..8] Clock enable bit                                                   */
      __IOM uint32_t PWRSAV     : 1;            /*!< [9..9] Power saving configuration bit                                     */
      __IOM uint32_t BYPASS     : 1;            /*!< [10..10] Clock divider bypass enable bit                                  */
      __IOM uint32_t WIDBUS     : 2;            /*!< [12..11] Wide bus mode enable bit                                         */
      __IOM uint32_t NEGEDGE    : 1;            /*!< [13..13] SDIO_CK dephasing selection bit                                  */
      __IOM uint32_t HWFC_EN    : 1;            /*!< [14..14] HW Flow Control enable                                           */
    } bit;
  } CLKCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Bits 31:0 = : Command argument                             */
    
