ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CMDARG     : 32;           /*!< [31..0] Command argument                                                  */
    } bit;
  } ARG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) SDIO command register (SDIO_CMD)                           */
    
    struct {
      __IOM uint32_t CMDINDEX   : 6;            /*!< [5..0] Command index                                                      */
      __IOM uint32_t WAITRESP   : 2;            /*!< [7..6] Wait for response bits                                             */
      __IOM uint32_t WAITINT    : 1;            /*!< [8..8] CPSM waits for interrupt request                                   */
      __IOM uint32_t WAITPEND   : 1;            /*!< [9..9] CPSM Waits for ends of data transfer (CmdPend internal
                                                     signal)                                                                   */
      __IOM uint32_t CPSMEN     : 1;            /*!< [10..10] Command path state machine (CPSM) Enable bit                     */
      __IOM uint32_t SDIOSuspend : 1;           /*!< [11..11] SD I/O suspend command                                           */
      __IOM uint32_t ENCMDcompl : 1;            /*!< [12..12] Enable CMD completion                                            */
      __IOM uint32_t nIEN       : 1;            /*!< [13..13] not Interrupt Enable                                             */
      __IOM uint32_t CE_ATACMD  : 1;            /*!< [14..14] CE-ATA command                                                   */
    } bit;
  } CMD;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) SDIO command register                                      */
    
    struct {
      __IM  uint32_t RESPCMD    : 6;            /*!< [5..0] Response command index                                             */
    } bit;
  } RESPCMD;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) Bits 31:0 = CARDSTATUS1                                    */
    
    struct {
      __IM  uint32_t CARDSTATUS1 : 32;          /*!< [31..0] Card status 1                                                     */
    } bit;
  } RESP1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Bits 31:0 = CARDSTATUS2                                    */
    
    struct {
      __IM  uint32_t CARDSTATUS2 : 32;          /*!< [31..0] Card status 2                                                     */
    } bit;
  } RESP2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) Bits 31:0 = CARDSTATUS3                                    */
    
    struct {
      __IM  uint32_t CARDSTATUS3 : 32;          /*!< [31..0] Card status 3                                                     */
    } bit;
  } RESP3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Bits 31:0 = CARDSTATUS4                                    */
    
    struct {
      __IM  uint32_t CARDSTATUS4 : 32;          /*!< [31..0] Card status 4                                                     */
    } bit;
  } RESP4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Bits 31:0 = DATATIME: Data timeout period                  */
    
    struct {
      __IOM uint32_t DATATIME   : 32;           /*!< [31..0] Data timeout period                                               */
    } bit;
  } DTIMER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Bits 24:0 = DATALENGTH: Data length value                  */
    
    struct {
      __IOM uint32_t DATALENGTH : 25;           /*!< [24..0] Data length value                                                 */
    } bit;
  } DLEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) SDIO data control register (SDIO_DCTRL)                    */
    
    struct {
      __IOM uint32_t DTEN       : 1;            /*!< [0..0] Data transfer enabled bit                                          */
      __IOM uint32_t DTDIR      : 1;            /*!< [1..1] Data transfer direction selection                                  */
      __IOM uint32_t DTMODE     : 1;            /*!< [2..2] Data transfer mode selection 1: Stream or SDIO multibyte
                                                     data transfer                                                             */
      __IOM uint32_t DMAEN      : 1;            /*!< [3..3] DMA enable bit                                                     */
      __IOM uint32_t DBLOCKSIZE : 4;            /*!< [7..4] Data block size                                                    */
      __IOM uint32_t PWSTART    : 1;            /*!< [8..8] Read wait start                                                    */
      __IOM uint32_t PWSTOP     : 1;            /*!< [9..9] Read wait stop                                                     */
      __IOM uint32_t RWMOD      : 1;            /*!< [10..10] Read wait mode                                                   */
      __IOM uint32_t SDIOEN     : 1;            /*!< [11..11] SD I/O enable functions                                          */
    } bit;
  } DCTRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) Bits 24:0 = DATACOUNT: Data count value                    */
    
    struct {
      __IM  uint32_t DATACOUNT  : 25;           /*!< [24..0] Data count value                                                  */
    } bit;
  } DCOUNT;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000034) SDIO status register (SDIO_STA)                            */
    
    struct {
      __IM  uint32_t CCRCFAIL   : 1;            /*!< [0..0] Command response received (CRC check failed)                       */
      __IM  uint32_t DCRCFAIL   : 1;            /*!< [1..1] Data block sent/received (CRC check failed)                        */
      __IM  uint32_t CTIMEOUT   : 1;            /*!< [2..2] Command response timeout                                           */
      __IM  uint32_t DTIMEOUT   : 1;            /*!< [3..3] Data timeout                                                       */
      __IM  uint32_t TXUNDERR   : 1;            /*!< [4..4] Transmit FIFO underrun error                                       */
      __IM  uint32_t RXOVERR    : 1;            /*!< [5..5] Received FIFO overrun error                                        */
      __IM  uint32_t CMDREND    : 1;            /*!< [6..6] Command response received (CRC check passed)                       */
      __IM  uint32_t CMDSENT    : 1;            /*!< [7..7] Command sent (no response required)                                */
      __IM  uint32_t DATAEND    : 1;            /*!< [8..8] Data end (data counter, SDIDCOUNT, is zero)                        */
      __IM  uint32_t STBITERR   : 1;            /*!< [9..9] Start bit not detected on all data signals in wide bus
                                                     mode                                                                      */
      __IM  uint32_t DBCKEND    : 1;            /*!< [10..10] Data block sent/received (CRC check passed)                      */
      __IM  uint32_t CMDACT     : 1;            /*!< [11..11] Command transfer in progress                                     */
      __IM  uint32_t TXACT      : 1;            /*!< [12..12] Data transmit in progress                                        */
      __IM  uint32_t RXACT      : 1;            /*!< [13..13] Data receive in progress                                         */
      __IM  uint32_t TXFIFOHE   : 1;            /*!< [14..14] Transmit FIFO half empty: at least 8 words can be written
                                                     into the  FIFO                                                            */
      __IM  uint32_t RXFIFOHF   : 1;            /*!< [15..15] Receive FIFO half full: there are at least 8 words
                                                     in the  FIFO                                                              */
      __IM  uint32_t TXFIFOF    : 1;            /*!< [16..16] Transmit FIFO full                                               */
      __IM  uint32_t RXFIFOF    : 1;            /*!< [17..17] Receive FIFO full                                                */
      __IM  uint32_t TXFIFOE    : 1;            /*!< [18..18] Transmit FIFO empty                                              */
      __IM  uint32_t RXFIFOE    : 1;            /*!< [19..19] Receive FIFO empty                                               */
      __IM  uint32_t TXDAVL     : 1;            /*!< [20..20] Data available in transmit FIFO                                  */
      __IM  uint32_t RXDAVL     : 1;            /*!< [21..21] Data available in receive FIFO                                   */
      __IM  uint32_t SDIOIT     : 1;            /*!< [22..22] SDIO interrupt received                                          */
      __IM  uint32_t CEATAEND   : 1;            /*!< [23..23] CE-ATA command completion signal received for CMD61              */
    } bit;
  } STA;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) SDIO interrupt clear register (SDIO_ICR)                   */
    
