ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CCRCFAILC  : 1;            /*!< [0..0] CCRCFAIL flag clear bit                                            */
      __IOM uint32_t DCRCFAILC  : 1;            /*!< [1..1] DCRCFAIL flag clear bit                                            */
      __IOM uint32_t CTIMEOUTC  : 1;            /*!< [2..2] CTIMEOUT flag clear bit                                            */
      __IOM uint32_t DTIMEOUTC  : 1;            /*!< [3..3] DTIMEOUT flag clear bit                                            */
      __IOM uint32_t TXUNDERRC  : 1;            /*!< [4..4] TXUNDERR flag clear bit                                            */
      __IOM uint32_t RXOVERRC   : 1;            /*!< [5..5] RXOVERR flag clear bit                                             */
      __IOM uint32_t CMDRENDC   : 1;            /*!< [6..6] CMDREND flag clear bit                                             */
      __IOM uint32_t CMDSENTC   : 1;            /*!< [7..7] CMDSENT flag clear bit                                             */
      __IOM uint32_t DATAENDC   : 1;            /*!< [8..8] DATAEND flag clear bit                                             */
      __IOM uint32_t STBITERRC  : 1;            /*!< [9..9] STBITERR flag clear bit                                            */
      __IOM uint32_t DBCKENDC   : 1;            /*!< [10..10] DBCKEND flag clear bit                                           */
      __IM  uint32_t            : 11;
      __IOM uint32_t SDIOITC    : 1;            /*!< [22..22] SDIOIT flag clear bit                                            */
      __IOM uint32_t CEATAENDC  : 1;            /*!< [23..23] CEATAEND flag clear bit                                          */
    } bit;
  } ICR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) SDIO mask register (SDIO_MASK)                             */
    
    struct {
      __IOM uint32_t CCRCFAILIE : 1;            /*!< [0..0] Command CRC fail interrupt  enable                                 */
      __IOM uint32_t DCRCFAILIE : 1;            /*!< [1..1] Data CRC fail interrupt  enable                                    */
      __IOM uint32_t CTIMEOUTIE : 1;            /*!< [2..2] Command timeout interrupt  enable                                  */
      __IOM uint32_t DTIMEOUTIE : 1;            /*!< [3..3] Data timeout interrupt  enable                                     */
      __IOM uint32_t TXUNDERRIE : 1;            /*!< [4..4] Tx FIFO underrun error interrupt  enable                           */
      __IOM uint32_t RXOVERRIE  : 1;            /*!< [5..5] Rx FIFO overrun error interrupt  enable                            */
      __IOM uint32_t CMDRENDIE  : 1;            /*!< [6..6] Command response received interrupt  enable                        */
      __IOM uint32_t CMDSENTIE  : 1;            /*!< [7..7] Command sent interrupt  enable                                     */
      __IOM uint32_t DATAENDIE  : 1;            /*!< [8..8] Data end interrupt  enable                                         */
      __IOM uint32_t STBITERRIE : 1;            /*!< [9..9] Start bit error interrupt  enable                                  */
      __IOM uint32_t DBACKENDIE : 1;            /*!< [10..10] Data block end interrupt  enable                                 */
      __IOM uint32_t CMDACTIE   : 1;            /*!< [11..11] Command acting interrupt  enable                                 */
      __IOM uint32_t TXACTIE    : 1;            /*!< [12..12] Data transmit acting interrupt  enable                           */
      __IOM uint32_t RXACTIE    : 1;            /*!< [13..13] Data receive acting interrupt  enable                            */
      __IOM uint32_t TXFIFOHEIE : 1;            /*!< [14..14] Tx FIFO half empty interrupt  enable                             */
      __IOM uint32_t RXFIFOHFIE : 1;            /*!< [15..15] Rx FIFO half full interrupt  enable                              */
      __IOM uint32_t TXFIFOFIE  : 1;            /*!< [16..16] Tx FIFO full interrupt  enable                                   */
      __IOM uint32_t RXFIFOFIE  : 1;            /*!< [17..17] Rx FIFO full interrupt  enable                                   */
      __IOM uint32_t TXFIFOEIE  : 1;            /*!< [18..18] Tx FIFO empty interrupt  enable                                  */
      __IOM uint32_t RXFIFOEIE  : 1;            /*!< [19..19] Rx FIFO empty interrupt  enable                                  */
      __IOM uint32_t TXDAVLIE   : 1;            /*!< [20..20] Data available in Tx FIFO interrupt  enable                      */
      __IOM uint32_t RXDAVLIE   : 1;            /*!< [21..21] Data available in Rx FIFO interrupt  enable                      */
      __IOM uint32_t SDIOITIE   : 1;            /*!< [22..22] SDIO mode interrupt received interrupt  enable                   */
      __IOM uint32_t CEATENDIE  : 1;            /*!< [23..23] CE-ATA command completion signal received interrupt
                                                     enable                                                                    */
    } bit;
  } MASK;
  __IM  uint32_t  RESERVED[2];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) Bits 23:0 = FIFOCOUNT: Remaining number of words
                                                                    to be written to or read from the FIFO                     */
    
    struct {
      __IM  uint32_t FIF0COUNT  : 32;           /*!< [31..0] Remaining number of words to be written to or read from
                                                     the  FIFO                                                                 */
    } bit;
  } FIFOCNT;
  __IM  uint32_t  RESERVED1[13];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) bits 31:0 = FIFOData: Receive and transmit FIFO
                                                                    data                                                       */
    
