ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t FIFOData   : 32;           /*!< [31..0] Receive and transmit FIFO data                                    */
    } bit;
  } FIFO;
} SDIO_Type;                                    /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                           FSMC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0xA0000000) FSMC Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) SRAM/NOR-Flash chip-select control register 1              */
    
    struct {
      __IOM uint32_t MBKEN      : 1;            /*!< [0..0] Memory bank enable bit                                             */
      __IOM uint32_t MUXEN      : 1;            /*!< [1..1] Address/data multiplexing enable bit                               */
      __IOM uint32_t MTYP       : 2;            /*!< [3..2] Memory type                                                        */
      __IOM uint32_t MWID       : 2;            /*!< [5..4] Memory databus width                                               */
      __IOM uint32_t FACCEN     : 1;            /*!< [6..6] Flash access enable                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t BURSTEN    : 1;            /*!< [8..8] Burst enable bit                                                   */
      __IOM uint32_t WAITPOL    : 1;            /*!< [9..9] Wait signal polarity bit                                           */
      __IOM uint32_t WRAPMOD    : 1;            /*!< [10..10] Wrapped burst mode support                                       */
      __IOM uint32_t WAITCFG    : 1;            /*!< [11..11] Wait timing configuration                                        */
      __IOM uint32_t WREN       : 1;            /*!< [12..12] Write enable bit                                                 */
      __IOM uint32_t WAITEN     : 1;            /*!< [13..13] Wait enable bit                                                  */
      __IOM uint32_t EXTMOD     : 1;            /*!< [14..14] Extended mode enable                                             */
      __IOM uint32_t ASYNCWAIT  : 1;            /*!< [15..15] Wait signal during asynchronous transfers                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t CBURSTRW   : 1;            /*!< [19..19] Write burst enable                                               */
    } bit;
  } BCR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) SRAM/NOR-Flash chip-select timing register 1               */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< [3..0] Address setup phase duration                                       */
      __IOM uint32_t ADDHLD     : 4;            /*!< [7..4] Address-hold phase duration                                        */
      __IOM uint32_t DATAST     : 8;            /*!< [15..8] Data-phase duration                                               */
      __IOM uint32_t BUSTURN    : 4;            /*!< [19..16] Bus turnaround phase duration                                    */
      __IOM uint32_t CLKDIV     : 4;            /*!< [23..20] Clock divide ratio (for FSMC_CLK signal)                         */
      __IOM uint32_t DATLAT     : 4;            /*!< [27..24] Data latency for synchronous NOR Flash memory                    */
      __IOM uint32_t ACCMOD     : 2;            /*!< [29..28] Access mode                                                      */
    } bit;
  } BTR1;
  __IM  uint32_t  RESERVED[22];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) PC Card/NAND Flash control register 2                      */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t PWAITEN    : 1;            /*!< [1..1] Wait feature enable bit                                            */
      __IOM uint32_t PBKEN      : 1;            /*!< [2..2] PC Card/NAND Flash memory bank enable bit                          */
      __IOM uint32_t PTYP       : 1;            /*!< [3..3] Memory type                                                        */
      __IOM uint32_t PWID       : 2;            /*!< [5..4] Databus width                                                      */
      __IOM uint32_t ECCEN      : 1;            /*!< [6..6] ECC computation logic enable bit                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t TCLR       : 4;            /*!< [12..9] CLE to RE delay                                                   */
      __IOM uint32_t TAR        : 4;            /*!< [16..13] ALE to RE delay                                                  */
      __IOM uint32_t ECCPS      : 3;            /*!< [19..17] ECC page size                                                    */
    } bit;
  } PCR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) FIFO status and interrupt register 2                       */
    
    struct {
      __IOM uint32_t IRS        : 1;            /*!< [0..0] Interrupt rising edge status                                       */
      __IOM uint32_t ILS        : 1;            /*!< [1..1] Interrupt high-level status                                        */
      __IOM uint32_t IFS        : 1;            /*!< [2..2] Interrupt falling edge status                                      */
      __IOM uint32_t IREN       : 1;            /*!< [3..3] Interrupt rising edge detection enable bit                         */
      __IOM uint32_t ILEN       : 1;            /*!< [4..4] Interrupt high-level detection enable bit                          */
      __IOM uint32_t IFEN       : 1;            /*!< [5..5] Interrupt falling edge detection enable bit                        */
      __IM  uint32_t FEMPT      : 1;            /*!< [6..6] FIFO empty                                                         */
    } bit;
  } SR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Common memory space timing register 2                      */
    
