ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t MEMSETx    : 8;            /*!< [7..0] Common memory x setup  time                                        */
      __IOM uint32_t MEMWAITx   : 8;            /*!< [15..8] Common memory x wait  time                                        */
      __IOM uint32_t MEMHOLDx   : 8;            /*!< [23..16] Common memory x hold  time                                       */
      __IOM uint32_t MEMHIZx    : 8;            /*!< [31..24] Common memory x databus HiZ  time                                */
    } bit;
  } PMEM2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Attribute memory space timing register 2                   */
    
    struct {
      __IOM uint32_t ATTSETx    : 8;            /*!< [7..0] Attribute memory x setup time                                      */
      __IOM uint32_t ATTWAITx   : 8;            /*!< [15..8] Attribute memory x wait time                                      */
      __IOM uint32_t ATTHOLDx   : 8;            /*!< [23..16] Attribute memory x hold time                                     */
      __IOM uint32_t ATTHIZx    : 8;            /*!< [31..24] Attribute memory x databus HiZ time                              */
    } bit;
  } PATT2;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000074) ECC result register 2                                      */
    
    struct {
      __IM  uint32_t ECCx       : 32;           /*!< [31..0] ECC result                                                        */
    } bit;
  } ECCR2;
  __IM  uint32_t  RESERVED2[35];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) SRAM/NOR-Flash write timing registers 1                    */
    
    struct {
      __IOM uint32_t ADDSET     : 4;            /*!< [3..0] Address setup phase duration                                       */
      __IOM uint32_t ADDHLD     : 4;            /*!< [7..4] Address-hold phase duration                                        */
      __IOM uint32_t DATAST     : 8;            /*!< [15..8] Data-phase duration                                               */
      __IM  uint32_t            : 4;
      __IOM uint32_t CLKDIV     : 4;            /*!< [23..20] Clock divide ratio (for FSMC_CLK signal)                         */
      __IOM uint32_t DATLAT     : 4;            /*!< [27..24] Data latency for synchronous NOR Flash memory                    */
      __IOM uint32_t ACCMOD     : 2;            /*!< [29..28] Access mode                                                      */
    } bit;
  } BWTR1;
} FSMC_Type;                                    /*!< Size = 264 (0x108)                                                        */



/* =========================================================================================================================== */
/* ================                                            DVP                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x50050000) DVP Structure                                              */
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000000) Digital Video control register (DVP_CR0)                   */
    
    struct {
      __IOM uint8_t RB_DVP_ENABLE : 1;          /*!< [0..0] DVP enable                                                         */
      __IOM uint8_t RB_DVP_V_POLAR : 1;         /*!< [1..1] DVP VSYNC polarity control                                         */
      __IOM uint8_t RB_DVP_H_POLAR : 1;         /*!< [2..2] DVP HSYNC polarity control                                         */
      __IOM uint8_t RB_DVP_P_POLAR : 1;         /*!< [3..3] DVP PCLK polarity control                                          */
      __IOM uint8_t RB_DVP_MSK_DAT_MOD : 2;     /*!< [5..4] DVP data mode                                                      */
      __IOM uint8_t RB_DVP_JPEG : 1;            /*!< [6..6] DVP JPEG mode                                                      */
    } bit;
  } CR0;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000001) Digital Video control register (DVP_CR1)                   */
    
    struct {
      __IOM uint8_t RB_DVP_DMA_EN : 1;          /*!< [0..0] DVP dma enable                                                     */
      __IOM uint8_t RB_DVP_ALL_CLR : 1;         /*!< [1..1] DVP all clear                                                      */
      __IOM uint8_t RB_DVP_RCV_CLR : 1;         /*!< [2..2] DVP receive logic clear                                            */
      __IOM uint8_t RB_DVP_BUF_TOG : 1;         /*!< [3..3] DVP bug toggle by software                                         */
      __IOM uint8_t RB_DVP_CM   : 1;            /*!< [4..4] DVP capture mode                                                   */
      __IOM uint8_t RB_DVP_CROP : 1;            /*!< [5..5] DVP Crop feature enable                                            */
      __IOM uint8_t RB_DVP_FCRC : 2;            /*!< [7..6] DVP frame capture rate control                                     */
    } bit;
  } CR1;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000002) Digital Video Interrupt register (DVP_IER)                 */
    
    struct {
      __IOM uint8_t RB_DVP_IE_STR_FRM : 1;      /*!< [0..0] DVP frame start interrupt enable                                   */
      __IOM uint8_t RB_DVP_IE_ROW_DONE : 1;     /*!< [1..1] DVP row received done interrupt enable                             */
      __IOM uint8_t RB_DVP_IE_FRM_DONE : 1;     /*!< [2..2] DVP frame received done interrupt enable                           */
      __IOM uint8_t RB_DVP_IE_FIFO_OV : 1;      /*!< [3..3] DVP receive fifo overflow interrupt enable                         */
      __IOM uint8_t RB_DVP_IE_STP_FRM : 1;      /*!< [4..4] DVP frame stop interrupt enable                                    */
    } bit;
  } IER;
  __IM  uint8_t   RESERVED;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000004) Image line count configuration register (DVP_ROW_NUM)      */
    
