ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint16_t RB_DVP_ROW_NUM : 16;       /*!< [15..0] The number of rows of frame image data                            */
    } bit;
  } ROW_NUM;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000006) Image column number configuration register (DVP_COL_NUM)   */
    
    struct {
      __IOM uint16_t RB_DVP_COL_NUM : 16;       /*!< [15..0] Number of PCLK cycles for row data                                */
    } bit;
  } COL_NUM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Digital Video DMA address register (DVP_DMA_BUF0)          */
    
    struct {
      __IOM uint32_t RB_DVP_DMA_BUF0 : 17;      /*!< [16..0] DMA receive address 0                                             */
    } bit;
  } DMA_BUF0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Digital Video DMA address register (DVP_DMA_BUF1)          */
    
    struct {
      __IOM uint32_t RB_DVP_DMA_BUF1 : 17;      /*!< [16..0] DMA receive address 1                                             */
    } bit;
  } DMA_BUF1;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000010) Digital Video Flag register (DVP_IFR)                      */
    
    struct {
      __IOM uint8_t RB_DVP_IF_STR_FRM : 1;      /*!< [0..0] DVP frame start interrupt enable                                   */
      __IOM uint8_t RB_DVP_IF_ROW_DONE : 1;     /*!< [1..1] DVP row received done interrupt enable                             */
      __IOM uint8_t RB_DVP_IF_FRM_DONE : 1;     /*!< [2..2] DVP frame received done interrupt enable                           */
      __IOM uint8_t RB_DVP_IF_FIFO_OV : 1;      /*!< [3..3] DVP receive fifo overflow interrupt enable                         */
      __IOM uint8_t RB_DVP_IF_STP_FRM : 1;      /*!< [4..4] DVP frame stop interrupt enable                                    */
    } bit;
  } IFR;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x00000011) Digital Video STATUS register (DVP_STATUS)                 */
    
    struct {
      __IM  uint8_t RB_DVP_FIFO_RDY : 1;        /*!< [0..0] DVP frame start interrupt enable                                   */
      __IM  uint8_t RB_DVP_FIFO_FULL : 1;       /*!< [1..1] DVP row received done interrupt enable                             */
      __IM  uint8_t RB_DVP_FIFO_OV : 1;         /*!< [2..2] DVP frame received done interrupt enable                           */
      __IM  uint8_t             : 1;
      __IM  uint8_t RB_DVP_MSK_FIFO_CNT : 3;    /*!< [6..4] DVP receive fifo overflow interrupt enable                         */
    } bit;
  } STATUS;
  __IM  uint16_t  RESERVED1;
  
  union {
    __IM  uint16_t reg;                         /*!< (@ 0x00000014) Digital Video line counter register (DVP_ROW_CNT)          */
    
    struct {
      __IM  uint16_t RB_DVP_ROW_CNT : 16;       /*!< [15..0] The number of rows of frame image data                            */
    } bit;
  } ROW_CNT;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000018) Digital Video horizontal displacement register
                                                                    (DVP_HOFFCNT)                                              */
    
    struct {
      __IOM uint16_t RB_DVP_HOFFCNT : 16;       /*!< [15..0] Number of PCLK cycles for row data                                */
    } bit;
  } HOFFCNT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001A) Digital Video line number register (DVP_VST)               */
    
    struct {
      __IOM uint16_t RB_DVP_VST : 16;           /*!< [15..0] The number of lines captured by the image                         */
    } bit;
  } VST;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001C) Digital Video Capture count register (DVP_CAPCNT)          */
    
    struct {
      __IOM uint16_t RB_DVP_CAPCNT : 16;        /*!< [15..0] Number of PCLK cycles captured by clipping window                 */
    } bit;
  } CAPCNT;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001E) Digital Video Vertical line count register (DVP_VLINE)     */
    
    struct {
      __IOM uint16_t RB_DVP_VLINE : 16;         /*!< [15..0] Crop the number of rows captured by window                        */
    } bit;
  } VLINE;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Digital Video Data register (DVP_DR)                       */
    
    struct {
      __IM  uint32_t RB_DVP_DR  : 32;           /*!< [31..0] Prevent DMA overflow                                              */
    } bit;
  } DR;
} DVP_Type;                                     /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                            DAC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40007400) DAC Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register (DAC_CR)                                  */
    
    struct {
      __IOM uint32_t EN1        : 1;            /*!< [0..0] DAC channel1 enable                                                */
      __IOM uint32_t BOFF1      : 1;            /*!< [1..1] DAC channel1 output buffer disable                                 */
      __IOM uint32_t TEN1       : 1;            /*!< [2..2] DAC channel1 trigger enable                                        */
      __IOM uint32_t TSEL1      : 3;            /*!< [5..3] DAC channel1 trigger selection                                     */
      __IOM uint32_t WAVE1      : 2;            /*!< [7..6] DAC channel1 noise/triangle wave generation enable                 */
      __IOM uint32_t MAMP1      : 4;            /*!< [11..8] DAC channel1 mask/amplitude selector                              */
      __IOM uint32_t DMAEN1     : 1;            /*!< [12..12] DAC channel1 DMA enable                                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t EN2        : 1;            /*!< [16..16] DAC channel2 enable                                              */
      __IOM uint32_t BOFF2      : 1;            /*!< [17..17] DAC channel2 output buffer disable                               */
      __IOM uint32_t TEN2       : 1;            /*!< [18..18] DAC channel2 trigger enable                                      */
      __IOM uint32_t TSEL2      : 3;            /*!< [21..19] DAC channel2 trigger selection                                   */
      __IOM uint32_t WAVE2      : 2;            /*!< [23..22] DAC channel2 noise/triangle wave generation enable               */
      __IOM uint32_t MAMP2      : 4;            /*!< [27..24] DAC channel2 mask/amplitude selector                             */
      __IOM uint32_t DMAEN2     : 1;            /*!< [28..28] DAC channel2 DMA enable                                          */
    } bit;
  } CTLR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) DAC software trigger register (DAC_SWTRIGR)                */
    
