ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __OM  uint32_t SWTRIG1    : 1;            /*!< [0..0] DAC channel1 software trigger                                      */
      __OM  uint32_t SWTRIG2    : 1;            /*!< [1..1] DAC channel2 software trigger                                      */
    } bit;
  } SWTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) DAC channel1 12-bit right-aligned data holding
                                                                    register(DAC_DHR12R1)                                      */
    
    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< [11..0] DAC channel1 12-bit right-aligned data                            */
    } bit;
  } R12BDHR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DAC channel1 12-bit left aligned data holding
                                                                    register (DAC_DHR12L1)                                     */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< [15..4] DAC channel1 12-bit left-aligned data                             */
    } bit;
  } L12BDHR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) DAC channel1 8-bit right aligned data holding
                                                                    register (DAC_DHR8R1)                                      */
    
    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< [7..0] DAC channel1 8-bit right-aligned data                              */
    } bit;
  } R8BDHR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) DAC channel2 12-bit right aligned data holding
                                                                    register (DAC_DHR12R2)                                     */
    
    struct {
      __IOM uint32_t DACC2DHR   : 12;           /*!< [11..0] DAC channel2 12-bit right-aligned data                            */
    } bit;
  } R12BDHR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) DAC channel2 12-bit left aligned data holding
                                                                    register (DAC_DHR12L2)                                     */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< [15..4] DAC channel2 12-bit left-aligned data                             */
    } bit;
  } L12BDHR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) DAC channel2 8-bit right-aligned data holding
                                                                    register (DAC_DHR8R2)                                      */
    
    struct {
      __IOM uint32_t DACC2DHR   : 8;            /*!< [7..0] DAC channel2 8-bit right-aligned data                              */
    } bit;
  } R8BDHR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Dual DAC 12-bit right-aligned data holding register
                                                                    (DAC_DHR12RD), Bits 31:28 Reserved, Bits
                                                                    15:12 Reserved                                             */
    
    struct {
      __IOM uint32_t DACC1DHR   : 12;           /*!< [11..0] DAC channel1 12-bit right-aligned data                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< [27..16] DAC channel2 12-bit right-aligned data                           */
    } bit;
  } RD12BDHR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) DUAL DAC 12-bit left aligned data holding register
                                                                    (DAC_DHR12LD), Bits 19:16 Reserved, Bits
                                                                    3:0 Reserved                                               */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC1DHR   : 12;           /*!< [15..4] DAC channel1 12-bit left-aligned data                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t DACC2DHR   : 12;           /*!< [31..20] DAC channel2 12-bit right-aligned data                           */
    } bit;
  } LD12BDHR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) DUAL DAC 8-bit right aligned data holding register
                                                                    (DAC_DHR8RD), Bits 31:16 Reserved                          */
    
    struct {
      __IOM uint32_t DACC1DHR   : 8;            /*!< [7..0] DAC channel1 8-bit right-aligned data                              */
      __IOM uint32_t DACC2DHR   : 8;            /*!< [15..8] DAC channel2 8-bit right-aligned data                             */
    } bit;
  } RD8BDHR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) DAC channel1 data output register (DAC_DOR1)               */
    
    struct {
      __IM  uint32_t DACC1DOR   : 12;           /*!< [11..0] DAC channel1 data output                                          */
    } bit;
  } DOR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000030) DAC channel2 data output register (DAC_DOR2)               */
    
    struct {
      __IM  uint32_t DACC2DOR   : 12;           /*!< [11..0] DAC channel2 data output                                          */
    } bit;
  } DOR2;
} DAC_Type;                                     /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40007000) PWR Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Power control register (PWR_CTRL)                          */
    
