ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t LPDS       : 1;            /*!< [0..0] Low Power Deep Sleep                                               */
      __IOM uint32_t PDDS       : 1;            /*!< [1..1] Power Down Deep Sleep                                              */
      __IOM uint32_t CWUF       : 1;            /*!< [2..2] Clear Wake-up Flag                                                 */
      __IOM uint32_t CSBF       : 1;            /*!< [3..3] Clear STANDBY Flag                                                 */
      __IOM uint32_t PVDE       : 1;            /*!< [4..4] Power Voltage Detector Enable                                      */
      __IOM uint32_t PLS        : 3;            /*!< [7..5] PVD Level Selection                                                */
      __IOM uint32_t DBP        : 1;            /*!< [8..8] Disable Backup Domain write protection                             */
      __IM  uint32_t            : 7;
      __IOM uint32_t R2K_STYEN  : 1;            /*!< [16..16] standby 2k ram enable                                            */
      __IOM uint32_t R30K_STYEN : 1;            /*!< [17..17] standby 30k ram enable                                           */
      __IOM uint32_t R2K_VBATEN : 1;            /*!< [18..18] VBAT 30k ram enable                                              */
      __IOM uint32_t R30K_VBATEN : 1;           /*!< [19..19] VBAT 30k ram enable                                              */
      __IOM uint32_t RAM_LVEN   : 1;            /*!< [20..20] Ram LV Enable                                                    */
    } bit;
  } CTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Power control register (PWR_CSR)                           */
    
    struct {
      __IM  uint32_t WUF        : 1;            /*!< [0..0] Wake-Up Flag                                                       */
      __IM  uint32_t SBF        : 1;            /*!< [1..1] STANDBY Flag                                                       */
      __IM  uint32_t PVDO       : 1;            /*!< [2..2] PVD Output                                                         */
      __IM  uint32_t            : 5;
      __IOM uint32_t EWUP       : 1;            /*!< [8..8] Enable WKUP pin                                                    */
    } bit;
  } CSR;
} PWR_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Clock control register                                     */
    
    struct {
      __IOM uint32_t HSION      : 1;            /*!< [0..0] Internal High Speed clock enable                                   */
      __IM  uint32_t HSIRDY     : 1;            /*!< [1..1] Internal High Speed clock ready flag                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t HSITRIM    : 5;            /*!< [7..3] Internal High Speed clock trimming                                 */
      __IM  uint32_t HSICAL     : 8;            /*!< [15..8] Internal High Speed clock Calibration                             */
      __IOM uint32_t HSEON      : 1;            /*!< [16..16] External High Speed clock enable                                 */
      __IM  uint32_t HSERDY     : 1;            /*!< [17..17] External High Speed clock ready flag                             */
      __IOM uint32_t HSEBYP     : 1;            /*!< [18..18] External High Speed clock Bypass                                 */
      __IOM uint32_t CSSON      : 1;            /*!< [19..19] Clock Security System enable                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t PLLON      : 1;            /*!< [24..24] PLL enable                                                       */
      __IM  uint32_t PLLRDY     : 1;            /*!< [25..25] PLL clock ready flag                                             */
      __IOM uint32_t PLL2ON     : 1;            /*!< [26..26] PLL2 enable                                                      */
      __IM  uint32_t PLL2RDY    : 1;            /*!< [27..27] PLL2 clock ready flag                                            */
      __IOM uint32_t PLL3ON     : 1;            /*!< [28..28] PLL3 enable                                                      */
      __IM  uint32_t PLL3RDY    : 1;            /*!< [29..29] PLL3 clock ready flag                                            */
    } bit;
  } CTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Clock configuration register (RCC_CFGR0)                   */
    
    struct {
      __IOM uint32_t SW         : 2;            /*!< [1..0] System clock Switch                                                */
      __IM  uint32_t SWS        : 2;            /*!< [3..2] System Clock Switch Status                                         */
      __IOM uint32_t HPRE       : 4;            /*!< [7..4] AHB prescaler                                                      */
      __IOM uint32_t PPRE1      : 3;            /*!< [10..8] APB Low speed prescaler (APB1)                                    */
      __IOM uint32_t PPRE2      : 3;            /*!< [13..11] APB High speed prescaler (APB2)                                  */
      __IOM uint32_t ADCPRE     : 2;            /*!< [15..14] ADC prescaler                                                    */
      __IOM uint32_t PLLSRC     : 1;            /*!< [16..16] PLL entry clock source                                           */
      __IOM uint32_t PLLXTPRE   : 1;            /*!< [17..17] HSE divider for PLL entry                                        */
      __IOM uint32_t PLLMUL     : 4;            /*!< [21..18] PLL Multiplication Factor                                        */
      __IOM uint32_t USBPRE     : 2;            /*!< [23..22] USB prescaler                                                    */
      __IOM uint32_t MCO        : 4;            /*!< [27..24] Microcontroller clock output                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t ADC_CLK_ADJ : 1;           /*!< [31..31] ADC clock ADJ                                                    */
    } bit;
  } CFGR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Clock interrupt register (RCC_INTR)                        */
    
