ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t LSIRDYF    : 1;            /*!< [0..0] LSI Ready Interrupt flag                                           */
      __IM  uint32_t LSERDYF    : 1;            /*!< [1..1] LSE Ready Interrupt flag                                           */
      __IM  uint32_t HSIRDYF    : 1;            /*!< [2..2] HSI Ready Interrupt flag                                           */
      __IM  uint32_t HSERDYF    : 1;            /*!< [3..3] HSE Ready Interrupt flag                                           */
      __IM  uint32_t PLLRDYF    : 1;            /*!< [4..4] PLL Ready Interrupt flag                                           */
      __IM  uint32_t PLL2RDYF   : 1;            /*!< [5..5] PLL2 Ready Interrupt flag                                          */
      __IM  uint32_t PLL3RDYF   : 1;            /*!< [6..6] PLL3 Ready Interrupt flag                                          */
      __IM  uint32_t CSSF       : 1;            /*!< [7..7] Clock Security System Interrupt flag                               */
      __IOM uint32_t LSIRDYIE   : 1;            /*!< [8..8] LSI Ready Interrupt Enable                                         */
      __IOM uint32_t LSERDYIE   : 1;            /*!< [9..9] LSE Ready Interrupt Enable                                         */
      __IOM uint32_t HSIRDYIE   : 1;            /*!< [10..10] HSI Ready Interrupt Enable                                       */
      __IOM uint32_t HSERDYIE   : 1;            /*!< [11..11] HSE Ready Interrupt Enable                                       */
      __IOM uint32_t PLLRDYIE   : 1;            /*!< [12..12] PLL Ready Interrupt Enable                                       */
      __IOM uint32_t PLL2RDYIE  : 1;            /*!< [13..13] PLL2 Ready Interrupt Enable                                      */
      __IOM uint32_t PLL3RDYIE  : 1;            /*!< [14..14] PLL3 Ready Interrupt Enable                                      */
      __IM  uint32_t            : 1;
      __OM  uint32_t LSIRDYC    : 1;            /*!< [16..16] LSI Ready Interrupt Clear                                        */
      __OM  uint32_t LSERDYC    : 1;            /*!< [17..17] LSE Ready Interrupt Clear                                        */
      __OM  uint32_t HSIRDYC    : 1;            /*!< [18..18] HSI Ready Interrupt Clear                                        */
      __OM  uint32_t HSERDYC    : 1;            /*!< [19..19] HSE Ready Interrupt Clear                                        */
      __OM  uint32_t PLLRDYC    : 1;            /*!< [20..20] PLL Ready Interrupt Clear                                        */
      __OM  uint32_t PLL2RDYC   : 1;            /*!< [21..21] PLL2 Ready Interrupt Clear                                       */
      __OM  uint32_t PLL3RDYC   : 1;            /*!< [22..22] PLL3 Ready Interrupt Clear                                       */
      __OM  uint32_t CSSC       : 1;            /*!< [23..23] Clock security system interrupt clear                            */
    } bit;
  } INTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) APB2 peripheral reset register (RCC_APB2PRSTR)             */
    
    struct {
      __IOM uint32_t AFIORST    : 1;            /*!< [0..0] Alternate function I/O reset                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t IOPARST    : 1;            /*!< [2..2] IO port A reset                                                    */
      __IOM uint32_t IOPBRST    : 1;            /*!< [3..3] IO port B reset                                                    */
      __IOM uint32_t IOPCRST    : 1;            /*!< [4..4] IO port C reset                                                    */
      __IOM uint32_t IOPDRST    : 1;            /*!< [5..5] IO port D reset                                                    */
      __IOM uint32_t IOPERST    : 1;            /*!< [6..6] IO port E reset                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC1RST    : 1;            /*!< [9..9] ADC 1 interface reset                                              */
      __IOM uint32_t ADC2RST    : 1;            /*!< [10..10] ADC 2 interface reset                                            */
      __IOM uint32_t TIM1RST    : 1;            /*!< [11..11] TIM1 timer reset                                                 */
      __IOM uint32_t SPI1RST    : 1;            /*!< [12..12] SPI 1 reset                                                      */
      __IOM uint32_t TIM8RST    : 1;            /*!< [13..13] TIM8 timer reset                                                 */
      __IOM uint32_t USART1RST  : 1;            /*!< [14..14] USART1 reset                                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t TIM9RST    : 1;            /*!< [19..19] TIM9 timer reset                                                 */
      __IOM uint32_t TIM10RST   : 1;            /*!< [20..20] TIM10 timer reset                                                */
    } bit;
  } APB2PRSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) APB1 peripheral reset register (RCC_APB1PRSTR)             */
    
    struct {
      __IOM uint32_t TIM2RST    : 1;            /*!< [0..0] Timer 2 reset                                                      */
      __IOM uint32_t TIM3RST    : 1;            /*!< [1..1] Timer 3 reset                                                      */
      __IOM uint32_t TIM4RST    : 1;            /*!< [2..2] Timer 4 reset                                                      */
      __IOM uint32_t TIM5RST    : 1;            /*!< [3..3] Timer 5 reset                                                      */
      __IOM uint32_t TIM6RST    : 1;            /*!< [4..4] Timer 6 reset                                                      */
      __IOM uint32_t TIM7RST    : 1;            /*!< [5..5] Timer 7 reset                                                      */
      __IOM uint32_t UART6RST   : 1;            /*!< [6..6] UART 6 reset                                                       */
      __IOM uint32_t UART7RST   : 1;            /*!< [7..7] UART 7 reset                                                       */
      __IOM uint32_t UART8RST   : 1;            /*!< [8..8] UART 8 reset                                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGRST    : 1;            /*!< [11..11] Window watchdog reset                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2RST    : 1;            /*!< [14..14] SPI2 reset                                                       */
      __IOM uint32_t SPI3RST    : 1;            /*!< [15..15] SPI3 reset                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART2RST  : 1;            /*!< [17..17] USART 2 reset                                                    */
      __IOM uint32_t USART3RST  : 1;            /*!< [18..18] USART 3 reset                                                    */
      __IOM uint32_t USART4RST  : 1;            /*!< [19..19] USART 4 reset                                                    */
      __IOM uint32_t USART5RST  : 1;            /*!< [20..20] USART 5 reset                                                    */
      __IOM uint32_t I2C1RST    : 1;            /*!< [21..21] I2C1 reset                                                       */
      __IOM uint32_t I2C2RST    : 1;            /*!< [22..22] I2C2 reset                                                       */
      __IOM uint32_t USBDRST    : 1;            /*!< [23..23] USBD reset                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t CAN1RST    : 1;            /*!< [25..25] CAN1 reset                                                       */
      __IOM uint32_t CAN2RST    : 1;            /*!< [26..26] CAN2 reset                                                       */
      __IOM uint32_t BKPRST     : 1;            /*!< [27..27] Backup interface reset                                           */
      __IOM uint32_t PWRRST     : 1;            /*!< [28..28] Power interface reset                                            */
      __IOM uint32_t DACRST     : 1;            /*!< [29..29] DAC interface reset                                              */
    } bit;
  } APB1PRSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) AHB Peripheral Clock enable register (RCC_AHBPCENR)        */
    
