ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DMA1EN     : 1;            /*!< [0..0] DMA clock enable                                                   */
      __IOM uint32_t DMA2EN     : 1;            /*!< [1..1] DMA2 clock enable                                                  */
      __IOM uint32_t SRAMEN     : 1;            /*!< [2..2] SRAM interface clock enable                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t FLITFEN    : 1;            /*!< [4..4] FLITF clock enable                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t CRCEN      : 1;            /*!< [6..6] CRC clock enable                                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t FSMCEN     : 1;            /*!< [8..8] FSMC clock enable                                                  */
      __IOM uint32_t TRNG_EN    : 1;            /*!< [9..9] TRNG clock enable                                                  */
      __IOM uint32_t SDIOEN     : 1;            /*!< [10..10] SDIO clock enable                                                */
      __IOM uint32_t USBHS_EN   : 1;            /*!< [11..11] USBHS clock enable                                               */
      __IOM uint32_t OTG_EN     : 1;            /*!< [12..12] OTG clock enable                                                 */
      __IOM uint32_t DVP_EN     : 1;            /*!< [13..13] DVP clock enable                                                 */
      __IOM uint32_t ETHMACEN   : 1;            /*!< [14..14] Ethernet MAC clock enable                                        */
      __IOM uint32_t ETHMACTXEN : 1;            /*!< [15..15] Ethernet MAC TX clock enable                                     */
      __IOM uint32_t ETHMACRXEN : 1;            /*!< [16..16] Ethernet MAC RX clock enable                                     */
    } bit;
  } AHBPCENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) APB2 peripheral clock enable register (RCC_APB2PCENR)      */
    
    struct {
      __IOM uint32_t AFIOEN     : 1;            /*!< [0..0] Alternate function I/O clock enable                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t IOPAEN     : 1;            /*!< [2..2] I/O port A clock enable                                            */
      __IOM uint32_t IOPBEN     : 1;            /*!< [3..3] I/O port B clock enable                                            */
      __IOM uint32_t IOPCEN     : 1;            /*!< [4..4] I/O port C clock enable                                            */
      __IOM uint32_t IOPDEN     : 1;            /*!< [5..5] I/O port D clock enable                                            */
      __IOM uint32_t IOPEEN     : 1;            /*!< [6..6] I/O port E clock enable                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC1EN     : 1;            /*!< [9..9] ADC1 interface clock enable                                        */
      __IOM uint32_t ADC2EN     : 1;            /*!< [10..10] ADC 2 interface clock enable                                     */
      __IOM uint32_t TIM1EN     : 1;            /*!< [11..11] TIM1 Timer clock enable                                          */
      __IOM uint32_t SPI1EN     : 1;            /*!< [12..12] SPI 1 clock enable                                               */
      __IOM uint32_t TIM8EN     : 1;            /*!< [13..13] TIM8 Timer clock enable                                          */
      __IOM uint32_t USART1EN   : 1;            /*!< [14..14] USART1 clock enable                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t TIM9_EN    : 1;            /*!< [19..19] TIM9 Timer clock enable                                          */
      __IOM uint32_t TIM10_EN   : 1;            /*!< [20..20] TIM10 Timer clock enable                                         */
    } bit;
  } APB2PCENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) APB1 peripheral clock enable register (RCC_APB1PCENR)      */
    
    struct {
      __IOM uint32_t TIM2EN     : 1;            /*!< [0..0] Timer 2 clock enable                                               */
      __IOM uint32_t TIM3EN     : 1;            /*!< [1..1] Timer 3 clock enable                                               */
      __IOM uint32_t TIM4EN     : 1;            /*!< [2..2] Timer 4 clock enable                                               */
      __IOM uint32_t TIM5EN     : 1;            /*!< [3..3] Timer 5 clock enable                                               */
      __IOM uint32_t TIM6EN     : 1;            /*!< [4..4] Timer 6 clock enable                                               */
      __IOM uint32_t TIM7EN     : 1;            /*!< [5..5] Timer 7 clock enable                                               */
      __IOM uint32_t USART6_EN  : 1;            /*!< [6..6] USART 6 clock enable                                               */
      __IOM uint32_t USART7_EN  : 1;            /*!< [7..7] USART 7 clock enable                                               */
      __IOM uint32_t USART8_EN  : 1;            /*!< [8..8] USART 8 clock enable                                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t WWDGEN     : 1;            /*!< [11..11] Window watchdog clock enable                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t SPI2EN     : 1;            /*!< [14..14] SPI 2 clock enable                                               */
      __IOM uint32_t SPI3EN     : 1;            /*!< [15..15] SPI 3 clock enable                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t USART2EN   : 1;            /*!< [17..17] USART 2 clock enable                                             */
      __IOM uint32_t USART3EN   : 1;            /*!< [18..18] USART 3 clock enable                                             */
      __IOM uint32_t UART4EN    : 1;            /*!< [19..19] UART 4 clock enable                                              */
      __IOM uint32_t UART5EN    : 1;            /*!< [20..20] UART 5 clock enable                                              */
      __IOM uint32_t I2C1EN     : 1;            /*!< [21..21] I2C 1 clock enable                                               */
      __IOM uint32_t I2C2EN     : 1;            /*!< [22..22] I2C 2 clock enable                                               */
      __IOM uint32_t USBDEN     : 1;            /*!< [23..23] USBD clock enable                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t CAN1EN     : 1;            /*!< [25..25] CAN1 clock enable                                                */
      __IOM uint32_t CAN2EN     : 1;            /*!< [26..26] CAN2 clock enable                                                */
      __IOM uint32_t BKPEN      : 1;            /*!< [27..27] Backup interface clock enable                                    */
      __IOM uint32_t PWREN      : 1;            /*!< [28..28] Power interface clock enable                                     */
      __IOM uint32_t DACEN      : 1;            /*!< [29..29] DAC interface clock enable                                       */
    } bit;
  } APB1PCENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Backup domain control register (RCC_BDCTLR)                */
    
