ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t LSEON      : 1;            /*!< [0..0] External Low Speed oscillator enable                               */
      __IM  uint32_t LSERDY     : 1;            /*!< [1..1] External Low Speed oscillator ready                                */
      __IOM uint32_t LSEBYP     : 1;            /*!< [2..2] External Low Speed oscillator bypass                               */
      __IM  uint32_t            : 5;
      __IOM uint32_t RTCSEL     : 2;            /*!< [9..8] RTC clock source selection                                         */
      __IM  uint32_t            : 5;
      __IOM uint32_t RTCEN      : 1;            /*!< [15..15] RTC clock enable                                                 */
      __IOM uint32_t BDRST      : 1;            /*!< [16..16] Backup domain software reset                                     */
    } bit;
  } BDCTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Control/status register (RCC_RSTSCKR)                      */
    
    struct {
      __IOM uint32_t LSION      : 1;            /*!< [0..0] Internal low speed oscillator enable                               */
      __IM  uint32_t LSIRDY     : 1;            /*!< [1..1] Internal low speed oscillator ready                                */
      __IM  uint32_t            : 22;
      __IOM uint32_t RMVF       : 1;            /*!< [24..24] Remove reset flag                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t PINRSTF    : 1;            /*!< [26..26] PIN reset flag                                                   */
      __IOM uint32_t PORRSTF    : 1;            /*!< [27..27] POR/PDR reset flag                                               */
      __IOM uint32_t SFTRSTF    : 1;            /*!< [28..28] Software reset flag                                              */
      __IOM uint32_t IWDGRSTF   : 1;            /*!< [29..29] Independent watchdog reset flag                                  */
      __IOM uint32_t WWDGRSTF   : 1;            /*!< [30..30] Window watchdog reset flag                                       */
      __IOM uint32_t LPWRRSTF   : 1;            /*!< [31..31] Low-power reset flag                                             */
    } bit;
  } RSTSCKR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) AHB reset register (RCC_APHBRSTR)                          */
    
    struct {
      __IM  uint32_t            : 12;
      __IOM uint32_t USBHDRST   : 1;            /*!< [12..12] USBHD reset                                                      */
      __IM  uint32_t DVPRST     : 1;            /*!< [13..13] DVP reset                                                        */
      __IOM uint32_t ETHMACRST  : 1;            /*!< [14..14] Ethernet MAC reset                                               */
    } bit;
  } AHBRSTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Clock configuration register2 (RCC_CFGR2)                  */
    
    struct {
      __IOM uint32_t PREDIV1    : 4;            /*!< [3..0] PREDIV1 division factor                                            */
      __IOM uint32_t PREDIV2    : 4;            /*!< [7..4] PREDIV2 division factor                                            */
      __IOM uint32_t PLL2MUL    : 4;            /*!< [11..8] PLL2 Multiplication Factor                                        */
      __IOM uint32_t PLL3MUL    : 4;            /*!< [15..12] PLL3 Multiplication Factor                                       */
      __IOM uint32_t PREDIV1SRC : 1;            /*!< [16..16] PREDIV1 entry clock source                                       */
      __IOM uint32_t I2S2SRC    : 1;            /*!< [17..17] I2S2 clock source                                                */
      __IOM uint32_t I2S3SRC    : 1;            /*!< [18..18] I2S3 clock source                                                */
      __IOM uint32_t TRNG_SRC   : 1;            /*!< [19..19] TRNG clock source                                                */
      __IOM uint32_t ETH1G_SRC  : 2;            /*!< [21..20] ETH1G clock source                                               */
      __IOM uint32_t ETH1G_125M_EN : 1;         /*!< [22..22] ETH1G _125M clock enable                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t USBHS_PREDIY : 3;          /*!< [26..24] USB HS PREDIV division factor                                    */
      __IOM uint32_t USBHS_PLL_SRC : 1;         /*!< [27..27] USB HS Multiplication Factor clock source                        */
      __IOM uint32_t USBHS_CKPEF_SEL : 2;       /*!< [29..28] USB HS Peference Clock source                                    */
      __IOM uint32_t USBHS_PLLALIVE : 1;        /*!< [30..30] USB HS Multiplication control                                    */
      __IOM uint32_t USBHS_CLK_SRC : 1;         /*!< [31..31] USB HS clock source                                              */
    } bit;
  } CFGR2;
} RCC_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                          EXTEND                                           ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40023800) EXTEND Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) EXTEND register                                            */
    
    struct {
      __IOM uint32_t USBDLS     : 1;            /*!< [0..0] USBD Lowspeed Enable                                               */
      __IOM uint32_t USBDPU     : 1;            /*!< [1..1] USBD pullup Enable                                                 */
      __IOM uint32_t ETH_10M_EN : 1;            /*!< [2..2] ETH 10M Enable                                                     */
      __IOM uint32_t ETH_RGMII_EN : 1;          /*!< [3..3] ETH RGMII Enable                                                   */
      __IOM uint32_t PLL_HSI_PRE : 1;           /*!< [4..4] Whether HSI is divided                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t LOCKUP_EN  : 1;            /*!< [6..6] LOCKUP_Eable                                                       */
      __IOM uint32_t LOCKUP_RSTF : 1;           /*!< [7..7] LOCKUP RESET                                                       */
      __IOM uint32_t ULLDO_TRIM : 2;            /*!< [9..8] ULLDO_TRIM                                                         */
      __IOM uint32_t LDO_TRIM   : 2;            /*!< [11..10] LDO_TRIM                                                         */
      __IOM uint32_t HSE_KEEP_LP : 1;           /*!< [12..12] HSE_KEEP_LP                                                      */
    } bit;
  } EXTEND_CTR;
} EXTEND_Type;                                  /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            OPA                                            ================ */
/* =========================================================================================================================== */

