ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
typedef struct {                                /*!< (@ 0x40023804) OPA Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register                                           */
    
    struct {
      __IOM uint32_t EN1        : 1;            /*!< [0..0] OPA Enable1                                                        */
      __IOM uint32_t MODE1      : 1;            /*!< [1..1] OPA MODE1                                                          */
      __IOM uint32_t NSEL1      : 1;            /*!< [2..2] OPA NSEL1                                                          */
      __IOM uint32_t PSEL1      : 1;            /*!< [3..3] OPA PSEL1                                                          */
      __IOM uint32_t EN2        : 1;            /*!< [4..4] OPA Enable2                                                        */
      __IOM uint32_t MODE2      : 1;            /*!< [5..5] OPA MODE2                                                          */
      __IOM uint32_t NSEL2      : 1;            /*!< [6..6] OPA NSEL2                                                          */
      __IOM uint32_t PSEL2      : 1;            /*!< [7..7] OPA PSEL2                                                          */
      __IOM uint32_t EN3        : 1;            /*!< [8..8] OPA Eable3                                                         */
      __IOM uint32_t MODE3      : 1;            /*!< [9..9] OPA MODE3                                                          */
      __IOM uint32_t NSEL3      : 1;            /*!< [10..10] OPA NSEL3                                                        */
      __IOM uint32_t PSEL3      : 1;            /*!< [11..11] OPA PSEL3                                                        */
      __IOM uint32_t EN4        : 1;            /*!< [12..12] OPA Enable4                                                      */
      __IOM uint32_t MODE4      : 1;            /*!< [13..13] OPA MODE4                                                        */
      __IOM uint32_t NSEL4      : 1;            /*!< [14..14] OPA NSEL4                                                        */
      __IOM uint32_t PSEL4      : 1;            /*!< [15..15] OPA PSEL4                                                        */
    } bit;
  } CR;
} OPA_Type;                                     /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40010800) GPIOA Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port configuration register low (GPIOn_CFGLR)              */
    
    struct {
      __IOM uint32_t MODE0      : 2;            /*!< [1..0] Port n.0 mode bits                                                 */
      __IOM uint32_t CNF0       : 2;            /*!< [3..2] Port n.0 configuration bits                                        */
      __IOM uint32_t MODE1      : 2;            /*!< [5..4] Port n.1 mode bits                                                 */
      __IOM uint32_t CNF1       : 2;            /*!< [7..6] Port n.1 configuration bits                                        */
      __IOM uint32_t MODE2      : 2;            /*!< [9..8] Port n.2 mode bits                                                 */
      __IOM uint32_t CNF2       : 2;            /*!< [11..10] Port n.2 configuration bits                                      */
      __IOM uint32_t MODE3      : 2;            /*!< [13..12] Port n.3 mode bits                                               */
      __IOM uint32_t CNF3       : 2;            /*!< [15..14] Port n.3 configuration bits                                      */
      __IOM uint32_t MODE4      : 2;            /*!< [17..16] Port n.4 mode bits                                               */
      __IOM uint32_t CNF4       : 2;            /*!< [19..18] Port n.4 configuration bits                                      */
      __IOM uint32_t MODE5      : 2;            /*!< [21..20] Port n.5 mode bits                                               */
      __IOM uint32_t CNF5       : 2;            /*!< [23..22] Port n.5 configuration bits                                      */
      __IOM uint32_t MODE6      : 2;            /*!< [25..24] Port n.6 mode bits                                               */
      __IOM uint32_t CNF6       : 2;            /*!< [27..26] Port n.6 configuration bits                                      */
      __IOM uint32_t MODE7      : 2;            /*!< [29..28] Port n.7 mode bits                                               */
      __IOM uint32_t CNF7       : 2;            /*!< [31..30] Port n.7 configuration bits                                      */
    } bit;
  } CFGLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port configuration register high (GPIOn_CFGHR)             */
    
    struct {
      __IOM uint32_t MODE8      : 2;            /*!< [1..0] Port n.8 mode bits                                                 */
      __IOM uint32_t CNF8       : 2;            /*!< [3..2] Port n.8 configuration bits                                        */
      __IOM uint32_t MODE9      : 2;            /*!< [5..4] Port n.9 mode bits                                                 */
      __IOM uint32_t CNF9       : 2;            /*!< [7..6] Port n.9 configuration bits                                        */
      __IOM uint32_t MODE10     : 2;            /*!< [9..8] Port n.10 mode bits                                                */
      __IOM uint32_t CNF10      : 2;            /*!< [11..10] Port n.10 configuration bits                                     */
      __IOM uint32_t MODE11     : 2;            /*!< [13..12] Port n.11 mode bits                                              */
      __IOM uint32_t CNF11      : 2;            /*!< [15..14] Port n.11 configuration bits                                     */
      __IOM uint32_t MODE12     : 2;            /*!< [17..16] Port n.12 mode bits                                              */
      __IOM uint32_t CNF12      : 2;            /*!< [19..18] Port n.12 configuration bits                                     */
      __IOM uint32_t MODE13     : 2;            /*!< [21..20] Port n.13 mode bits                                              */
      __IOM uint32_t CNF13      : 2;            /*!< [23..22] Port n.13 configuration bits                                     */
      __IOM uint32_t MODE14     : 2;            /*!< [25..24] Port n.14 mode bits                                              */
      __IOM uint32_t CNF14      : 2;            /*!< [27..26] Port n.14 configuration bits                                     */
      __IOM uint32_t MODE15     : 2;            /*!< [29..28] Port n.15 mode bits                                              */
      __IOM uint32_t CNF15      : 2;            /*!< [31..30] Port n.15 configuration bits                                     */
    } bit;
  } CFGHR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Port input data register (GPIOn_INDR)                      */
    
