ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t IDR0       : 1;            /*!< [0..0] Port input data                                                    */
      __IM  uint32_t IDR1       : 1;            /*!< [1..1] Port input data                                                    */
      __IM  uint32_t IDR2       : 1;            /*!< [2..2] Port input data                                                    */
      __IM  uint32_t IDR3       : 1;            /*!< [3..3] Port input data                                                    */
      __IM  uint32_t IDR4       : 1;            /*!< [4..4] Port input data                                                    */
      __IM  uint32_t IDR5       : 1;            /*!< [5..5] Port input data                                                    */
      __IM  uint32_t IDR6       : 1;            /*!< [6..6] Port input data                                                    */
      __IM  uint32_t IDR7       : 1;            /*!< [7..7] Port input data                                                    */
      __IM  uint32_t IDR8       : 1;            /*!< [8..8] Port input data                                                    */
      __IM  uint32_t IDR9       : 1;            /*!< [9..9] Port input data                                                    */
      __IM  uint32_t IDR10      : 1;            /*!< [10..10] Port input data                                                  */
      __IM  uint32_t IDR11      : 1;            /*!< [11..11] Port input data                                                  */
      __IM  uint32_t IDR12      : 1;            /*!< [12..12] Port input data                                                  */
      __IM  uint32_t IDR13      : 1;            /*!< [13..13] Port input data                                                  */
      __IM  uint32_t IDR14      : 1;            /*!< [14..14] Port input data                                                  */
      __IM  uint32_t IDR15      : 1;            /*!< [15..15] Port input data                                                  */
    } bit;
  } INDR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Port output data register (GPIOn_OUTDR)                    */
    
    struct {
      __IOM uint32_t ODR0       : 1;            /*!< [0..0] Port output data                                                   */
      __IOM uint32_t ODR1       : 1;            /*!< [1..1] Port output data                                                   */
      __IOM uint32_t ODR2       : 1;            /*!< [2..2] Port output data                                                   */
      __IOM uint32_t ODR3       : 1;            /*!< [3..3] Port output data                                                   */
      __IOM uint32_t ODR4       : 1;            /*!< [4..4] Port output data                                                   */
      __IOM uint32_t ODR5       : 1;            /*!< [5..5] Port output data                                                   */
      __IOM uint32_t ODR6       : 1;            /*!< [6..6] Port output data                                                   */
      __IOM uint32_t ODR7       : 1;            /*!< [7..7] Port output data                                                   */
      __IOM uint32_t ODR8       : 1;            /*!< [8..8] Port output data                                                   */
      __IOM uint32_t ODR9       : 1;            /*!< [9..9] Port output data                                                   */
      __IOM uint32_t ODR10      : 1;            /*!< [10..10] Port output data                                                 */
      __IOM uint32_t ODR11      : 1;            /*!< [11..11] Port output data                                                 */
      __IOM uint32_t ODR12      : 1;            /*!< [12..12] Port output data                                                 */
      __IOM uint32_t ODR13      : 1;            /*!< [13..13] Port output data                                                 */
      __IOM uint32_t ODR14      : 1;            /*!< [14..14] Port output data                                                 */
      __IOM uint32_t ODR15      : 1;            /*!< [15..15] Port output data                                                 */
    } bit;
  } OUTDR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000010) Port bit set/reset register (GPIOn_BSHR)                   */
    
    struct {
      __OM  uint32_t BS0        : 1;            /*!< [0..0] Set bit 0                                                          */
      __OM  uint32_t BS1        : 1;            /*!< [1..1] Set bit 1                                                          */
      __OM  uint32_t BS2        : 1;            /*!< [2..2] Set bit 1                                                          */
      __OM  uint32_t BS3        : 1;            /*!< [3..3] Set bit 3                                                          */
      __OM  uint32_t BS4        : 1;            /*!< [4..4] Set bit 4                                                          */
      __OM  uint32_t BS5        : 1;            /*!< [5..5] Set bit 5                                                          */
      __OM  uint32_t BS6        : 1;            /*!< [6..6] Set bit 6                                                          */
      __OM  uint32_t BS7        : 1;            /*!< [7..7] Set bit 7                                                          */
      __OM  uint32_t BS8        : 1;            /*!< [8..8] Set bit 8                                                          */
      __OM  uint32_t BS9        : 1;            /*!< [9..9] Set bit 9                                                          */
      __OM  uint32_t BS10       : 1;            /*!< [10..10] Set bit 10                                                       */
      __OM  uint32_t BS11       : 1;            /*!< [11..11] Set bit 11                                                       */
      __OM  uint32_t BS12       : 1;            /*!< [12..12] Set bit 12                                                       */
      __OM  uint32_t BS13       : 1;            /*!< [13..13] Set bit 13                                                       */
      __OM  uint32_t BS14       : 1;            /*!< [14..14] Set bit 14                                                       */
      __OM  uint32_t BS15       : 1;            /*!< [15..15] Set bit 15                                                       */
      __OM  uint32_t BR0        : 1;            /*!< [16..16] Reset bit 0                                                      */
      __OM  uint32_t BR1        : 1;            /*!< [17..17] Reset bit 1                                                      */
      __OM  uint32_t BR2        : 1;            /*!< [18..18] Reset bit 2                                                      */
      __OM  uint32_t BR3        : 1;            /*!< [19..19] Reset bit 3                                                      */
      __OM  uint32_t BR4        : 1;            /*!< [20..20] Reset bit 4                                                      */
      __OM  uint32_t BR5        : 1;            /*!< [21..21] Reset bit 5                                                      */
      __OM  uint32_t BR6        : 1;            /*!< [22..22] Reset bit 6                                                      */
      __OM  uint32_t BR7        : 1;            /*!< [23..23] Reset bit 7                                                      */
      __OM  uint32_t BR8        : 1;            /*!< [24..24] Reset bit 8                                                      */
      __OM  uint32_t BR9        : 1;            /*!< [25..25] Reset bit 9                                                      */
      __OM  uint32_t BR10       : 1;            /*!< [26..26] Reset bit 10                                                     */
      __OM  uint32_t BR11       : 1;            /*!< [27..27] Reset bit 11                                                     */
      __OM  uint32_t BR12       : 1;            /*!< [28..28] Reset bit 12                                                     */
      __OM  uint32_t BR13       : 1;            /*!< [29..29] Reset bit 13                                                     */
      __OM  uint32_t BR14       : 1;            /*!< [30..30] Reset bit 14                                                     */
      __OM  uint32_t BR15       : 1;            /*!< [31..31] Reset bit 15                                                     */
    } bit;
  } BSHR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) Port bit reset register (GPIOn_BCR)                        */
    
