ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __OM  uint32_t BR0        : 1;            /*!< [0..0] Reset bit 0                                                        */
      __OM  uint32_t BR1        : 1;            /*!< [1..1] Reset bit 1                                                        */
      __OM  uint32_t BR2        : 1;            /*!< [2..2] Reset bit 1                                                        */
      __OM  uint32_t BR3        : 1;            /*!< [3..3] Reset bit 3                                                        */
      __OM  uint32_t BR4        : 1;            /*!< [4..4] Reset bit 4                                                        */
      __OM  uint32_t BR5        : 1;            /*!< [5..5] Reset bit 5                                                        */
      __OM  uint32_t BR6        : 1;            /*!< [6..6] Reset bit 6                                                        */
      __OM  uint32_t BR7        : 1;            /*!< [7..7] Reset bit 7                                                        */
      __OM  uint32_t BR8        : 1;            /*!< [8..8] Reset bit 8                                                        */
      __OM  uint32_t BR9        : 1;            /*!< [9..9] Reset bit 9                                                        */
      __OM  uint32_t BR10       : 1;            /*!< [10..10] Reset bit 10                                                     */
      __OM  uint32_t BR11       : 1;            /*!< [11..11] Reset bit 11                                                     */
      __OM  uint32_t BR12       : 1;            /*!< [12..12] Reset bit 12                                                     */
      __OM  uint32_t BR13       : 1;            /*!< [13..13] Reset bit 13                                                     */
      __OM  uint32_t BR14       : 1;            /*!< [14..14] Reset bit 14                                                     */
      __OM  uint32_t BR15       : 1;            /*!< [15..15] Reset bit 15                                                     */
    } bit;
  } BCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Port configuration lock register                           */
    
    struct {
      __IOM uint32_t LCK0       : 1;            /*!< [0..0] Port A Lock bit 0                                                  */
      __IOM uint32_t LCK1       : 1;            /*!< [1..1] Port A Lock bit 1                                                  */
      __IOM uint32_t LCK2       : 1;            /*!< [2..2] Port A Lock bit 2                                                  */
      __IOM uint32_t LCK3       : 1;            /*!< [3..3] Port A Lock bit 3                                                  */
      __IOM uint32_t LCK4       : 1;            /*!< [4..4] Port A Lock bit 4                                                  */
      __IOM uint32_t LCK5       : 1;            /*!< [5..5] Port A Lock bit 5                                                  */
      __IOM uint32_t LCK6       : 1;            /*!< [6..6] Port A Lock bit 6                                                  */
      __IOM uint32_t LCK7       : 1;            /*!< [7..7] Port A Lock bit 7                                                  */
      __IOM uint32_t LCK8       : 1;            /*!< [8..8] Port A Lock bit 8                                                  */
      __IOM uint32_t LCK9       : 1;            /*!< [9..9] Port A Lock bit 9                                                  */
      __IOM uint32_t LCK10      : 1;            /*!< [10..10] Port A Lock bit 10                                               */
      __IOM uint32_t LCK11      : 1;            /*!< [11..11] Port A Lock bit 11                                               */
      __IOM uint32_t LCK12      : 1;            /*!< [12..12] Port A Lock bit 12                                               */
      __IOM uint32_t LCK13      : 1;            /*!< [13..13] Port A Lock bit 13                                               */
      __IOM uint32_t LCK14      : 1;            /*!< [14..14] Port A Lock bit 14                                               */
      __IOM uint32_t LCK15      : 1;            /*!< [15..15] Port A Lock bit 15                                               */
      __IOM uint32_t LCKK       : 1;            /*!< [16..16] Lock key                                                         */
    } bit;
  } LCKR;
} GPIOA_Type;                                   /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           AFIO                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40010000) AFIO Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Event Control Register (AFIO_ECR)                          */
    
    struct {
      __IOM uint32_t PIN        : 4;            /*!< [3..0] Pin selection                                                      */
      __IOM uint32_t PORT       : 3;            /*!< [6..4] Port selection                                                     */
      __IOM uint32_t EVOE       : 1;            /*!< [7..7] Event Output Enable                                                */
    } bit;
  } ECR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) AF remap and debug I/O configuration register
                                                                    (AFIO_PCFR)                                                */
    
    struct {
      __IOM uint32_t SPI1RM     : 1;            /*!< [0..0] SPI1 remapping                                                     */
      __IOM uint32_t I2C1RM     : 1;            /*!< [1..1] I2C1 remapping                                                     */
      __IOM uint32_t USART1RM   : 1;            /*!< [2..2] USART1 remapping                                                   */
      __IOM uint32_t USART2RM   : 1;            /*!< [3..3] USART2 remapping                                                   */
      __IOM uint32_t USART3RM   : 2;            /*!< [5..4] USART3 remapping                                                   */
      __IOM uint32_t TIM1RM     : 2;            /*!< [7..6] TIM1 remapping                                                     */
      __IOM uint32_t TIM2RM     : 2;            /*!< [9..8] TIM2 remapping                                                     */
      __IOM uint32_t TIM3RM     : 2;            /*!< [11..10] TIM3 remapping                                                   */
      __IOM uint32_t TIM4RM     : 1;            /*!< [12..12] TIM4 remapping                                                   */
      __IOM uint32_t CAN1RM     : 2;            /*!< [14..13] CAN1 remapping                                                   */
      __IOM uint32_t PD01RM     : 1;            /*!< [15..15] Port D0/Port D1 mapping on OSCIN/OSCOUT                          */
      __IOM uint32_t TIM5CH4RM  : 1;            /*!< [16..16] TIM5 channel4 internal remap                                     */
      __IOM uint32_t ADC1_ETRGINJ_RM : 1;       /*!< [17..17] ADC 1 External trigger injected conversion remapping             */
      __IOM uint32_t ADC1_ETRGREG_RM : 1;       /*!< [18..18] ADC 1 external trigger regular conversion remapping              */
      __IOM uint32_t ADC2_ETRGINJ_RM : 1;       /*!< [19..19] ADC 2 External trigger injected conversion remapping             */
      __IOM uint32_t ADC2_ETRGREG_RM : 1;       /*!< [20..20] ADC 2 external trigger regular conversion remapping              */
      __IOM uint32_t ETHRM      : 1;            /*!< [21..21] Ethernet remapping                                               */
      __IOM uint32_t CAN2RM     : 1;            /*!< [22..22] CAN2 remapping                                                   */
      __IOM uint32_t MII_RMII_SEL : 1;          /*!< [23..23] MII_RMII_SEL                                                     */
      __OM  uint32_t SWCFG      : 3;            /*!< [26..24] Serial wire JTAG configuration                                   */
      __IM  uint32_t            : 1;
      __IOM uint32_t SPI3_RM    : 1;            /*!< [28..28] SPI3 remapping                                                   */
      __IOM uint32_t TIM2ITRA_RM : 1;           /*!< [29..29] TIM2 internally triggers 1 remapping                             */
      __IOM uint32_t PTP_PPSP_RM : 1;           /*!< [30..30] Ethernet PTP_PPS remapping                                       */
    } bit;
  } PCFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) External interrupt configuration register 1 (AFIO_EXTICR1) */
    
