ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t EXTI0      : 4;            /*!< [3..0] EXTI0 configuration                                                */
      __IOM uint32_t EXTI1      : 4;            /*!< [7..4] EXTI1 configuration                                                */
      __IOM uint32_t EXTI2      : 4;            /*!< [11..8] EXTI2 configuration                                               */
      __IOM uint32_t EXTI3      : 4;            /*!< [15..12] EXTI3 configuration                                              */
    } bit;
  } EXTICR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) External interrupt configuration register 2 (AFIO_EXTICR2) */
    
    struct {
      __IOM uint32_t EXTI4      : 4;            /*!< [3..0] EXTI4 configuration                                                */
      __IOM uint32_t EXTI5      : 4;            /*!< [7..4] EXTI5 configuration                                                */
      __IOM uint32_t EXTI6      : 4;            /*!< [11..8] EXTI6 configuration                                               */
      __IOM uint32_t EXTI7      : 4;            /*!< [15..12] EXTI7 configuration                                              */
    } bit;
  } EXTICR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) External interrupt configuration register 3 (AFIO_EXTICR3) */
    
    struct {
      __IOM uint32_t EXTI8      : 4;            /*!< [3..0] EXTI8 configuration                                                */
      __IOM uint32_t EXTI9      : 4;            /*!< [7..4] EXTI9 configuration                                                */
      __IOM uint32_t EXTI10     : 4;            /*!< [11..8] EXTI10 configuration                                              */
      __IOM uint32_t EXTI11     : 4;            /*!< [15..12] EXTI11 configuration                                             */
    } bit;
  } EXTICR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) External interrupt configuration register 4 (AFIO_EXTICR4) */
    
    struct {
      __IOM uint32_t EXTI12     : 4;            /*!< [3..0] EXTI12 configuration                                               */
      __IOM uint32_t EXTI13     : 4;            /*!< [7..4] EXTI13 configuration                                               */
      __IOM uint32_t EXTI14     : 4;            /*!< [11..8] EXTI14 configuration                                              */
      __IOM uint32_t EXTI15     : 4;            /*!< [15..12] EXTI15 configuration                                             */
    } bit;
  } EXTICR4;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) AF remap and debug I/O configuration register
                                                                    (AFIO_PCFR2)                                               */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t TIM8_REMAP : 1;            /*!< [2..2] TIM8 remapping                                                     */
      __IOM uint32_t TIM9_REMAP : 2;            /*!< [4..3] TIM9 remapping                                                     */
      __IOM uint32_t TIM10_REMAP : 2;           /*!< [6..5] TIM10 remapping                                                    */
      __IM  uint32_t            : 3;
      __IOM uint32_t FSMC_NADV  : 1;            /*!< [10..10] FSMC_NADV                                                        */
      __IM  uint32_t            : 5;
      __IOM uint32_t UART4_REMAP : 2;           /*!< [17..16] UART4 remapping                                                  */
      __IOM uint32_t UART5_REMAP : 2;           /*!< [19..18] UART5 remapping                                                  */
      __IOM uint32_t UART6_REMAP : 2;           /*!< [21..20] UART6 remapping                                                  */
      __IOM uint32_t UART7_REMAP : 2;           /*!< [23..22] UART7 remapping                                                  */
      __IOM uint32_t UART8_REMAP : 2;           /*!< [25..24] UART8 remapping                                                  */
      __IOM uint32_t UART1_REMAP2 : 1;          /*!< [26..26] UART1 remapping                                                  */
    } bit;
  } PCFR2;
} AFIO_Type;                                    /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40010400) EXTI Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Interrupt mask register (EXTI_INTENR)                      */
    
    struct {
      __IOM uint32_t MR0        : 1;            /*!< [0..0] Interrupt Mask on line 0                                           */
      __IOM uint32_t MR1        : 1;            /*!< [1..1] Interrupt Mask on line 1                                           */
      __IOM uint32_t MR2        : 1;            /*!< [2..2] Interrupt Mask on line 2                                           */
      __IOM uint32_t MR3        : 1;            /*!< [3..3] Interrupt Mask on line 3                                           */
      __IOM uint32_t MR4        : 1;            /*!< [4..4] Interrupt Mask on line 4                                           */
      __IOM uint32_t MR5        : 1;            /*!< [5..5] Interrupt Mask on line 5                                           */
      __IOM uint32_t MR6        : 1;            /*!< [6..6] Interrupt Mask on line 6                                           */
      __IOM uint32_t MR7        : 1;            /*!< [7..7] Interrupt Mask on line 7                                           */
      __IOM uint32_t MR8        : 1;            /*!< [8..8] Interrupt Mask on line 8                                           */
      __IOM uint32_t MR9        : 1;            /*!< [9..9] Interrupt Mask on line 9                                           */
      __IOM uint32_t MR10       : 1;            /*!< [10..10] Interrupt Mask on line 10                                        */
      __IOM uint32_t MR11       : 1;            /*!< [11..11] Interrupt Mask on line 11                                        */
      __IOM uint32_t MR12       : 1;            /*!< [12..12] Interrupt Mask on line 12                                        */
      __IOM uint32_t MR13       : 1;            /*!< [13..13] Interrupt Mask on line 13                                        */
      __IOM uint32_t MR14       : 1;            /*!< [14..14] Interrupt Mask on line 14                                        */
      __IOM uint32_t MR15       : 1;            /*!< [15..15] Interrupt Mask on line 15                                        */
      __IOM uint32_t MR16       : 1;            /*!< [16..16] Interrupt Mask on line 16                                        */
      __IOM uint32_t MR17       : 1;            /*!< [17..17] Interrupt Mask on line 17                                        */
      __IOM uint32_t MR18       : 1;            /*!< [18..18] Interrupt Mask on line 18                                        */
      __IOM uint32_t MR19       : 1;            /*!< [19..19] Interrupt Mask on line 19                                        */
    } bit;
  } INTENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Event mask register (EXTI_EVENR)                           */
    
