ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t GIF1       : 1;            /*!< [0..0] Channel 1 Global interrupt flag                                    */
      __IM  uint32_t TCIF1      : 1;            /*!< [1..1] Channel 1 Transfer Complete flag                                   */
      __IM  uint32_t HTIF1      : 1;            /*!< [2..2] Channel 1 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF1      : 1;            /*!< [3..3] Channel 1 Transfer Error flag                                      */
      __IM  uint32_t GIF2       : 1;            /*!< [4..4] Channel 2 Global interrupt flag                                    */
      __IM  uint32_t TCIF2      : 1;            /*!< [5..5] Channel 2 Transfer Complete flag                                   */
      __IM  uint32_t HTIF2      : 1;            /*!< [6..6] Channel 2 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF2      : 1;            /*!< [7..7] Channel 2 Transfer Error flag                                      */
      __IM  uint32_t GIF3       : 1;            /*!< [8..8] Channel 3 Global interrupt flag                                    */
      __IM  uint32_t TCIF3      : 1;            /*!< [9..9] Channel 3 Transfer Complete flag                                   */
      __IM  uint32_t HTIF3      : 1;            /*!< [10..10] Channel 3 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF3      : 1;            /*!< [11..11] Channel 3 Transfer Error flag                                    */
      __IM  uint32_t GIF4       : 1;            /*!< [12..12] Channel 4 Global interrupt flag                                  */
      __IM  uint32_t TCIF4      : 1;            /*!< [13..13] Channel 4 Transfer Complete flag                                 */
      __IM  uint32_t HTIF4      : 1;            /*!< [14..14] Channel 4 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF4      : 1;            /*!< [15..15] Channel 4 Transfer Error flag                                    */
      __IM  uint32_t GIF5       : 1;            /*!< [16..16] Channel 5 Global interrupt flag                                  */
      __IM  uint32_t TCIF5      : 1;            /*!< [17..17] Channel 5 Transfer Complete flag                                 */
      __IM  uint32_t HTIF5      : 1;            /*!< [18..18] Channel 5 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF5      : 1;            /*!< [19..19] Channel 5 Transfer Error flag                                    */
      __IM  uint32_t GIF6       : 1;            /*!< [20..20] Channel 6 Global interrupt flag                                  */
      __IM  uint32_t TCIF6      : 1;            /*!< [21..21] Channel 6 Transfer Complete flag                                 */
      __IM  uint32_t HTIF6      : 1;            /*!< [22..22] Channel 6 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF6      : 1;            /*!< [23..23] Channel 6 Transfer Error flag                                    */
      __IM  uint32_t GIF7       : 1;            /*!< [24..24] Channel 7 Global interrupt flag                                  */
      __IM  uint32_t TCIF7      : 1;            /*!< [25..25] Channel 7 Transfer Complete flag                                 */
      __IM  uint32_t HTIF7      : 1;            /*!< [26..26] Channel 7 Half Transfer Complete flag                            */
      __IM  uint32_t TEIF7      : 1;            /*!< [27..27] Channel 7 Transfer Error flag                                    */
    } bit;
  } INTFR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) DMA interrupt flag clear register (DMA_INTFCR)             */
    
    struct {
      __OM  uint32_t CGIF1      : 1;            /*!< [0..0] Channel 1 Global interrupt clear                                   */
      __OM  uint32_t CTCIF1     : 1;            /*!< [1..1] Channel 1 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF1     : 1;            /*!< [2..2] Channel 1 Half Transfer clear                                      */
      __OM  uint32_t CTEIF1     : 1;            /*!< [3..3] Channel 1 Transfer Error clear                                     */
      __OM  uint32_t CGIF2      : 1;            /*!< [4..4] Channel 2 Global interrupt clear                                   */
      __OM  uint32_t CTCIF2     : 1;            /*!< [5..5] Channel 2 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF2     : 1;            /*!< [6..6] Channel 2 Half Transfer clear                                      */
      __OM  uint32_t CTEIF2     : 1;            /*!< [7..7] Channel 2 Transfer Error clear                                     */
      __OM  uint32_t CGIF3      : 1;            /*!< [8..8] Channel 3 Global interrupt clear                                   */
      __OM  uint32_t CTCIF3     : 1;            /*!< [9..9] Channel 3 Transfer Complete clear                                  */
      __OM  uint32_t CHTIF3     : 1;            /*!< [10..10] Channel 3 Half Transfer clear                                    */
      __OM  uint32_t CTEIF3     : 1;            /*!< [11..11] Channel 3 Transfer Error clear                                   */
      __OM  uint32_t CGIF4      : 1;            /*!< [12..12] Channel 4 Global interrupt clear                                 */
      __OM  uint32_t CTCIF4     : 1;            /*!< [13..13] Channel 4 Transfer Complete clear                                */
      __OM  uint32_t CHTIF4     : 1;            /*!< [14..14] Channel 4 Half Transfer clear                                    */
      __OM  uint32_t CTEIF4     : 1;            /*!< [15..15] Channel 4 Transfer Error clear                                   */
      __OM  uint32_t CGIF5      : 1;            /*!< [16..16] Channel 5 Global interrupt clear                                 */
      __OM  uint32_t CTCIF5     : 1;            /*!< [17..17] Channel 5 Transfer Complete clear                                */
      __OM  uint32_t CHTIF5     : 1;            /*!< [18..18] Channel 5 Half Transfer clear                                    */
      __OM  uint32_t CTEIF5     : 1;            /*!< [19..19] Channel 5 Transfer Error clear                                   */
      __OM  uint32_t CGIF6      : 1;            /*!< [20..20] Channel 6 Global interrupt clear                                 */
      __OM  uint32_t CTCIF6     : 1;            /*!< [21..21] Channel 6 Transfer Complete clear                                */
      __OM  uint32_t CHTIF6     : 1;            /*!< [22..22] Channel 6 Half Transfer clear                                    */
      __OM  uint32_t CTEIF6     : 1;            /*!< [23..23] Channel 6 Transfer Error clear                                   */
      __OM  uint32_t CGIF7      : 1;            /*!< [24..24] Channel 7 Global interrupt clear                                 */
      __OM  uint32_t CTCIF7     : 1;            /*!< [25..25] Channel 7 Transfer Complete clear                                */
      __OM  uint32_t CHTIF7     : 1;            /*!< [26..26] Channel 7 Half Transfer clear                                    */
      __OM  uint32_t CTEIF7     : 1;            /*!< [27..27] Channel 7 Transfer Error clear                                   */
    } bit;
  } INTFCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) DMA channel configuration register (DMA_CFGR)              */
    
