ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) DMA channel 3 peripheral address register                  */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) DMA channel 3 memory address register                      */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR3;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) DMA channel configuration register (DMA_CFGR)              */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } bit;
  } CFGR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) DMA channel 4 number of data register                      */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) DMA channel 4 peripheral address register                  */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) DMA channel 4 memory address register                      */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR4;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) DMA channel configuration register (DMA_CFGR)              */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } bit;
  } CFGR5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) DMA channel 5 number of data register                      */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) DMA channel 5 peripheral address register                  */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) DMA channel 5 memory address register                      */
    
