ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) DMA channel 8 peripheral address register used
                                                                    in ch32v30x_D8/D8C                                         */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) DMA channel 8 memory address register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) DMA channel configuration register (DMA_CFGR)
                                                                    used in ch32v30x_D8/D8C                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } bit;
  } CFGR9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) DMA channel 9 number of data register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) DMA channel 7 peripheral address register used
                                                                    in ch32v30x_D8/D8C                                         */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) DMA channel 9 memory address register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) DMA channel configuration register (DMA_CFGR)
                                                                    used in ch32v30x_D8/D8C                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } bit;
  } CFGR10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) DMA channel 10 number of data register used in
                                                                    ch32v30x_D8/D8C                                            */
    
