ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) DMA channel 10 peripheral address register used
                                                                    in ch32v30x_D8/D8C                                         */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) DMA channel 10 memory address register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) DMA channel configuration register (DMA_CFGR)
                                                                    used in ch32v30x_D8/D8C                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] Channel enable                                                     */
      __IOM uint32_t TCIE       : 1;            /*!< [1..1] Transfer complete interrupt enable                                 */
      __IOM uint32_t HTIE       : 1;            /*!< [2..2] Half Transfer interrupt enable                                     */
      __IOM uint32_t TEIE       : 1;            /*!< [3..3] Transfer error interrupt enable                                    */
      __IOM uint32_t DIR        : 1;            /*!< [4..4] Data transfer direction                                            */
      __IOM uint32_t CIRC       : 1;            /*!< [5..5] Circular mode                                                      */
      __IOM uint32_t PINC       : 1;            /*!< [6..6] Peripheral increment mode                                          */
      __IOM uint32_t MINC       : 1;            /*!< [7..7] Memory increment mode                                              */
      __IOM uint32_t PSIZE      : 2;            /*!< [9..8] Peripheral size                                                    */
      __IOM uint32_t MSIZE      : 2;            /*!< [11..10] Memory size                                                      */
      __IOM uint32_t PL         : 2;            /*!< [13..12] Channel Priority level                                           */
      __IOM uint32_t MEM2MEM    : 1;            /*!< [14..14] Memory to memory mode                                            */
    } bit;
  } CFGR11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) DMA channel 11 number of data register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t NDT        : 16;           /*!< [15..0] Number of data to transfer                                        */
    } bit;
  } CNTR11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) DMA channel 11 peripheral address register used
                                                                    in ch32v30x_D8/D8C                                         */
    
    struct {
      __IOM uint32_t PA         : 32;           /*!< [31..0] Peripheral address                                                */
    } bit;
  } PADDR11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) DMA channel 11 memory address register used in
                                                                    ch32v30x_D8/D8C                                            */
    
    struct {
      __IOM uint32_t MA         : 32;           /*!< [31..0] Memory address                                                    */
    } bit;
  } MADDR11;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x000000D0) DMA2 EXTEN interrupt status register (DMA_INTFR)used
                                                                    in ch32v30x_D8/D8C                                         */
    
    struct {
      __IM  uint32_t GIF8       : 1;            /*!< [0..0] Channel 8 Global interrupt flag                                    */
      __IM  uint32_t TCIF8      : 1;            /*!< [1..1] Channel 8 Transfer Complete flag                                   */
      __IM  uint32_t HTIF8      : 1;            /*!< [2..2] Channel 8 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF8      : 1;            /*!< [3..3] Channel 8 Transfer Error flag                                      */
      __IM  uint32_t GIF9       : 1;            /*!< [4..4] Channel 9 Global interrupt flag                                    */
      __IM  uint32_t TCIF9      : 1;            /*!< [5..5] Channel 9 Transfer Complete flag                                   */
      __IM  uint32_t HTIF9      : 1;            /*!< [6..6] Channel 9 Half Transfer Complete flag                              */
      __IM  uint32_t TEIF9      : 1;            /*!< [7..7] Channel 9 Transfer Error flag                                      */
      __IM  uint32_t GIF10      : 1;            /*!< [8..8] Channel 10 Global interrupt flag                                   */
      __IM  uint32_t TCIF10     : 1;            /*!< [9..9] Channel 10 Transfer Complete flag                                  */
      __IM  uint32_t HTIF10     : 1;            /*!< [10..10] Channel 10 Half Transfer Complete flag                           */
      __IM  uint32_t TEIF10     : 1;            /*!< [11..11] Channel 10 Transfer Error flag                                   */
      __IM  uint32_t GIF11      : 1;            /*!< [12..12] Channel 11 Global interrupt flag                                 */
      __IM  uint32_t TCIF11     : 1;            /*!< [13..13] Channel 11 Transfer Complete flag                                */
      __IM  uint32_t HTIF11     : 1;            /*!< [14..14] Channel 11 Half Transfer Complete flag                           */
      __IM  uint32_t TEIF11     : 1;            /*!< [15..15] Channel 11 Transfer Error flag                                   */
    } bit;
  } EXTEN_INTFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) DMA2 EXTEN interrupt flag clear register (DMA_INTFCR)used
                                                                    in ch32v30x_D8/D8C                                         */
    
