ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CGIF8      : 1;            /*!< [0..0] Channel 8 Global interrupt clear                                   */
      __IOM uint32_t CTCIF8     : 1;            /*!< [1..1] Channel 8 Global interrupt clear                                   */
      __IOM uint32_t CHTIF8     : 1;            /*!< [2..2] Channel 8 Global interrupt clear                                   */
      __IOM uint32_t CTEIF8     : 1;            /*!< [3..3] Channel 8 Global interrupt clear                                   */
      __IOM uint32_t CGIF9      : 1;            /*!< [4..4] Channel 9 Global interrupt clear                                   */
      __IOM uint32_t CTCIF9     : 1;            /*!< [5..5] Channel 9 Global interrupt clear                                   */
      __IOM uint32_t CHTIF9     : 1;            /*!< [6..6] Channel 9 Global interrupt clear                                   */
      __IOM uint32_t CTEIF9     : 1;            /*!< [7..7] Channel 9 Global interrupt clear                                   */
      __IOM uint32_t CGIF10     : 1;            /*!< [8..8] Channel 10 Global interrupt clear                                  */
      __IOM uint32_t CTCIF10    : 1;            /*!< [9..9] Channel 10 Global interrupt clear                                  */
      __IOM uint32_t CHTIF10    : 1;            /*!< [10..10] Channel 10 Global interrupt clear                                */
      __IOM uint32_t CTEIF10    : 1;            /*!< [11..11] Channel 10 Global interrupt clear                                */
      __IOM uint32_t CGIF11     : 1;            /*!< [12..12] Channel 11 Global interrupt clear                                */
      __IOM uint32_t CTCIF11    : 1;            /*!< [13..13] Channel 11 Global interrupt clear                                */
      __IOM uint32_t CHTIF11    : 1;            /*!< [14..14] Channel 11 Global interrupt clear                                */
      __IOM uint32_t CTEIF11    : 1;            /*!< [15..15] Channel 11 Global interrupt clear                                */
    } bit;
  } EXTEN_INTFCR;
} DMA2_Type;                                    /*!< Size = 216 (0xd8)                                                         */



/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40002800) RTC Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) RTC Control Register High                                  */
    
    struct {
      __IOM uint32_t SECIE      : 1;            /*!< [0..0] Second interrupt Enable                                            */
      __IOM uint32_t ALRIE      : 1;            /*!< [1..1] Alarm interrupt Enable                                             */
      __IOM uint32_t OWIE       : 1;            /*!< [2..2] Overflow interrupt Enable                                          */
    } bit;
  } CTLRH;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) RTC Control Register Low                                   */
    
    struct {
      __IOM uint32_t SECF       : 1;            /*!< [0..0] Second Flag                                                        */
      __IOM uint32_t ALRF       : 1;            /*!< [1..1] Alarm Flag                                                         */
      __IOM uint32_t OWF        : 1;            /*!< [2..2] Overflow Flag                                                      */
      __IOM uint32_t RSF        : 1;            /*!< [3..3] Registers Synchronized Flag                                        */
      __IOM uint32_t CNF        : 1;            /*!< [4..4] Configuration Flag                                                 */
      __IM  uint32_t RTOFF      : 1;            /*!< [5..5] RTC operation OFF                                                  */
    } bit;
  } CTLRL;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) RTC Prescaler Load Register High                           */
    
    struct {
      __OM  uint32_t PRLH       : 4;            /*!< [3..0] RTC Prescaler Load Register High                                   */
    } bit;
  } PSCRH;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000000C) RTC Prescaler Load Register Low                            */
    
    struct {
      __OM  uint32_t PRLL       : 16;           /*!< [15..0] RTC Prescaler Divider Register Low                                */
    } bit;
  } PSCRL;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000010) RTC Prescaler Divider Register High                        */
    
    struct {
      __IM  uint32_t DIVH       : 4;            /*!< [3..0] RTC prescaler divider register high                                */
    } bit;
  } DIVH;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) RTC Prescaler Divider Register Low                         */
    
    struct {
      __IM  uint32_t DIVL       : 16;           /*!< [15..0] RTC prescaler divider register Low                                */
    } bit;
  } DIVL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) RTC Counter Register High                                  */
    
    struct {
      __IOM uint32_t CNTH       : 16;           /*!< [15..0] RTC counter register high                                         */
    } bit;
  } CNTH;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) RTC Counter Register Low                                   */
    
