ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CNTL       : 16;           /*!< [15..0] RTC counter register Low                                          */
    } bit;
  } CNTL;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000020) RTC Alarm Register High                                    */
    
    struct {
      __OM  uint32_t ALRH       : 16;           /*!< [15..0] RTC alarm register high                                           */
    } bit;
  } ALRMH;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000024) RTC Alarm Register Low                                     */
    
    struct {
      __OM  uint32_t ALRL       : 16;           /*!< [15..0] RTC alarm register low                                            */
    } bit;
  } ALRML;
} RTC_Type;                                     /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            BKP                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40006C00) BKP Structure                                              */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D1         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D2         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D3         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D4         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D5         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D6         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D7         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D8         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D9         : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D10        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) RTC clock calibration register (BKP_OCTLR)                 */
    
    struct {
      __IOM uint32_t CAL        : 7;            /*!< [6..0] Calibration value                                                  */
      __IOM uint32_t CCO        : 1;            /*!< [7..7] Calibration Clock Output                                           */
      __IOM uint32_t ASOE       : 1;            /*!< [8..8] Alarm or second output enable                                      */
      __IOM uint32_t ASOS       : 1;            /*!< [9..9] Alarm or second output selection                                   */
    } bit;
  } OCTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Backup control register (BKP_TPCTLR)                       */
    
    struct {
      __IOM uint32_t TPE        : 1;            /*!< [0..0] Tamper pin enable                                                  */
      __IOM uint32_t TPAL       : 1;            /*!< [1..1] Tamper pin active level                                            */
    } bit;
  } TPCTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) BKP_TPCSR control/status register (BKP_CSR)                */
    
    struct {
      __OM  uint32_t CTE        : 1;            /*!< [0..0] Clear Tamper event                                                 */
      __OM  uint32_t CTI        : 1;            /*!< [1..1] Clear Tamper Interrupt                                             */
      __IOM uint32_t TPIE       : 1;            /*!< [2..2] Tamper Pin interrupt enable                                        */
      __IM  uint32_t            : 5;
      __IM  uint32_t TEF        : 1;            /*!< [8..8] Tamper Event Flag                                                  */
      __IM  uint32_t TIF        : 1;            /*!< [9..9] Tamper Interrupt Flag                                              */
    } bit;
  } TPCSR;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Backup data register (BKP_DR)                              */
    
