ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DR11       : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t DR12       : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR12;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t DR13       : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D14        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR14;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D15        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR15;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D16        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR16;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D17        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR17;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D18        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR18;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D19        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR19;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D20        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR20;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D21        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR21;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D22        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR22;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D23        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR23;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D24        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR24;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D25        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR25;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D26        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR26;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D27        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR27;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D28        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR28;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D29        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR29;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D30        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR30;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Backup data register (BKP_DR)                              */
    
