ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t D31        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR31;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D32        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR32;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D33        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR33;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D34        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR34;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D35        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR35;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D36        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR36;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D37        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR37;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D38        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR38;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D39        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR39;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D40        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR40;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D41        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR41;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Backup data register (BKP_DR)                              */
    
    struct {
      __IOM uint32_t D42        : 16;           /*!< [15..0] Backup data                                                       */
    } bit;
  } DATAR42;
} BKP_Type;                                     /*!< Size = 192 (0xc0)                                                         */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40003000) IWDG Structure                                             */
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000000) Key register (IWDG_CTLR)                                   */
    
    struct {
      __OM  uint32_t KEY        : 16;           /*!< [15..0] Key value                                                         */
    } bit;
  } CTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Prescaler register (IWDG_PSCR)                             */
    
    struct {
      __IOM uint32_t PR         : 3;            /*!< [2..0] Prescaler divider                                                  */
    } bit;
  } PSCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Reload register (IWDG_RLDR)                                */
    
    struct {
      __IOM uint32_t RL         : 12;           /*!< [11..0] Watchdog counter reload value                                     */
    } bit;
  } RLDR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Status register (IWDG_SR)                                  */
    
    struct {
      __IM  uint32_t PVU        : 1;            /*!< [0..0] Watchdog prescaler value update                                    */
      __IM  uint32_t RVU        : 1;            /*!< [1..1] Watchdog counter reload value update                               */
    } bit;
  } STATR;
} IWDG_Type;                                    /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40002C00) WWDG Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register (WWDG_CR)                                 */
    
