ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t CH2CVR     : 16;           /*!< [15..0] Capture/Compare 2 value                                           */
    } bit;
  } CH2CVR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */
    
    struct {
      __IOM uint32_t CH3CVR     : 16;           /*!< [15..0] Capture/Compare value                                             */
    } bit;
  } CH3CVR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) capture/compare register 4                                 */
    
    struct {
      __IOM uint32_t CH4CVR     : 16;           /*!< [15..0] Capture/Compare value                                             */
    } bit;
  } CH4CVR;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) DMA control register                                       */
    
    struct {
      __IOM uint32_t DBA        : 5;            /*!< [4..0] DMA base address                                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DBL        : 5;            /*!< [12..8] DMA burst length                                                  */
    } bit;
  } DMACFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
    
    struct {
      __IOM uint32_t DMAADR     : 16;           /*!< [15..0] DMA register for burst accesses                                   */
    } bit;
  } DMAADR;
} TIM2_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM6                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40001000) TIM6 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32_t CEN        : 1;            /*!< [0..0] Counter enable                                                     */
      __IOM uint32_t UDIS       : 1;            /*!< [1..1] Update disable                                                     */
      __IOM uint32_t URS        : 1;            /*!< [2..2] Update request source                                              */
      __IOM uint32_t OPM        : 1;            /*!< [3..3] One-pulse mode                                                     */
      __IM  uint32_t            : 3;
      __IOM uint32_t ARPE       : 1;            /*!< [7..7] Auto-reload preload enable                                         */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IM  uint32_t            : 4;
      __IOM uint32_t MMS        : 3;            /*!< [6..4] Master mode selection                                              */
    } bit;
  } CTLR2;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
    
    struct {
      __IOM uint32_t UIE        : 1;            /*!< [0..0] Update interrupt enable                                            */
      __IM  uint32_t            : 7;
      __IOM uint32_t UDE        : 1;            /*!< [8..8] Update DMA request enable                                          */
    } bit;
  } DMAINTENR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) status register                                            */
    
    struct {
      __IOM uint32_t UIF        : 1;            /*!< [0..0] Update interrupt flag                                              */
    } bit;
  } INTFR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) event generation register                                  */
    
    struct {
      __OM  uint32_t UG         : 1;            /*!< [0..0] Update generation                                                  */
    } bit;
  } SWEVGR;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) counter                                                    */
    
    struct {
      __IOM uint32_t CNT        : 16;           /*!< [15..0] counter value                                                     */
    } bit;
  } CNT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) prescaler                                                  */
    
    struct {
      __IOM uint32_t PSC        : 16;           /*!< [15..0] Prescaler value                                                   */
    } bit;
  } PSC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) auto-reload register                                       */
    
    struct {
      __IOM uint32_t ATRLR      : 16;           /*!< [15..0] Auto-reload value                                                 */
    } bit;
  } ATRLR;
} TIM6_Type;                                    /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */

