ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
typedef struct {                                /*!< (@ 0x40005400) I2C1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Control register 1                                         */
    
    struct {
      __IOM uint32_t PE         : 1;            /*!< [0..0] Peripheral enable                                                  */
      __IOM uint32_t SMBUS      : 1;            /*!< [1..1] SMBus mode                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t SMBTYPE    : 1;            /*!< [3..3] SMBus type                                                         */
      __IOM uint32_t ENARP      : 1;            /*!< [4..4] ARP enable                                                         */
      __IOM uint32_t ENPEC      : 1;            /*!< [5..5] PEC enable                                                         */
      __IOM uint32_t ENGC       : 1;            /*!< [6..6] General call enable                                                */
      __IOM uint32_t NOSTRETCH  : 1;            /*!< [7..7] Clock stretching disable (Slave mode)                              */
      __IOM uint32_t START      : 1;            /*!< [8..8] Start generation                                                   */
      __IOM uint32_t STOP       : 1;            /*!< [9..9] Stop generation                                                    */
      __IOM uint32_t ACK        : 1;            /*!< [10..10] Acknowledge enable                                               */
      __IOM uint32_t POS        : 1;            /*!< [11..11] Acknowledge/PEC Position (for data reception)                    */
      __IOM uint32_t PEC        : 1;            /*!< [12..12] Packet error checking                                            */
      __IOM uint32_t ALERT      : 1;            /*!< [13..13] SMBus alert                                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t SWRST      : 1;            /*!< [15..15] Software reset                                                   */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Control register 2                                         */
    
    struct {
      __IOM uint32_t FREQ       : 6;            /*!< [5..0] Peripheral clock frequency                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t ITERREN    : 1;            /*!< [8..8] Error interrupt enable                                             */
      __IOM uint32_t ITEVTEN    : 1;            /*!< [9..9] Event interrupt enable                                             */
      __IOM uint32_t ITBUFEN    : 1;            /*!< [10..10] Buffer interrupt enable                                          */
      __IOM uint32_t DMAEN      : 1;            /*!< [11..11] DMA requests enable                                              */
      __IOM uint32_t LAST       : 1;            /*!< [12..12] DMA last transfer                                                */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Own address register 1                                     */
    
    struct {
      __IOM uint32_t ADD0       : 1;            /*!< [0..0] Interface address                                                  */
      __IOM uint32_t ADD7_1     : 7;            /*!< [7..1] Interface address                                                  */
      __IOM uint32_t ADD9_8     : 2;            /*!< [9..8] Interface address                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t MUST1      : 1;            /*!< [14..14] Must be 1                                                        */
      __IOM uint32_t ADDMODE    : 1;            /*!< [15..15] Addressing mode (slave mode)                                     */
    } bit;
  } OADDR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Own address register 2                                     */
    
    struct {
      __IOM uint32_t ENDUAL     : 1;            /*!< [0..0] Dual addressing mode enable                                        */
      __IOM uint32_t ADD2       : 7;            /*!< [7..1] Interface address                                                  */
    } bit;
  } OADDR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Data register                                              */
    
    struct {
      __IOM uint32_t DATAR      : 8;            /*!< [7..0] 8-bit data register                                                */
    } bit;
  } DATAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Status register 1                                          */
    
    struct {
      __IM  uint32_t SB         : 1;            /*!< [0..0] Start bit (Master mode)                                            */
      __IM  uint32_t ADDR       : 1;            /*!< [1..1] Address sent (master mode)/matched (slave mode)                    */
      __IM  uint32_t BTF        : 1;            /*!< [2..2] Byte transfer finished                                             */
      __IM  uint32_t ADD10      : 1;            /*!< [3..3] 10-bit header sent (Master mode)                                   */
      __IM  uint32_t STOPF      : 1;            /*!< [4..4] Stop detection (slave mode)                                        */
      __IM  uint32_t            : 1;
      __IM  uint32_t RxNE       : 1;            /*!< [6..6] Data register not empty (receivers)                                */
      __IM  uint32_t TxE        : 1;            /*!< [7..7] Data register empty (transmitters)                                 */
      __IOM uint32_t BERR       : 1;            /*!< [8..8] Bus error                                                          */
      __IOM uint32_t ARLO       : 1;            /*!< [9..9] Arbitration lost (master mode)                                     */
      __IOM uint32_t AF         : 1;            /*!< [10..10] Acknowledge failure                                              */
      __IOM uint32_t OVR        : 1;            /*!< [11..11] Overrun/Underrun                                                 */
      __IOM uint32_t PECERR     : 1;            /*!< [12..12] PEC Error in reception                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t TIMEOUT    : 1;            /*!< [14..14] Timeout or Tlow error                                            */
      __IOM uint32_t SMBALERT   : 1;            /*!< [15..15] SMBus alert                                                      */
    } bit;
  } STAR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) Status register 2                                          */
    
