ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t MSL        : 1;            /*!< [0..0] Master/slave                                                       */
      __IM  uint32_t BUSY       : 1;            /*!< [1..1] Bus busy                                                           */
      __IM  uint32_t TRA        : 1;            /*!< [2..2] Transmitter/receiver                                               */
      __IM  uint32_t            : 1;
      __IM  uint32_t GENCALL    : 1;            /*!< [4..4] General call address (Slave mode)                                  */
      __IM  uint32_t SMBDEFAULT : 1;            /*!< [5..5] SMBus device default address (Slave mode)                          */
      __IM  uint32_t SMBHOST    : 1;            /*!< [6..6] SMBus host header (Slave mode)                                     */
      __IM  uint32_t DUALF      : 1;            /*!< [7..7] Dual flag (Slave mode)                                             */
      __IM  uint32_t PEC        : 8;            /*!< [15..8] acket error checking register                                     */
    } bit;
  } STAR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Clock control register                                     */
    
    struct {
      __IOM uint32_t CCR        : 12;           /*!< [11..0] Clock control register in Fast/Standard mode (Master
                                                     mode)                                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t DUTY       : 1;            /*!< [14..14] Fast mode duty cycle                                             */
      __IOM uint32_t F_S        : 1;            /*!< [15..15] I2C master mode selection                                        */
    } bit;
  } CKCFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Raise time register                                        */
    
    struct {
      __IOM uint32_t TRISE      : 6;            /*!< [5..0] Maximum rise time in Fast/Standard mode (Master mode)              */
    } bit;
  } RTR;
} I2C1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32_t CPHA       : 1;            /*!< [0..0] Clock phase                                                        */
      __IOM uint32_t CPOL       : 1;            /*!< [1..1] Clock polarity                                                     */
      __IOM uint32_t MSTR       : 1;            /*!< [2..2] Master selection                                                   */
      __IOM uint32_t BR         : 3;            /*!< [5..3] Baud rate control                                                  */
      __IOM uint32_t SPE        : 1;            /*!< [6..6] SPI enable                                                         */
      __IOM uint32_t LSBFIRST   : 1;            /*!< [7..7] Frame format                                                       */
      __IOM uint32_t SSI        : 1;            /*!< [8..8] Internal slave select                                              */
      __IOM uint32_t SSM        : 1;            /*!< [9..9] Software slave management                                          */
      __IOM uint32_t RXONLY     : 1;            /*!< [10..10] Receive only                                                     */
      __IOM uint32_t DFF        : 1;            /*!< [11..11] Data frame format                                                */
      __IOM uint32_t CRCNEXT    : 1;            /*!< [12..12] CRC transfer next                                                */
      __IOM uint32_t CRCEN      : 1;            /*!< [13..13] Hardware CRC calculation enable                                  */
      __IOM uint32_t BIDIOE     : 1;            /*!< [14..14] Output enable in bidirectional mode                              */
      __IOM uint32_t BIDIMODE   : 1;            /*!< [15..15] Bidirectional data mode enable                                   */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IOM uint32_t TXDMAEN    : 1;            /*!< [1..1] Tx buffer DMA enable                                               */
      __IOM uint32_t SSOE       : 1;            /*!< [2..2] SS output enable                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IOM uint32_t RXNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IOM uint32_t TXEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) status register                                            */
    
    struct {
      __IM  uint32_t RXNE       : 1;            /*!< [0..0] Receive buffer not empty                                           */
      __IM  uint32_t TXE        : 1;            /*!< [1..1] Transmit buffer empty                                              */
      __IM  uint32_t CHSID      : 1;            /*!< [2..2] Channel side                                                       */
      __IM  uint32_t UDR        : 1;            /*!< [3..3] Underrun flag                                                      */
      __IOM uint32_t CRCERR     : 1;            /*!< [4..4] CRC error flag                                                     */
      __IM  uint32_t MODF       : 1;            /*!< [5..5] Mode fault                                                         */
      __IM  uint32_t OVR        : 1;            /*!< [6..6] Overrun flag                                                       */
      __IM  uint32_t BSY        : 1;            /*!< [7..7] Busy flag                                                          */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) data register                                              */
    
