ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DATAR      : 16;           /*!< [15..0] Data register                                                     */
    } bit;
  } DATAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CRCR polynomial register                                   */
    
    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< [15..0] CRC polynomial register                                           */
    } bit;
  } CRCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) RX CRC register                                            */
    
    struct {
      __IM  uint32_t RXCRC      : 16;           /*!< [15..0] Rx CRC register                                                   */
    } bit;
  } RCRCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) TX CRC register                                            */
    
    struct {
      __IM  uint32_t TXCRC      : 16;           /*!< [15..0] Tx CRC register                                                   */
    } bit;
  } TCRCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) SPI_I2S configure register                                 */
    
    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IOM uint32_t DATLEN     : 2;            /*!< [2..1] DATLEN[1:0] bits (Data length to be transferred)                   */
      __IOM uint32_t CKPOL      : 1;            /*!< [3..3] steady state clock polarity                                        */
      __IOM uint32_t I2SSTD     : 2;            /*!< [5..4] I2SSTD[1:0] bits (I2S standard selection)                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t PCMSYNC    : 1;            /*!< [7..7] PCM frame synchronization                                          */
      __IOM uint32_t I2SCFG     : 2;            /*!< [9..8] I2SCFG[1:0] bits (I2S configuration mode)                          */
      __IOM uint32_t I2SE       : 1;            /*!< [10..10] I2S Enable                                                       */
      __IOM uint32_t I2SMOD     : 1;            /*!< [11..11] I2S mode selection                                               */
    } bit;
  } SPI_I2S_CFGR;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) high speed control register                                */
    
    struct {
      __IOM uint32_t HSRXEN     : 1;            /*!< [0..0] High speed mode read enable                                        */
    } bit;
  } HSCR;
} SPI1_Type;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI2                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40003800) SPI2 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) control register 1                                         */
    
    struct {
      __IOM uint32_t CPHA       : 1;            /*!< [0..0] Clock phase                                                        */
      __IOM uint32_t CPOL       : 1;            /*!< [1..1] Clock polarity                                                     */
      __IOM uint32_t MSTR       : 1;            /*!< [2..2] Master selection                                                   */
      __IOM uint32_t BR         : 3;            /*!< [5..3] Baud rate control                                                  */
      __IOM uint32_t SPE        : 1;            /*!< [6..6] SPI enable                                                         */
      __IOM uint32_t LSBFIRST   : 1;            /*!< [7..7] Frame format                                                       */
      __IOM uint32_t SSI        : 1;            /*!< [8..8] Internal slave select                                              */
      __IOM uint32_t SSM        : 1;            /*!< [9..9] Software slave management                                          */
      __IOM uint32_t RXONLY     : 1;            /*!< [10..10] Receive only                                                     */
      __IOM uint32_t DFF        : 1;            /*!< [11..11] Data frame format                                                */
      __IOM uint32_t CRCNEXT    : 1;            /*!< [12..12] CRC transfer next                                                */
      __IOM uint32_t CRCEN      : 1;            /*!< [13..13] Hardware CRC calculation enable                                  */
      __IOM uint32_t BIDIOE     : 1;            /*!< [14..14] Output enable in bidirectional mode                              */
      __IOM uint32_t BIDIMODE   : 1;            /*!< [15..15] Bidirectional data mode enable                                   */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 2                                         */
    
    struct {
      __IOM uint32_t RXDMAEN    : 1;            /*!< [0..0] Rx buffer DMA enable                                               */
      __IOM uint32_t TXDMAEN    : 1;            /*!< [1..1] Tx buffer DMA enable                                               */
      __IOM uint32_t SSOE       : 1;            /*!< [2..2] SS output enable                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t ERRIE      : 1;            /*!< [5..5] Error interrupt enable                                             */
      __IOM uint32_t RXNEIE     : 1;            /*!< [6..6] RX buffer not empty interrupt enable                               */
      __IOM uint32_t TXEIE      : 1;            /*!< [7..7] Tx buffer empty interrupt enable                                   */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) status register                                            */
    
