ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t RXNE       : 1;            /*!< [0..0] Receive buffer not empty                                           */
      __IM  uint32_t TXE        : 1;            /*!< [1..1] Transmit buffer empty                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t CRCERR     : 1;            /*!< [4..4] CRC error flag                                                     */
      __IM  uint32_t MODF       : 1;            /*!< [5..5] Mode fault                                                         */
      __IM  uint32_t OVR        : 1;            /*!< [6..6] Overrun flag                                                       */
      __IM  uint32_t BSY        : 1;            /*!< [7..7] Busy flag                                                          */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) data register                                              */
    
    struct {
      __IOM uint32_t DATAR      : 16;           /*!< [15..0] Data register                                                     */
    } bit;
  } DATAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) CRCR polynomial register                                   */
    
    struct {
      __IOM uint32_t CRCPOLY    : 16;           /*!< [15..0] CRC polynomial register                                           */
    } bit;
  } CRCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000014) RX CRC register                                            */
    
    struct {
      __IM  uint32_t RXCRC      : 16;           /*!< [15..0] Rx CRC register                                                   */
    } bit;
  } RCRCR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000018) TX CRC register                                            */
    
    struct {
      __IM  uint32_t TXCRC      : 16;           /*!< [15..0] Tx CRC register                                                   */
    } bit;
  } TCRCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) I2S configuration register                                 */
    
    struct {
      __IOM uint32_t CHLEN      : 1;            /*!< [0..0] Channel length (number of bits per audio channel)                  */
      __IOM uint32_t DATLEN     : 2;            /*!< [2..1] Data length to be transferred                                      */
      __IOM uint32_t CKPOL      : 1;            /*!< [3..3] Steady state clock polarity                                        */
      __IOM uint32_t I2SSTD     : 2;            /*!< [5..4] I2S standard selection                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t PCMSYNC    : 1;            /*!< [7..7] PCM frame synchronization                                          */
      __IOM uint32_t I2SCFG     : 2;            /*!< [9..8] I2S configuration mode                                             */
      __IOM uint32_t I2SE       : 1;            /*!< [10..10] I2S Enable                                                       */
      __IOM uint32_t I2SMOD     : 1;            /*!< [11..11] I2S mode selection                                               */
    } bit;
  } I2SCFGR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) I2S prescaler register                                     */
    
    struct {
      __IOM uint32_t I2SDIV     : 8;            /*!< [7..0] I2S Linear prescaler                                               */
      __IOM uint32_t ODD        : 1;            /*!< [8..8] Odd factor for the prescaler                                       */
      __IOM uint32_t MCKOE      : 1;            /*!< [9..9] Master clock output enable                                         */
    } bit;
  } I2SPR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) high speed control register                                */
    
    struct {
      __IOM uint32_t HSRXEN     : 1;            /*!< [0..0] High speed mode read enable                                        */
    } bit;
  } HSCR;
} SPI2_Type;                                    /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Status register                                            */
    
    struct {
      __IM  uint32_t PE         : 1;            /*!< [0..0] Parity error                                                       */
      __IM  uint32_t FE         : 1;            /*!< [1..1] Framing error                                                      */
      __IM  uint32_t NE         : 1;            /*!< [2..2] Noise error flag                                                   */
      __IM  uint32_t ORE        : 1;            /*!< [3..3] Overrun error                                                      */
      __IM  uint32_t IDLE       : 1;            /*!< [4..4] IDLE line detected                                                 */
      __IOM uint32_t RXNE       : 1;            /*!< [5..5] Read data register not empty                                       */
      __IOM uint32_t TC         : 1;            /*!< [6..6] Transmission complete                                              */
      __IM  uint32_t TXE        : 1;            /*!< [7..7] Transmit data register empty                                       */
      __IOM uint32_t LBD        : 1;            /*!< [8..8] LIN break detection flag                                           */
      __IOM uint32_t CTS        : 1;            /*!< [9..9] CTS flag                                                           */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Data register                                              */
    
