ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DR         : 9;            /*!< [8..0] Data value                                                         */
    } bit;
  } DATAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Baud rate register                                         */
    
    struct {
      __IOM uint32_t DIV_Fraction : 4;          /*!< [3..0] fraction of USARTDIV                                               */
      __IOM uint32_t DIV_Mantissa : 12;         /*!< [15..4] mantissa of USARTDIV                                              */
    } bit;
  } BRR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Control register 1                                         */
    
    struct {
      __IOM uint32_t SBK        : 1;            /*!< [0..0] Send break                                                         */
      __IOM uint32_t RWU        : 1;            /*!< [1..1] Receiver wakeup                                                    */
      __IOM uint32_t RE         : 1;            /*!< [2..2] Receiver enable                                                    */
      __IOM uint32_t TE         : 1;            /*!< [3..3] Transmitter enable                                                 */
      __IOM uint32_t IDLEIE     : 1;            /*!< [4..4] IDLE interrupt enable                                              */
      __IOM uint32_t RXNEIE     : 1;            /*!< [5..5] RXNE interrupt enable                                              */
      __IOM uint32_t TCIE       : 1;            /*!< [6..6] Transmission complete interrupt enable                             */
      __IOM uint32_t TXEIE      : 1;            /*!< [7..7] TXE interrupt enable                                               */
      __IOM uint32_t PEIE       : 1;            /*!< [8..8] PE interrupt enable                                                */
      __IOM uint32_t PS         : 1;            /*!< [9..9] Parity selection                                                   */
      __IOM uint32_t PCE        : 1;            /*!< [10..10] Parity control enable                                            */
      __IOM uint32_t WAKE       : 1;            /*!< [11..11] Wakeup method                                                    */
      __IOM uint32_t M          : 1;            /*!< [12..12] Word length                                                      */
      __IOM uint32_t UE         : 1;            /*!< [13..13] USART enable                                                     */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Control register 2                                         */
    
    struct {
      __IOM uint32_t ADD        : 4;            /*!< [3..0] Address of the USART node                                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBDL       : 1;            /*!< [5..5] lin break detection length                                         */
      __IOM uint32_t LBDIE      : 1;            /*!< [6..6] LIN break detection interrupt enable                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t LBCL       : 1;            /*!< [8..8] Last bit clock pulse                                               */
      __IOM uint32_t CPHA       : 1;            /*!< [9..9] Clock phase                                                        */
      __IOM uint32_t CPOL       : 1;            /*!< [10..10] Clock polarity                                                   */
      __IOM uint32_t CLKEN      : 1;            /*!< [11..11] Clock enable                                                     */
      __IOM uint32_t STOP       : 2;            /*!< [13..12] STOP bits                                                        */
      __IOM uint32_t LINEN      : 1;            /*!< [14..14] LIN mode enable                                                  */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Control register 3                                         */
    
    struct {
      __IOM uint32_t EIE        : 1;            /*!< [0..0] Error interrupt enable                                             */
      __IOM uint32_t IREN       : 1;            /*!< [1..1] IrDA mode enable                                                   */
      __IOM uint32_t IRLP       : 1;            /*!< [2..2] IrDA low-power                                                     */
      __IOM uint32_t HDSEL      : 1;            /*!< [3..3] Half-duplex selection                                              */
      __IOM uint32_t NACK       : 1;            /*!< [4..4] Smartcard NACK enable                                              */
      __IOM uint32_t SCEN       : 1;            /*!< [5..5] Smartcard mode enable                                              */
      __IOM uint32_t DMAR       : 1;            /*!< [6..6] DMA enable receiver                                                */
      __IOM uint32_t DMAT       : 1;            /*!< [7..7] DMA enable transmitter                                             */
      __IOM uint32_t RTSE       : 1;            /*!< [8..8] RTS enable                                                         */
      __IOM uint32_t CTSE       : 1;            /*!< [9..9] CTS enable                                                         */
      __IOM uint32_t CTSIE      : 1;            /*!< [10..10] CTS interrupt enable                                             */
    } bit;
  } CTLR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Guard time and prescaler register                          */
    
    struct {
      __IOM uint32_t PSC        : 8;            /*!< [7..0] Prescaler value                                                    */
      __IOM uint32_t GT         : 8;            /*!< [15..8] Guard time value                                                  */
    } bit;
  } GPR;
} USART1_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40012400) ADC1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) status register                                            */
    
