ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t AWD        : 1;            /*!< [0..0] Analog watchdog flag                                               */
      __IOM uint32_t EOC        : 1;            /*!< [1..1] Regular channel end of conversion                                  */
      __IOM uint32_t JEOC       : 1;            /*!< [2..2] Injected channel end of conversion                                 */
      __IOM uint32_t JSTRT      : 1;            /*!< [3..3] Injected channel start flag                                        */
      __IOM uint32_t STRT       : 1;            /*!< [4..4] Regular channel start flag                                         */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 1/TKEY_V_CTLR                             */
    
    struct {
      __IOM uint32_t AWDCH      : 5;            /*!< [4..0] Analog watchdog channel select bits                                */
      __IOM uint32_t EOCIE      : 1;            /*!< [5..5] Interrupt enable for EOC                                           */
      __IOM uint32_t AWDIE      : 1;            /*!< [6..6] Analog watchdog interrupt enable                                   */
      __IOM uint32_t JEOCIE     : 1;            /*!< [7..7] Interrupt enable for injected channels                             */
      __IOM uint32_t SCAN       : 1;            /*!< [8..8] Scan mode enable                                                   */
      __IOM uint32_t AWDSGL     : 1;            /*!< [9..9] Enable the watchdog on a single channel in scan mode               */
      __IOM uint32_t JAUTO      : 1;            /*!< [10..10] Automatic injected group conversion                              */
      __IOM uint32_t DISCEN     : 1;            /*!< [11..11] Discontinuous mode on regular channels                           */
      __IOM uint32_t JDISCEN    : 1;            /*!< [12..12] Discontinuous mode on injected channels                          */
      __IOM uint32_t DISCNUM    : 3;            /*!< [15..13] Discontinuous mode channel count                                 */
      __IOM uint32_t DUALMOD    : 4;            /*!< [19..16] Dual mode selection                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t JAWDEN     : 1;            /*!< [22..22] Analog watchdog enable on injected channels                      */
      __IOM uint32_t AWDEN      : 1;            /*!< [23..23] Analog watchdog enable on regular channels                       */
      __IOM uint32_t TKEYEN     : 1;            /*!< [24..24] TKEY enable, including TKEY_F and TKEY_V                         */
      __IOM uint32_t TKITUNE    : 1;            /*!< [25..25] TKEY_I enable                                                    */
      __IOM uint32_t BUFEN      : 1;            /*!< [26..26] TKEY_BUF_Enable                                                  */
      __IOM uint32_t PGA        : 2;            /*!< [28..27] ADC_PGA                                                          */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) control register 2                                         */
    
    struct {
      __IOM uint32_t ADON       : 1;            /*!< [0..0] A/D converter ON / OFF                                             */
      __IOM uint32_t CONT       : 1;            /*!< [1..1] Continuous conversion                                              */
      __IOM uint32_t CAL        : 1;            /*!< [2..2] A/D calibration                                                    */
      __IOM uint32_t RSTCAL     : 1;            /*!< [3..3] Reset calibration                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t DMA        : 1;            /*!< [8..8] Direct memory access mode                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t ALIGN      : 1;            /*!< [11..11] Data alignment                                                   */
      __IOM uint32_t JEXTSEL    : 3;            /*!< [14..12] External event select for injected group                         */
      __IOM uint32_t JEXTTRIG   : 1;            /*!< [15..15] External trigger conversion mode for injected channels           */
      __IM  uint32_t            : 1;
      __IOM uint32_t EXTSEL     : 3;            /*!< [19..17] External event select for regular group                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [20..20] External trigger conversion mode for regular channels            */
      __IOM uint32_t JSWSTART   : 1;            /*!< [21..21] Start conversion of injected channels                            */
      __IOM uint32_t SWSTART    : 1;            /*!< [22..22] Start conversion of regular channels                             */
      __IOM uint32_t TSVREFE    : 1;            /*!< [23..23] Temperature sensor and VREFINT enable                            */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) sample time register 1                                     */
    
    struct {
      __IOM uint32_t SMP10_TKCG10 : 3;          /*!< [2..0] Channel 10 sample time selection                                   */
      __IOM uint32_t SMP11_TKCG11 : 3;          /*!< [5..3] Channel 11 sample time selection                                   */
      __IOM uint32_t SMP12_TKCG12 : 3;          /*!< [8..6] Channel 12 sample time selection                                   */
      __IOM uint32_t SMP13_TKCG13 : 3;          /*!< [11..9] Channel 13 sample time selection                                  */
      __IOM uint32_t SMP14_TKCG14 : 3;          /*!< [14..12] Channel 14 sample time selection                                 */
      __IOM uint32_t SMP15_TKCG15 : 3;          /*!< [17..15] Channel 15 sample time selection                                 */
      __IOM uint32_t SMP16_TKCG16 : 3;          /*!< [20..18] Channel 16 sample time selection                                 */
      __IOM uint32_t SMP17_TKCG17 : 3;          /*!< [23..21] Channel 17 sample time selection                                 */
    } bit;
  } SAMPTR1_CHARGE1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) sample time register 2                                     */
    
