ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t SMP0_TKCG0 : 3;            /*!< [2..0] Channel 0 sample time selection                                    */
      __IOM uint32_t SMP1_TKCG1 : 3;            /*!< [5..3] Channel 1 sample time selection                                    */
      __IOM uint32_t SMP2_TKCG2 : 3;            /*!< [8..6] Channel 2 sample time selection                                    */
      __IOM uint32_t SMP3_TKCG3 : 3;            /*!< [11..9] Channel 3 sample time selection                                   */
      __IOM uint32_t SMP4_TKCG4 : 3;            /*!< [14..12] Channel 4 sample time selection                                  */
      __IOM uint32_t SMP5_TKCG5 : 3;            /*!< [17..15] Channel 5 sample time selection                                  */
      __IOM uint32_t SMP6_TKCG6 : 3;            /*!< [20..18] Channel 6 sample time selection                                  */
      __IOM uint32_t SMP7_TKCG7 : 3;            /*!< [23..21] Channel 7 sample time selection                                  */
      __IOM uint32_t SMP8_TKCG8 : 3;            /*!< [26..24] Channel 8 sample time selection                                  */
      __IOM uint32_t SMP9_TKCG9 : 3;            /*!< [29..27] Channel 9 sample time selection                                  */
    } bit;
  } SAMPTR2_CHARGE2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET1   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET2   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET3   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET4   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) watchdog higher threshold register                         */
    
    struct {
      __IOM uint32_t HT         : 12;           /*!< [11..0] Analog watchdog higher threshold                                  */
    } bit;
  } WDHTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) watchdog lower threshold register                          */
    
    struct {
      __IOM uint32_t LT         : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
    } bit;
  } WDLTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) regular sequence register 1                                */
    
    struct {
      __IOM uint32_t SQ13       : 5;            /*!< [4..0] 13th conversion in regular sequence                                */
      __IOM uint32_t SQ14       : 5;            /*!< [9..5] 14th conversion in regular sequence                                */
      __IOM uint32_t SQ15       : 5;            /*!< [14..10] 15th conversion in regular sequence                              */
      __IOM uint32_t SQ16       : 5;            /*!< [19..15] 16th conversion in regular sequence                              */
      __IOM uint32_t L          : 4;            /*!< [23..20] Regular channel sequence length                                  */
    } bit;
  } RSQR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) regular sequence register 2                                */
    
    struct {
      __IOM uint32_t SQ7        : 5;            /*!< [4..0] 7th conversion in regular sequence                                 */
      __IOM uint32_t SQ8        : 5;            /*!< [9..5] 8th conversion in regular sequence                                 */
      __IOM uint32_t SQ9        : 5;            /*!< [14..10] 9th conversion in regular sequence                               */
      __IOM uint32_t SQ10       : 5;            /*!< [19..15] 10th conversion in regular sequence                              */
      __IOM uint32_t SQ11       : 5;            /*!< [24..20] 11th conversion in regular sequence                              */
      __IOM uint32_t SQ12       : 5;            /*!< [29..25] 12th conversion in regular sequence                              */
    } bit;
  } RSQR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) regular sequence register 3;TKEY_V_CHANNEL                 */
    
    struct {
      __IOM uint32_t SQ1__CHSEL : 5;            /*!< [4..0] 1st conversion in regular sequence;TKDY_V channel select           */
      __IOM uint32_t SQ2        : 5;            /*!< [9..5] 2nd conversion in regular sequence                                 */
      __IOM uint32_t SQ3        : 5;            /*!< [14..10] 3rd conversion in regular sequence                               */
      __IOM uint32_t SQ4        : 5;            /*!< [19..15] 4th conversion in regular sequence                               */
      __IOM uint32_t SQ5        : 5;            /*!< [24..20] 5th conversion in regular sequence                               */
      __IOM uint32_t SQ6        : 5;            /*!< [29..25] 6th conversion in regular sequence                               */
    } bit;
  } RSQR3__CHANNEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) injected sequence register                                 */
    
