ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t JSQ1       : 5;            /*!< [4..0] 1st conversion in injected sequence                                */
      __IOM uint32_t JSQ2       : 5;            /*!< [9..5] 2nd conversion in injected sequence                                */
      __IOM uint32_t JSQ3       : 5;            /*!< [14..10] 3rd conversion in injected sequence                              */
      __IOM uint32_t JSQ4       : 5;            /*!< [19..15] 4th conversion in injected sequence                              */
      __IOM uint32_t JL         : 2;            /*!< [21..20] Injected sequence length                                         */
    } bit;
  } ISQR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) injected data register x_Charge data offset for
                                                                    injected channel x                                         */
    
    struct {
      __IM  uint32_t IDATA0_7_TKCGOFFSET : 8;   /*!< [7..0] Injected data_Touch key charge data offset for injected
                                                     channel x                                                                 */
      __IM  uint32_t IDATA8_15  : 8;            /*!< [15..8] Injected data                                                     */
    } bit;
  } IDATAR1_CHGOFFSET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) regular data register_start and discharge time
                                                                    register                                                   */
    
    struct {
      __IOM uint32_t DATA0_7_TKACT_DCG : 8;     /*!< [7..0] Regular data_Touch key start and discharge time register           */
      __IOM uint32_t DATA8_15   : 8;            /*!< [15..8] Regular data                                                      */
    } bit;
  } RDATAR_DR_ACT_DCG;
} ADC1_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40012800) ADC2 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) status register                                            */
    
    struct {
      __IOM uint32_t AWD        : 1;            /*!< [0..0] Analog watchdog flag                                               */
      __IOM uint32_t EOC        : 1;            /*!< [1..1] Regular channel end of conversion                                  */
      __IOM uint32_t JEOC       : 1;            /*!< [2..2] Injected channel end of conversion                                 */
      __IOM uint32_t JSTRT      : 1;            /*!< [3..3] Injected channel start flag                                        */
      __IOM uint32_t STRT       : 1;            /*!< [4..4] Regular channel start flag                                         */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) control register 1/TKEY_V_CTLR                             */
    
    struct {
      __IOM uint32_t AWDCH      : 5;            /*!< [4..0] Analog watchdog channel select bits                                */
      __IOM uint32_t EOCIE      : 1;            /*!< [5..5] Interrupt enable for EOC                                           */
      __IOM uint32_t AWDIE      : 1;            /*!< [6..6] Analog watchdog interrupt enable                                   */
      __IOM uint32_t JEOCIE     : 1;            /*!< [7..7] Interrupt enable for injected channels                             */
      __IOM uint32_t SCAN       : 1;            /*!< [8..8] Scan mode enable                                                   */
      __IOM uint32_t AWDSGL     : 1;            /*!< [9..9] Enable the watchdog on a single channel in scan mode               */
      __IOM uint32_t JAUTO      : 1;            /*!< [10..10] Automatic injected group conversion                              */
      __IOM uint32_t DISCEN     : 1;            /*!< [11..11] Discontinuous mode on regular channels                           */
      __IOM uint32_t JDISCEN    : 1;            /*!< [12..12] Discontinuous mode on injected channels                          */
      __IOM uint32_t DISCNUM    : 3;            /*!< [15..13] Discontinuous mode channel count                                 */
      __IOM uint32_t DUALMOD    : 4;            /*!< [19..16] Dual mode selection                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t JAWDEN     : 1;            /*!< [22..22] Analog watchdog enable on injected channels                      */
      __IOM uint32_t AWDEN      : 1;            /*!< [23..23] Analog watchdog enable on regular channels                       */
      __IOM uint32_t TKEYEN     : 1;            /*!< [24..24] TKEY enable, including TKEY_F and TKEY_V                         */
      __IOM uint32_t TKITUNE    : 1;            /*!< [25..25] TKEY_I enable                                                    */
      __IOM uint32_t BUFEN      : 1;            /*!< [26..26] TKEY_BUF_Enable                                                  */
      __IOM uint32_t PGA        : 2;            /*!< [28..27] ADC_PGA                                                          */
    } bit;
  } CTLR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) control register 2                                         */
    
