ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t ADON       : 1;            /*!< [0..0] A/D converter ON / OFF                                             */
      __IOM uint32_t CONT       : 1;            /*!< [1..1] Continuous conversion                                              */
      __IOM uint32_t CAL        : 1;            /*!< [2..2] A/D calibration                                                    */
      __IOM uint32_t RSTCAL     : 1;            /*!< [3..3] Reset calibration                                                  */
      __IM  uint32_t            : 4;
      __IOM uint32_t DMA        : 1;            /*!< [8..8] Direct memory access mode                                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t ALIGN      : 1;            /*!< [11..11] Data alignment                                                   */
      __IOM uint32_t JEXTSEL    : 3;            /*!< [14..12] External event select for injected group                         */
      __IOM uint32_t JEXTTRIG   : 1;            /*!< [15..15] External trigger conversion mode for injected channels           */
      __IM  uint32_t            : 1;
      __IOM uint32_t EXTSEL     : 3;            /*!< [19..17] External event select for regular group                          */
      __IOM uint32_t EXTTRIG    : 1;            /*!< [20..20] External trigger conversion mode for regular channels            */
      __IOM uint32_t JSWSTART   : 1;            /*!< [21..21] Start conversion of injected channels                            */
      __IOM uint32_t SWSTART    : 1;            /*!< [22..22] Start conversion of regular channels                             */
      __IOM uint32_t TSVREFE    : 1;            /*!< [23..23] Temperature sensor and VREFINT enable                            */
    } bit;
  } CTLR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) sample time register 1                                     */
    
    struct {
      __IOM uint32_t SMP10_TKCG10 : 3;          /*!< [2..0] Channel 10 sample time selection                                   */
      __IOM uint32_t SMP11_TKCG11 : 3;          /*!< [5..3] Channel 11 sample time selection                                   */
      __IOM uint32_t SMP12_TKCG12 : 3;          /*!< [8..6] Channel 12 sample time selection                                   */
      __IOM uint32_t SMP13_TKCG13 : 3;          /*!< [11..9] Channel 13 sample time selection                                  */
      __IOM uint32_t SMP14_TKCG14 : 3;          /*!< [14..12] Channel 14 sample time selection                                 */
      __IOM uint32_t SMP15_TKCG15 : 3;          /*!< [17..15] Channel 15 sample time selection                                 */
      __IOM uint32_t SMP16_TKCG16 : 3;          /*!< [20..18] Channel 16 sample time selection                                 */
      __IOM uint32_t SMP17_TKCG17 : 3;          /*!< [23..21] Channel 17 sample time selection                                 */
    } bit;
  } SAMPTR1_CHARGE1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) sample time register 2                                     */
    
    struct {
      __IOM uint32_t SMP0_TKCG0 : 3;            /*!< [2..0] Channel 0 sample time selection                                    */
      __IOM uint32_t SMP1_TKCG1 : 3;            /*!< [5..3] Channel 1 sample time selection                                    */
      __IOM uint32_t SMP2_TKCG2 : 3;            /*!< [8..6] Channel 2 sample time selection                                    */
      __IOM uint32_t SMP3_TKCG3 : 3;            /*!< [11..9] Channel 3 sample time selection                                   */
      __IOM uint32_t SMP4_TKCG4 : 3;            /*!< [14..12] Channel 4 sample time selection                                  */
      __IOM uint32_t SMP5_TKCG5 : 3;            /*!< [17..15] Channel 5 sample time selection                                  */
      __IOM uint32_t SMP6_TKCG6 : 3;            /*!< [20..18] Channel 6 sample time selection                                  */
      __IOM uint32_t SMP7_TKCG7 : 3;            /*!< [23..21] Channel 7 sample time selection                                  */
      __IOM uint32_t SMP8_TKCG8 : 3;            /*!< [26..24] Channel 8 sample time selection                                  */
      __IOM uint32_t SMP9_TKCG9 : 3;            /*!< [29..27] Channel 9 sample time selection                                  */
    } bit;
  } SAMPTR2_CHARGE2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET1   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET2   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET3   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) injected channel data offset register x                    */
    
    struct {
      __IOM uint32_t JOFFSET4   : 12;           /*!< [11..0] Data offset for injected channel x                                */
    } bit;
  } IOFR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) watchdog higher threshold register                         */
    
    struct {
      __IOM uint32_t HT         : 12;           /*!< [11..0] Analog watchdog higher threshold                                  */
    } bit;
  } WDHTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) watchdog lower threshold register                          */
    
