ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t LT         : 12;           /*!< [11..0] Analog watchdog lower threshold                                   */
    } bit;
  } WDLTR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) regular sequence register 1                                */
    
    struct {
      __IOM uint32_t SQ13       : 5;            /*!< [4..0] 13th conversion in regular sequence                                */
      __IOM uint32_t SQ14       : 5;            /*!< [9..5] 14th conversion in regular sequence                                */
      __IOM uint32_t SQ15       : 5;            /*!< [14..10] 15th conversion in regular sequence                              */
      __IOM uint32_t SQ16       : 5;            /*!< [19..15] 16th conversion in regular sequence                              */
      __IOM uint32_t L          : 4;            /*!< [23..20] Regular channel sequence length                                  */
    } bit;
  } RSQR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) regular sequence register 2                                */
    
    struct {
      __IOM uint32_t SQ7        : 5;            /*!< [4..0] 7th conversion in regular sequence                                 */
      __IOM uint32_t SQ8        : 5;            /*!< [9..5] 8th conversion in regular sequence                                 */
      __IOM uint32_t SQ9        : 5;            /*!< [14..10] 9th conversion in regular sequence                               */
      __IOM uint32_t SQ10       : 5;            /*!< [19..15] 10th conversion in regular sequence                              */
      __IOM uint32_t SQ11       : 5;            /*!< [24..20] 11th conversion in regular sequence                              */
      __IOM uint32_t SQ12       : 5;            /*!< [29..25] 12th conversion in regular sequence                              */
    } bit;
  } RSQR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) regular sequence register 3;TKEY_V_CHANNEL                 */
    
    struct {
      __IOM uint32_t SQ1__CHSEL : 5;            /*!< [4..0] 1st conversion in regular sequence;TKDY_V channel select           */
      __IOM uint32_t SQ2        : 5;            /*!< [9..5] 2nd conversion in regular sequence                                 */
      __IOM uint32_t SQ3        : 5;            /*!< [14..10] 3rd conversion in regular sequence                               */
      __IOM uint32_t SQ4        : 5;            /*!< [19..15] 4th conversion in regular sequence                               */
      __IOM uint32_t SQ5        : 5;            /*!< [24..20] 5th conversion in regular sequence                               */
      __IOM uint32_t SQ6        : 5;            /*!< [29..25] 6th conversion in regular sequence                               */
    } bit;
  } RSQR3__CHANNEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) injected sequence register                                 */
    
    struct {
      __IOM uint32_t JSQ1       : 5;            /*!< [4..0] 1st conversion in injected sequence                                */
      __IOM uint32_t JSQ2       : 5;            /*!< [9..5] 2nd conversion in injected sequence                                */
      __IOM uint32_t JSQ3       : 5;            /*!< [14..10] 3rd conversion in injected sequence                              */
      __IOM uint32_t JSQ4       : 5;            /*!< [19..15] 4th conversion in injected sequence                              */
      __IOM uint32_t JL         : 2;            /*!< [21..20] Injected sequence length                                         */
    } bit;
  } ISQR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000003C) injected data register x_Charge data offset for
                                                                    injected channel x                                         */
    
    struct {
      __IM  uint32_t IDATA0_7_TKCGOFFSET : 8;   /*!< [7..0] Injected data_Touch key charge data offset for injected
                                                     channel x                                                                 */
      __IM  uint32_t IDATA8_15  : 8;            /*!< [15..8] Injected data                                                     */
    } bit;
  } IDATAR1_CHGOFFSET;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000040) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000044) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000048) injected data register x                                   */
    
    struct {
      __IM  uint32_t JDATA      : 16;           /*!< [15..0] Injected data                                                     */
    } bit;
  } IDATAR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) regular data register_start and discharge time
                                                                    register                                                   */
    
    struct {
      __IOM uint32_t DATA0_7_TKACT_DCG : 8;     /*!< [7..0] Regular data_Touch key start and discharge time register           */
      __IOM uint32_t DATA8_15   : 8;            /*!< [15..8] Regular data                                                      */
    } bit;
  } RDATAR_DR_ACT_DCG;
} ADC2_Type;                                    /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0xE000D000) DBG Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) DBGMCU_CFGR1                                               */
    
