ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint32_t DEG_IWDG   : 1;            /*!< [0..0] DEG_IWDG                                                           */
      __IOM uint32_t DEG_WWDG   : 1;            /*!< [1..1] DEG_WWDG                                                           */
      __IOM uint32_t DEG_I2C1   : 1;            /*!< [2..2] DEG_I2C1                                                           */
      __IOM uint32_t DEG_I2C2   : 1;            /*!< [3..3] DEG_I2C2                                                           */
      __IOM uint32_t DEG_TIM1   : 1;            /*!< [4..4] DEG_TIM1                                                           */
      __IOM uint32_t DEG_TIM2   : 1;            /*!< [5..5] DEG_TIM2                                                           */
      __IOM uint32_t DEG_TIM3   : 1;            /*!< [6..6] DEG_TIM3                                                           */
      __IOM uint32_t DEG_TIM4   : 1;            /*!< [7..7] DEG_TIM4                                                           */
    } bit;
  } CFGR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) DBGMCU_CFGR2                                               */
    
    struct {
      __IOM uint32_t DBG_SLEEP  : 1;            /*!< [0..0] DBG_SLEEP                                                          */
      __IOM uint32_t DBG_STOP   : 1;            /*!< [1..1] DBG_STOP                                                           */
      __IOM uint32_t DBG_STANDBY : 1;           /*!< [2..2] DBG_STANDBY                                                        */
    } bit;
  } CFGR2;
} DBG_Type;                                     /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                           USBHD                                           ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40023400) USBHD Structure                                            */
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000000) USB base control                                           */
    
    struct {
      __IOM uint8_t RB_UC_DMA_EN : 1;           /*!< [0..0] DMA enable and DMA interrupt enable for USB                        */
      __IOM uint8_t RB_UC_CLR_ALL : 1;          /*!< [1..1] force clear FIFO and count of USB                                  */
      __IOM uint8_t RB_UC_RESET_SIE : 1;        /*!< [2..2] force reset USB SIE, need software clear                           */
      __IOM uint8_t RB_UC_INT_BUSY : 1;         /*!< [3..3] enable automatic responding busy for device mode or automatic
                                                     pause for host mode during interrupt flag UIF_TRANSFER
                                                     valid                                                                     */
      __IOM uint8_t RB_UC_DEV_PU_EN : 1;        /*!< [4..4] USB device enable and internal pullup resistance enable            */
      __IOM uint8_t RB_UC_SPEED_TYPE : 2;       /*!< [6..5] enable USB low speed: 00=full speed, 01=high speed, 10
                                                     =low speed                                                                */
      __IOM uint8_t RB_UC_HOST_MODE : 1;        /*!< [7..7] enable USB host mode: 0=device mode, 1=host mode                   */
    } bit;
  } USB_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000001) USB HOST control                                           */
    
    struct {
      __IOM uint8_t bUH_TX_BUS_RESET : 1;       /*!< [0..0] USB host bus reset status                                          */
      __IOM uint8_t bUH_TX_BUS_SUSPEND : 1;     /*!< [1..1] the host sends hang sigal                                          */
      __IOM uint8_t bUH_TX_BUS_RESUME : 1;      /*!< [2..2] host wake up device                                                */
      __IOM uint8_t bUH_REMOTE_WKUP : 1;        /*!< [3..3] the remoke wake-up                                                 */
      __IOM uint8_t bUH_PHY_SUSPENDM : 1;       /*!< [4..4] USB-PHY thesuspended state the internal USB-PLL is turned
                                                     off                                                                       */
      __IM  uint8_t             : 1;
      __IM  uint8_t bUH_SOF_FREE : 1;           /*!< [6..6] the bus is idle                                                    */
      __IOM uint8_t bUH_SOF_EN  : 1;            /*!< [7..7] automatically generate the SOF packet enabling control
                                                     bit                                                                       */
    } bit;
  } UHOST_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000002) USB interrupt enable                                       */
    
    struct {
      __IOM uint8_t RB_UIE_BUS_RST__RB_UIE_DETECT : 1;/*!< [0..0] enable interrupt for USB bus reset event for USB device
                                                     mode;enable interrupt for USB device detected event for
                                                     USB host mode                                                             */
      __IOM uint8_t RB_UIE_TRANSFER : 1;        /*!< [1..1] enable interrupt for USB transfer completion                       */
      __IOM uint8_t RB_UIE_SUSPEND : 1;         /*!< [2..2] enable interrupt for USB suspend or resume event                   */
      __IOM uint8_t RB_UIE_SOF_ACT : 1;         /*!< [3..3] indicate host SOF timer action status for USB host                 */
      __IOM uint8_t RB_UIE_FIFO_OV : 1;         /*!< [4..4] enable interrupt for FIFO overflow                                 */
      __IOM uint8_t RB_UIE_SETUP_ACT : 1;       /*!< [5..5] indicate host SETUP timer action status for USB host               */
      __IOM uint8_t RB_UIE_ISO_ACT : 1;         /*!< [6..6] enable interrupt for NAK responded for USB device mode             */
      __IOM uint8_t RB_UIE_DEV_NAK : 1;         /*!< [7..7] enable interrupt for NAK responded for USB device mode             */
    } bit;
  } USB_INT_EN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000003) USB device address                                         */
    
