ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_USB_ADDR : 7;          /*!< [6..0] bit mask for USB device address                                    */
      __IOM uint8_t RB_UDA_GP_BIT : 1;          /*!< [7..7] general purpose bit                                                */
    } bit;
  } USB_DEV_AD;
  
  union {
    __IM  uint16_t reg;                         /*!< (@ 0x00000004) USB_FRAME_NO                                               */
    
    struct {
      __IM  uint16_t USB_FRAME_NO : 16;         /*!< [15..0] USB_FRAME_NO                                                      */
    } bit;
  } USB_FRAME_NO;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000006) indicate USB suspend status                                */
    
    struct {
      __IOM uint8_t USB_SYS_MOD : 2;            /*!< [1..0] USB_SYS_MOD                                                        */
      __IOM uint8_t USB_WAKEUP  : 1;            /*!< [2..2] remote resume                                                      */
      __IM  uint8_t             : 1;
      __IOM uint8_t USB_LINESTATE : 2;          /*!< [5..4] USB_LINESTATE                                                      */
    } bit;
  } USB_USB_SUSPEND;
  __IM  uint8_t   RESERVED;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x00000008) USB_SPEED_TYPE                                             */
    
    struct {
      __IM  uint8_t USB_SPEED_TYPE : 2;         /*!< [1..0] USB_SPEED_TYPE                                                     */
    } bit;
  } USB_SPEED_TYPE;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x00000009) USB miscellaneous status                                   */
    
    struct {
      __IM  uint8_t RB_UMS_SPLIT_CAN : 1;       /*!< [0..0] RO, indicate device attached status on USB host                    */
      __IM  uint8_t RB_UMS_ATTACH : 1;          /*!< [1..1] RO, indicate UDM level saved at device attached to USB
                                                     host                                                                      */
      __IM  uint8_t RB_UMS_SUSPEND : 1;         /*!< [2..2] RO, indicate USB suspend status                                    */
      __IM  uint8_t RB_UMS_BUS_RESET : 1;       /*!< [3..3] RO, indicate USB bus reset status                                  */
      __IM  uint8_t RB_UMS_R_FIFO_RDY : 1;      /*!< [4..4] RO, indicate USB receiving FIFO ready status (not empty)           */
      __IM  uint8_t RB_UMS_SIE_FREE : 1;        /*!< [5..5] RO, indicate USB SIE free status                                   */
      __IM  uint8_t RB_UMS_SOF_ACT : 1;         /*!< [6..6] RO, indicate host SOF timer action status for USB host             */
      __IM  uint8_t RB_UMS_SOF_PRES : 1;        /*!< [7..7] RO, indicate host SOF timer presage status                         */
    } bit;
  } USB_MIS_ST;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000000A) USB interrupt flag                                         */
    
    struct {
      __IOM uint8_t RB_UIF_BUS_RST : 1;         /*!< [0..0] RB_UIF_BUS_RST                                                     */
      __IOM uint8_t RB_UIF_TRANSFER : 1;        /*!< [1..1] USB transfer completion interrupt flag, direct bit address
                                                     clear or write 1 to clear                                                 */
      __IOM uint8_t RB_UIF_SUSPEND : 1;         /*!< [2..2] USB suspend or resume event interrupt flag, direct bit
                                                     address clear or write 1 to clear                                         */
      __IOM uint8_t RB_UIF_HST_SOF : 1;         /*!< [3..3] host SOF timer interrupt flag for USB host, direct bit
                                                     address clear or write 1 to clear                                         */
      __IOM uint8_t RB_UIF_FIFO_OV : 1;         /*!< [4..4] FIFO overflow interrupt flag for USB, direct bit address
                                                     clear or write 1 to clear                                                 */
      __IM  uint8_t RB_U_SETUP_ACT : 1;         /*!< [5..5] USB_SETUP_ACT                                                      */
      __IM  uint8_t UIF_ISO_ACT : 1;            /*!< [6..6] UIF_ISO_ACT                                                        */
      __IM  uint8_t RB_U_IS_NAK : 1;            /*!< [7..7] RO, indicate current USB transfer is NAK received                  */
    } bit;
  } USB_INT_FG;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x0000000B) USB interrupt status                                       */
    
    struct {
      __IM  uint8_t MASK_UIS_H_RES__MASK_UIS_ENDP : 4;/*!< [3..0] RO, bit mask of current transfer handshake response for
                                                     USB host mode: 0000=no response, time out from device,
                                                     others=handshake response PID received;RO, bit mask of
                                                     current transfer endpoint number for USB device mode                      */
      __IM  uint8_t MASK_UIS_TOKEN : 2;         /*!< [5..4] RO, bit mask of current token PID code received for USB
                                                     device mode                                                               */
      __IM  uint8_t RB_UIS_TOG_OK : 1;          /*!< [6..6] RO, indicate current USB transfer toggle is OK                     */
      __IM  uint8_t RB_UIS_IS_NAK : 1;          /*!< [7..7] RO, indicate current USB transfer is NAK received for
                                                     USB device mode                                                           */
    } bit;
  } USB_INT_ST;
  
  union {
    __IM  uint16_t reg;                         /*!< (@ 0x0000000C) USB receiving length                                       */
    
