ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint16_t R16_USB_RX_LEN : 16;       /*!< [15..0] length of received bytes                                          */
    } bit;
  } USB_RX_LEN;
  __IM  uint16_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) USB endpoint configuration                                 */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t bUEP_T_EN_bUH_TX_EN : 15;  /*!< [15..1] endpoint TX enable/bUH_TX_EN                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t bUEP_R_EN__UH_EP_MOD : 15; /*!< [31..17] endpoint RX enable/bUH_TX_EN                                     */
    } bit;
  } UEP_CONFIG;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) USB endpoint type                                          */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t bUEP_T_TYPE : 15;          /*!< [15..1] endpoint TX type                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t bUEP_R_TYPE : 15;          /*!< [31..17] endpoint RX type                                                 */
    } bit;
  } UEP_TYPE;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) USB endpoint buffer mode                                   */
    
    struct {
      __IOM uint32_t bUEP_BUF_MOD : 16;         /*!< [15..0] buffer mode of USB endpoint                                       */
      __IOM uint32_t bUEP_ISO_BUF_MOD : 16;     /*!< [31..16] buffer mode of USB endpoint                                      */
    } bit;
  } UEP_BUF_MOD;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001C) B endpoint 0 DMA buffer address                            */
    
    struct {
      __IOM uint16_t UEP0_DMA   : 16;           /*!< [15..0] endpoint 0 DMA buffer address                                     */
    } bit;
  } UEP0_DMA;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000020) endpoint 1 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP1_RX_DMA : 16;          /*!< [15..0] endpoint 1 DMA buffer address                                     */
    } bit;
  } UEP1_RX_DMA;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000024) endpoint 2 DMA RX buffer address/UH_RX_DMA                 */
    
    struct {
      __IOM uint16_t UEP2_RX_DMA__UH_RX_DMA : 16;/*!< [15..0] endpoint 2 DMA buffer address                                    */
    } bit;
  } UEP2_RX_DMA__UH_RX_DMA;
  __IM  uint16_t  RESERVED4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000028) endpoint 3 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP3_RX_DMA : 16;          /*!< [15..0] endpoint 3 DMA buffer address                                     */
    } bit;
  } UEP3_RX_DMA;
  __IM  uint16_t  RESERVED5;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000002C) endpoint 4 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP4_RX_DMA : 16;          /*!< [15..0] endpoint 4 DMA buffer address                                     */
    } bit;
  } UEP4_RX_DMA;
  __IM  uint16_t  RESERVED6;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000030) endpoint 5 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP5_DMA   : 16;           /*!< [15..0] endpoint 5 DMA buffer address                                     */
    } bit;
  } UEP5_RX_DMA;
  __IM  uint16_t  RESERVED7;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000034) endpoint 6 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP6_RX_DMA : 16;          /*!< [15..0] endpoint 6 DMA buffer address                                     */
    } bit;
  } UEP6_RX_DMA;
  __IM  uint16_t  RESERVED8;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000038) endpoint 7 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP7_RX_DMA : 16;          /*!< [15..0] endpoint 7 DMA buffer address                                     */
    } bit;
  } UEP7_RX_DMA;
  __IM  uint16_t  RESERVED9;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000003C) endpoint 8 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP8_RX_DMA : 16;          /*!< [15..0] endpoint 8 DMA buffer address                                     */
    } bit;
  } UEP8_RX_DMA;
  __IM  uint16_t  RESERVED10;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000040) endpoint 9 DMA RX buffer address                           */
    
    struct {
      __IOM uint16_t UEP9_RX_DMA : 16;          /*!< [15..0] endpoint 9 DMA buffer address                                     */
    } bit;
  } UEP9_RX_DMA;
  __IM  uint16_t  RESERVED11;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000044) endpoint 10 DMA RX buffer address                          */
    
    struct {
      __IOM uint16_t UEP10_RX_DMA : 16;         /*!< [15..0] endpoint 10 DMA buffer address                                    */
    } bit;
  } UEP10_RX_DMA;
  __IM  uint16_t  RESERVED12;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000048) endpoint 11 DMA RX buffer address                          */
    
    struct {
      __IOM uint16_t UEP11_RX_DMA : 16;         /*!< [15..0] endpoint 11 DMA buffer address                                    */
    } bit;
  } UEP11_RX_DMA;
  __IM  uint16_t  RESERVED13;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000004C) endpoint 12 DMA RX buffer address                          */
    
