ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint16_t UEP12_RX_DMA : 16;         /*!< [15..0] endpoint 12 DMA buffer address                                    */
    } bit;
  } UEP12_RX_DMA;
  __IM  uint16_t  RESERVED14;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000050) endpoint 13 DMA RX buffer address                          */
    
    struct {
      __IOM uint16_t UEP13_RX_DMA : 16;         /*!< [15..0] endpoint 13 DMA buffer address                                    */
    } bit;
  } UEP13_RX_DMA;
  __IM  uint16_t  RESERVED15;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000054) endpoint 14 DMA RX buffer address                          */
    
    struct {
      __IOM uint16_t UEP14_RX_DMA : 16;         /*!< [15..0] endpoint 14 DMA buffer address                                    */
    } bit;
  } UEP14_RX_DMA;
  __IM  uint16_t  RESERVED16;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000058) endpoint 15 DMA RX buffer address                          */
    
    struct {
      __IOM uint16_t UEP15_RX_DMA : 16;         /*!< [15..0] endpoint 15 DMA buffer address                                    */
    } bit;
  } UEP15_RX_DMA;
  __IM  uint16_t  RESERVED17;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000005C) endpoint 1 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP1_TX_DMA : 16;          /*!< [15..0] endpoint 1 DMA buffer address                                     */
    } bit;
  } UEP1_TX_DMA;
  __IM  uint16_t  RESERVED18;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000060) endpoint 2 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP2_TX_DMA : 16;          /*!< [15..0] endpoint 2 DMA buffer address                                     */
    } bit;
  } UEP2_TX_DMA;
  __IM  uint16_t  RESERVED19;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000064) endpoint 3 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP3_TX_DMA__UH_TX_DMA : 16;/*!< [15..0] endpoint 3 DMA buffer address                                    */
    } bit;
  } UEP3_TX_DMA__UH_TX_DMA;
  __IM  uint16_t  RESERVED20;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000068) endpoint 4 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP4_TX_DMA : 16;          /*!< [15..0] endpoint 4 DMA buffer address                                     */
    } bit;
  } UEP4_TX_DMA;
  __IM  uint16_t  RESERVED21;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000006C) endpoint 5 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP5_TX_DMA : 16;          /*!< [15..0] endpoint 5 DMA buffer address                                     */
    } bit;
  } UEP5_TX_DMA;
  __IM  uint16_t  RESERVED22;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000070) endpoint 6 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP6_TX_DMA : 16;          /*!< [15..0] endpoint 6 DMA buffer address                                     */
    } bit;
  } UEP6_TX_DMA;
  __IM  uint16_t  RESERVED23;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000074) endpoint 7 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP7_TX_DMA : 16;          /*!< [15..0] endpoint 7 DMA buffer address                                     */
    } bit;
  } UEP7_TX_DMA;
  __IM  uint16_t  RESERVED24;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000078) endpoint 8 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP8_TX_DMA : 16;          /*!< [15..0] endpoint 8 DMA buffer address                                     */
    } bit;
  } UEP8_TX_DMA;
  __IM  uint16_t  RESERVED25;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000007C) endpoint 9 DMA TX buffer address                           */
    
    struct {
      __IOM uint16_t UEP9_TX_DMA : 16;          /*!< [15..0] endpoint 9 DMA buffer address                                     */
    } bit;
  } UEP9_TX_DMA;
  __IM  uint16_t  RESERVED26;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000080) endpoint 10 DMA TX buffer address                          */
    
    struct {
      __IOM uint16_t UEP10_TX_DMA : 16;         /*!< [15..0] endpoint 10 DMA buffer address                                    */
    } bit;
  } UEP10_TX_DMA;
  __IM  uint16_t  RESERVED27;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000084) endpoint 11 DMA TX buffer address                          */
    
    struct {
      __IOM uint16_t UEP11_TX_DMA : 16;         /*!< [15..0] endpoint 11 DMA buffer address                                    */
    } bit;
  } UEP11_TX_DMA;
  __IM  uint16_t  RESERVED28;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000088) endpoint 12 DMA TX buffer address                          */
    
    struct {
      __IOM uint16_t UEP12_TX_DMA___UH_SPLIT_DATA : 16;/*!< [15..0] endpoint 12 DMA buffer address                             */
    } bit;
  } UEP12_TX_DMA____UH_SPLIT_DATA;
  __IM  uint16_t  RESERVED29;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000008C) endpoint 13 DMA TX buffer address                          */
    
    struct {
      __IOM uint16_t UEP13_TX_DMA : 16;         /*!< [15..0] endpoint 13 DMA buffer address                                    */
    } bit;
  } UEP13_TX_DMA;
  __IM  uint16_t  RESERVED30;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000090) endpoint 14 DMA TX buffer address                          */
    
    struct {
      __IOM uint16_t UEP14_TX_DMA : 16;         /*!< [15..0] endpoint 14 DMA buffer address                                    */
    } bit;
  } UEP14_TX_DMA;
  __IM  uint16_t  RESERVED31;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000094) endpoint 15 DMA TX buffer address                          */
    
