ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint16_t UEP15_TX_DMA : 16;         /*!< [15..0] endpoint 15 DMA buffer address                                    */
    } bit;
  } UEP15_TX_DMA;
  __IM  uint16_t  RESERVED32;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000098) endpoint 0 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP0_MAX_LEN : 11;         /*!< [10..0] endpoint 0 max acceptable length                                  */
    } bit;
  } UEP0_MAX_LEN;
  __IM  uint16_t  RESERVED33;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000009C) endpoint 1 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP1_MAX_LEN : 11;         /*!< [10..0] endpoint 1 max acceptable length                                  */
    } bit;
  } UEP1_MAX_LEN;
  __IM  uint16_t  RESERVED34;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000A0) endpoint 2 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP2_MAX_LEN__UH_RX_MAX_LEN : 11;/*!< [10..0] endpoint 2 max acceptable length                            */
    } bit;
  } UEP2_MAX_LEN__UH_RX_MAX_LEN;
  __IM  uint16_t  RESERVED35;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000A4) endpoint 3 MAX_LEN TX                                      */
    
    struct {
      __IOM uint16_t UEP3_MAX_LEN : 11;         /*!< [10..0] endpoint 3 max acceptable length                                  */
    } bit;
  } UEP3_MAX_LEN;
  __IM  uint16_t  RESERVED36;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000A8) endpoint 4 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP4_MAX_LEN : 11;         /*!< [10..0] endpoint 4 max acceptable length                                  */
    } bit;
  } UEP4_MAX_LEN;
  __IM  uint16_t  RESERVED37;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000AC) endpoint 5 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP5_MAX_LEN : 11;         /*!< [10..0] endpoint 5 max acceptable length                                  */
    } bit;
  } UEP5_MAX_LEN;
  __IM  uint16_t  RESERVED38;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000B0) endpoint 6 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP6_MAX_LEN : 11;         /*!< [10..0] endpoint 6 max acceptable length                                  */
    } bit;
  } UEP6_MAX_LEN;
  __IM  uint16_t  RESERVED39;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000B4) endpoint 7 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP7_MAX_LEN : 11;         /*!< [10..0] endpoint 7 max acceptable length                                  */
    } bit;
  } UEP7_MAX_LEN;
  __IM  uint16_t  RESERVED40;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000B8) endpoint 8 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP8_MAX_LEN : 11;         /*!< [10..0] endpoint 8 max acceptable length                                  */
    } bit;
  } UEP8_MAX_LEN;
  __IM  uint16_t  RESERVED41;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000BC) endpoint 9 max acceptable length                           */
    
    struct {
      __IOM uint16_t UEP9_MAX_LEN : 11;         /*!< [10..0] endpoint 9 max acceptable length                                  */
    } bit;
  } UEP9_MAX_LEN;
  __IM  uint16_t  RESERVED42;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000C0) endpoint 10 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP10_MAX_LEN : 11;        /*!< [10..0] endpoint 10 max acceptable length                                 */
    } bit;
  } UEP10_MAX_LEN;
  __IM  uint16_t  RESERVED43;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000C4) endpoint 11 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP11_MAX_LEN : 11;        /*!< [10..0] endpoint 11 max acceptable length                                 */
    } bit;
  } UEP11_MAX_LEN;
  __IM  uint16_t  RESERVED44;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000C8) endpoint 12 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP12_MAX_LEN : 11;        /*!< [10..0] endpoint 12 max acceptable length                                 */
    } bit;
  } UEP12_MAX_LEN;
  __IM  uint16_t  RESERVED45;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000CC) endpoint 13 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP13_MAX_LEN : 11;        /*!< [10..0] endpoint 13 max acceptable length                                 */
    } bit;
  } UEP13_MAX_LEN;
  __IM  uint16_t  RESERVED46;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000D0) endpoint 14 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP14_MAX_LEN : 11;        /*!< [10..0] endpoint 14 max acceptable length                                 */
    } bit;
  } UEP14_MAX_LEN;
  __IM  uint16_t  RESERVED47;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000D4) endpoint 15 max acceptable length                          */
    
    struct {
      __IOM uint16_t UEP15_MAX_LEN : 11;        /*!< [10..0] endpoint 15 max acceptable length                                 */
    } bit;
  } UEP15_MAX_LEN;
  __IM  uint16_t  RESERVED48;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000D8) endpoint 0 send the length                                 */
    
    struct {
      __IOM uint16_t UEP0_T_LEN : 11;           /*!< [10..0] endpoint 0 send the length                                        */
    } bit;
  } UEP0_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000DA) endpoint 0 send control                                    */
    
