ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 0 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 0 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 0 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP0_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000DB) endpoint 0 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 0 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 0 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 0 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP0_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000DC) endpoint 1 send the length                                 */
    
    struct {
      __IOM uint16_t UEP1_T_LEN : 11;           /*!< [10..0] endpoint 1 send the length                                        */
    } bit;
  } UEP1_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000DE) endpoint 1 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 1 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 1 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 1 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP1_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000DF) endpoint 1 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 1 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 1 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 1 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP1_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000E0) endpoint 2 send the length                                 */
    
    struct {
      __IOM uint16_t UEP2_T_LEN__MASK_UH_ENDP__MASK_UH_TOKEN : 11;/*!< [10..0] endpoint 2 send the length                      */
    } bit;
  } UEP2_T_LEN__UH_EP_PID;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000E2) endpoint 2 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 2 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 2 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 2 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP2_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000E3) endpoint 2 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES__MASK_UH_R_RES : 2;/*!< [1..0] endpoint 2 control of the accept response to OUT transactions */
      __IOM uint8_t bUH_R_RES_NO : 1;           /*!< [2..2] bUH_R_RES_NO                                                       */
      __IOM uint8_t MASK_UEP_R_TOG__MASK_UH_R_TOG : 2;/*!< [4..3] endpoint 2 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO__bUH_R_AUTO_TOG : 1;/*!< [5..5] endpoint 2 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
      __IOM uint8_t bUH_R_DATA_NO : 1;          /*!< [6..6] bUH_R_DATA_NO                                                      */
    } bit;
  } UEP2_R_CTRL__UH_RX_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000E4) endpoint 3 send the length                                 */
    
    struct {
      __IOM uint16_t UEP3_T_LEN___UH_TX_LEN_H : 11;/*!< [10..0] endpoint 3 send the length                                     */
    } bit;
  } UEP3_T_LEN___UH_TX_LEN_H;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000E6) endpoint 3 send control                                    */
    
