ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES_____MASK_UH_T_RES : 2;/*!< [1..0] endpoint 3 control of the send response to IN transactions */
      __IOM uint8_t bUH_T_RES_NO : 1;           /*!< [2..2] bUH_T_RES_NO                                                       */
      __IOM uint8_t MASK_UEP_T_TOG____MASK_UH_T_TOG : 2;/*!< [4..3] endpoint 3 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO____bUH_T_AUTO_TOG : 1;/*!< [5..5] endpoint 3 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
      __IOM uint8_t bUH_T_DATA_NO : 1;          /*!< [6..6] bUH_T_DATA_NO                                                      */
    } bit;
  } UEP3_T_CTRL___UH_TX_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000E7) endpoint 3 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 3 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 3 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 3 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP3_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000E8) endpoint 4 send the length                                 */
    
    struct {
      __IOM uint16_t UEP4_T_LEN : 11;           /*!< [10..0] endpoint 0 send the length                                        */
    } bit;
  } UEP4_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000EA) endpoint 4 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 4 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 4 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 4 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP4_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000EB) endpoint 4 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 4 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 4 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 4 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP4_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000EC) endpoint 5 send the length                                 */
    
    struct {
      __IOM uint16_t UEP5_T_LEN : 11;           /*!< [10..0] endpoint 5 send the length                                        */
    } bit;
  } UEP5_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000EE) endpoint 5 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 5 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 5 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 5 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP5_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000EF) endpoint 5 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 5 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 5 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 5 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP5_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000F0) endpoint 6 send the length                                 */
    
    struct {
      __IOM uint16_t UEP6_T_LEN : 11;           /*!< [10..0] endpoint 6 send the length                                        */
    } bit;
  } UEP6_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000F2) endpoint 6 send control                                    */
    
