ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 6 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 6 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 6 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP6_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000F3) endpoint 6 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 6 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 6 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 6 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP6_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000F4) endpoint 7 send the length                                 */
    
    struct {
      __IOM uint16_t UEP7_T_LEN : 11;           /*!< [10..0] endpoint 7 send the length                                        */
    } bit;
  } UEP7_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000F6) endpoint 7 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 7 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 7 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 7 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP7_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000F7) endpoint 7 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 7 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 7 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 7 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP7_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000F8) endpoint 8 send the length                                 */
    
    struct {
      __IOM uint16_t UEP8_T_LEN : 11;           /*!< [10..0] endpoint 8 send the length                                        */
    } bit;
  } UEP8_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000FA) endpoint 8 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 8 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 8 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 8 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP8_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000FB) endpoint 8 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 8 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 8 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 8 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP8_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x000000FC) endpoint9 send the length                                  */
    
    struct {
      __IOM uint16_t UEP9_T_LEN : 11;           /*!< [10..0] endpoint 9 send the length                                        */
    } bit;
  } UEP9_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000FE) endpoint 9 send control                                    */
    
