ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 9 control of the send response to IN transactions         */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 9 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 9 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP9_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x000000FF) endpoint 9 send control                                    */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 9 control of the accept response to OUT transactions      */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 9 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 9 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP9_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000100) endpoint 10 send the length                                */
    
    struct {
      __IOM uint16_t UEP10_T_LEN : 11;          /*!< [10..0] endpoint 10 send the length                                       */
    } bit;
  } UEP10_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000102) endpoint 10 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 10 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 10 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 10 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP10_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000103) endpoint 10 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 10 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 10 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 10 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP10_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000104) endpoint 11 send the length                                */
    
    struct {
      __IOM uint16_t UEP0_T_LEN : 11;           /*!< [10..0] endpoint 11 send the length                                       */
    } bit;
  } UEP11_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000106) endpoint 11 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 11 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 11 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 11 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP11_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000107) endpoint 11 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 11 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 11 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 11 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP11_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000108) endpoint 12 send the length                                */
    
    struct {
      __IOM uint16_t UEP0_T_LEN : 11;           /*!< [10..0] endpoint 12 send the length                                       */
    } bit;
  } UEP12_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000010A) endpoint 12 send control                                   */
    
