ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 12 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 12 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 12 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP12_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000010B) endpoint 12 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 12 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 12 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 12 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP12_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000010C) endpoint 13 send the length                                */
    
    struct {
      __IOM uint16_t UEP13_T_LEN : 11;          /*!< [10..0] endpoint 13 send the length                                       */
    } bit;
  } UEP13_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000010E) endpoint 13 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 13 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 13 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 13 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP13_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000010F) endpoint 13 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 13 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 13 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 13 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP13_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000110) endpoint 14 send the length                                */
    
    struct {
      __IOM uint16_t UEP14_T_LEN : 11;          /*!< [10..0] endpoint 14 send the length                                       */
    } bit;
  } UEP14_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000112) endpoint 14 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 14 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 14 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 14 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP14_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000113) endpoint 14 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 14 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 14 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 14 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP14_R_CTRL;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000114) endpoint 15 send the length                                */
    
    struct {
      __IOM uint16_t UEP0_T_LEN : 11;           /*!< [10..0] endpoint 15 send the length                                       */
    } bit;
  } UEP15_T_LEN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000116) endpoint 15 send control                                   */
    
