ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] endpoint 15 control of the send response to IN transactions        */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_T_TOG : 2;         /*!< [4..3] endpoint 15 synchronous trigger bit for the sender to
                                                     prepare                                                                   */
      __IOM uint8_t bUEP_T_TOG_AUTO : 1;        /*!< [5..5] endpoint 15 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP15_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000117) endpoint 15 send control                                   */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] endpoint 15 control of the accept response to OUT transactions     */
      __IM  uint8_t             : 1;
      __IOM uint8_t MASK_UEP_R_TOG : 2;         /*!< [4..3] endpoint 15 synchronous trigger bit for the accept to
                                                     prepare                                                                   */
      __IM  uint8_t bUEP_R_TOG_AUTO : 1;        /*!< [5..5] endpoint 15 synchronous trigger bit automatic filp enables
                                                     the control bit                                                           */
    } bit;
  } UEP15_R_CTRL;
} USBHD_Type;                                   /*!< Size = 280 (0x118)                                                        */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Data register                                              */
    
    struct {
      __IOM uint32_t DR         : 32;           /*!< [31..0] Data Register                                                     */
    } bit;
  } DATAR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Independent Data register                                  */
    
    struct {
      __IOM uint32_t IDR        : 8;            /*!< [7..0] Independent Data register                                          */
    } bit;
  } IDATAR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) Control register                                           */
    
    struct {
      __OM  uint32_t RESET      : 1;            /*!< [0..0] Reset bit                                                          */
    } bit;
  } CTLR;
} CRC_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x40022000) FLASH Structure                                            */
  __IM  uint32_t  RESERVED;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000004) Flash key register                                         */
    
    struct {
      __OM  uint32_t KEYR       : 32;           /*!< [31..0] FPEC key                                                          */
    } bit;
  } KEYR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000008) Flash option key register                                  */
    
    struct {
      __OM  uint32_t OPTKEY     : 32;           /*!< [31..0] Option byte key                                                   */
    } bit;
  } OBKEYR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Status register                                            */
    
    struct {
      __IM  uint32_t BSY        : 1;            /*!< [0..0] Busy                                                               */
      __IM  uint32_t WR_BSY     : 1;            /*!< [1..1] Quick page programming                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t WRPRTERR   : 1;            /*!< [4..4] Write protection error                                             */
      __IOM uint32_t EOP        : 1;            /*!< [5..5] End of operation                                                   */
      __IM  uint32_t            : 1;
      __IM  uint32_t ENHANCE_MOD_STA : 1;       /*!< [7..7] Enhance mode start                                                 */
    } bit;
  } STATR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Control register                                           */
    
    struct {
      __IOM uint32_t PG         : 1;            /*!< [0..0] Programming                                                        */
      __IOM uint32_t PER        : 1;            /*!< [1..1] Page Erase                                                         */
      __IOM uint32_t MER        : 1;            /*!< [2..2] Mass Erase                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t OBPG       : 1;            /*!< [4..4] Option byte programming                                            */
      __IOM uint32_t OBER       : 1;            /*!< [5..5] Option byte erase                                                  */
      __IOM uint32_t STRT       : 1;            /*!< [6..6] Start                                                              */
      __IOM uint32_t LOCK       : 1;            /*!< [7..7] Lock                                                               */
      __IM  uint32_t            : 1;
      __IOM uint32_t OBWRE      : 1;            /*!< [9..9] Option bytes write enable                                          */
      __IOM uint32_t ERRIE      : 1;            /*!< [10..10] Error interrupt enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t EOPIE      : 1;            /*!< [12..12] End of operation interrupt enable                                */
      __IM  uint32_t            : 2;
      __IOM uint32_t FLOCK      : 1;            /*!< [15..15] Fast programmable lock                                           */
      __IOM uint32_t PAGE_PG    : 1;            /*!< [16..16] Fast programming                                                 */
      __IOM uint32_t PAGE_ER    : 1;            /*!< [17..17] Fast erase                                                       */
      __IOM uint32_t BER32      : 1;            /*!< [18..18] Block Erase 32K                                                  */
      __IOM uint32_t BER64      : 1;            /*!< [19..19] Block Erase 64K                                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t PGSTART    : 1;            /*!< [21..21] Page Programming Start                                           */
      __IOM uint32_t RSENACT    : 1;            /*!< [22..22] Reset Flash Enhance read mode                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t ENHANCEMODE : 1;           /*!< [24..24] Flash Enhance read mode                                          */
      __IOM uint32_t SCKMODE    : 1;            /*!< [25..25] Flash SCK mode                                                   */
    } bit;
  } CTLR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000014) Flash address register                                     */
    
