ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __OM  uint32_t FAR        : 32;           /*!< [31..0] Flash Address                                                     */
    } bit;
  } ADDR;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000001C) Option byte register                                       */
    
    struct {
      __IM  uint32_t OBERR      : 1;            /*!< [0..0] Option byte error                                                  */
      __IM  uint32_t RDPRT      : 1;            /*!< [1..1] Read protection                                                    */
      __IM  uint32_t IWDG_SW    : 1;            /*!< [2..2] IWDG_SW                                                            */
      __IM  uint32_t STOP_RST   : 1;            /*!< [3..3] STOP_RST                                                           */
      __IM  uint32_t STANDY_RST : 1;            /*!< [4..4] STANDY_RST                                                         */
      __IM  uint32_t            : 3;
      __IM  uint32_t SRAM_CODE_MODE : 2;        /*!< [9..8] SRAM_CODE_MODE                                                     */
    } bit;
  } OBR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Write protection register                                  */
    
    struct {
      __IM  uint32_t WRP        : 32;           /*!< [31..0] Write protect                                                     */
    } bit;
  } WPR;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000024) Mode select register                                       */
    
    struct {
      __OM  uint32_t MODEKEYR   : 32;           /*!< [31..0] Mode select                                                       */
    } bit;
  } MODEKEYR;
} FLASH_Type;                                   /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                        USB_OTG_FS                                         ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0x50000000) USB_OTG_FS Structure                                       */
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000000) USB base control                                           */
    
    struct {
      __IOM uint8_t USBHD_UC_DMA_EN : 1;        /*!< [0..0] DMA enable and DMA interrupt enable for USB                        */
      __IOM uint8_t USBHD_UC_CLR_ALL : 1;       /*!< [1..1] force clear FIFO and count of USB                                  */
      __IOM uint8_t USBHD_UC_RESET_SIE : 1;     /*!< [2..2] force reset USB SIE, need software clear                           */
      __IOM uint8_t USBHD_UC_INT_BUSY : 1;      /*!< [3..3] enable automatic responding busy for device mode or automatic
                                                     pause for host mode during interrupt flag UIF_TRANSFER
                                                     valid                                                                     */
      __IOM uint8_t USBHD_UC_SYS_CTRL_MASK : 2; /*!< [5..4] USB device enable and internal pullup resistance enable            */
      __IOM uint8_t USBHD_UC_LOW_SPEED : 1;     /*!< [6..6] enable USB low speed: 0=12Mbps, 1=1.5Mbps                          */
      __IOM uint8_t RB_UC_HOST_MODE : 1;        /*!< [7..7] enable USB host mode: 0=device mode, 1=host mode                   */
    } bit;
  } USBHD_BASE_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000001) USB device/host physical prot control                      */
    
    struct {
      __IOM uint8_t USBHD_UH_PORT_EN__USBHD_UD_PORT_EN : 1;/*!< [0..0] enable USB port: 0=disable, 1=enable port, automatic
                                                     disabled if USB device detached                                           */
      __IOM uint8_t USBHD_UH_BUS_RESET__USBHD_UD_GP_BIT : 1;/*!< [1..1] force clear FIFO and count of USB                      */
      __IOM uint8_t USBHD_UH_LOW_SPEED__USBHD_UD_LOW_SPEED : 1;/*!< [2..2] enable USB port low speed: 0=full speed, 1=low speed */
      __IM  uint8_t             : 1;
      __IOM uint8_t USBHD_UH_DM_PIN__USBHD_UD_DM_PIN : 1;/*!< [4..4] ReadOnly: indicate current UDM pin level                  */
      __IOM uint8_t USBHD_UH_DP_PIN__USBHD_UD_DP_PIN : 1;/*!< [5..5] USB device enable and internal pullup resistance enable   */
      __IM  uint8_t             : 1;
      __IOM uint8_t USBHD_UH_PD_DIS__USBHD_UD_PD_DIS : 1;/*!< [7..7] disable USB UDP/UDM pulldown resistance: 0=enable pulldown,
                                                     1=disable                                                                 */
    } bit;
  } USBHD_UDEV_CTRL__USBHD_UHOST_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000002) USB interrupt enable                                       */
    
    struct {
      __IOM uint8_t USBHD_UIE_BUS_RST__USBHD_UIE_DETECT : 1;/*!< [0..0] enable interrupt for USB bus reset event for USB device
                                                     mode                                                                      */
      __IOM uint8_t USBHD_UIE_TRANSFER : 1;     /*!< [1..1] enable interrupt for USB transfer completion                       */
      __IOM uint8_t USBHD_UIE_SUSPEND : 1;      /*!< [2..2] enable interrupt for USB suspend or resume event                   */
      __IOM uint8_t USBHD_UIE_HST_SOF : 1;      /*!< [3..3] enable interrupt for host SOF timer action for USB host
                                                     mode                                                                      */
      __IOM uint8_t USBHD_UIE_FIFO_OV : 1;      /*!< [4..4] enable interrupt for FIFO overflow                                 */
      __IM  uint8_t             : 1;
      __IOM uint8_t USBHD_UIE_DEV_NAK : 1;      /*!< [6..6] enable interrupt for NAK responded for USB device mode             */
      __IOM uint8_t USBHD_UIE_DEV_SOF : 1;      /*!< [7..7] enable interrupt for SOF received for USB device mode              */
    } bit;
  } R8_USB_INT_EN;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000003) USB device address                                         */
    
