ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_USB_ADDR : 7;          /*!< [6..0] bit mask for USB device address                                    */
      __IOM uint8_t RB_UDA_GP_BIT : 1;          /*!< [7..7] general purpose bit                                                */
    } bit;
  } R8_USB_DEV_AD;
  __IM  uint8_t   RESERVED;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x00000005) USB miscellaneous status                                   */
    
    struct {
      __IM  uint8_t RB_UMS_DEV_ATTACH : 1;      /*!< [0..0] RO, indicate device attached status on USB host                    */
      __IM  uint8_t RB_UMS_DM_LEVEL : 1;        /*!< [1..1] RO, indicate UDM level saved at device attached to USB
                                                     host                                                                      */
      __IM  uint8_t RB_UMS_SUSPEND : 1;         /*!< [2..2] RO, indicate USB suspend status                                    */
      __IM  uint8_t RB_UMS_BUS_RESET : 1;       /*!< [3..3] RO, indicate USB bus reset status                                  */
      __IM  uint8_t RB_UMS_R_FIFO_RDY : 1;      /*!< [4..4] RO, indicate USB receiving FIFO ready status (not empty)           */
      __IM  uint8_t RB_UMS_SIE_FREE : 1;        /*!< [5..5] RO, indicate USB SIE free status                                   */
      __IM  uint8_t RB_UMS_SOF_ACT : 1;         /*!< [6..6] RO, indicate host SOF timer action status for USB host             */
      __IM  uint8_t RB_UMS_SOF_PRES : 1;        /*!< [7..7] RO, indicate host SOF timer presage status                         */
    } bit;
  } R8_USB_MIS_ST;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000006) USB interrupt flag                                         */
    
    struct {
      __IOM uint8_t RB_UIF_BUS_RST__RB_UIF_DETECT : 1;/*!< [0..0] bus reset event interrupt flag for USB device mode, direct
                                                     bit address clear or write 1 to clear;device detected event
                                                     interrupt flag for USB host mode, direct bit address clear
                                                     or write 1 to clear                                                       */
      __IOM uint8_t RB_UIF_TRANSFER : 1;        /*!< [1..1] USB transfer completion interrupt flag, direct bit address
                                                     clear or write 1 to clear                                                 */
      __IOM uint8_t RB_UIF_SUSPEND : 1;         /*!< [2..2] USB suspend or resume event interrupt flag, direct bit
                                                     address clear or write 1 to clear                                         */
      __IOM uint8_t RB_UIF_HST_SOF : 1;         /*!< [3..3] host SOF timer interrupt flag for USB host, direct bit
                                                     address clear or write 1 to clear                                         */
      __IOM uint8_t RB_UIF_FIFO_OV : 1;         /*!< [4..4] FIFO overflow interrupt flag for USB, direct bit address
                                                     clear or write 1 to clear                                                 */
      __IM  uint8_t RB_U_SIE_FREE : 1;          /*!< [5..5] RO, indicate USB SIE free status                                   */
      __IM  uint8_t RB_U_TOG_OK : 1;            /*!< [6..6] RO, indicate current USB transfer toggle is OK                     */
      __IM  uint8_t RB_U_IS_NAK : 1;            /*!< [7..7] RO, indicate current USB transfer is NAK received                  */
    } bit;
  } R8_USB_INT_FG;
  
  union {
    __IM  uint8_t reg;                          /*!< (@ 0x00000007) USB interrupt status                                       */
    
    struct {
      __IM  uint8_t MASK_UIS_H_RES__MASK_UIS_ENDP : 4;/*!< [3..0] RO, bit mask of current transfer handshake response for
                                                     USB host mode: 0000=no response, time out from device,
                                                     others=handshake response PID received;RO, bit mask of
                                                     current transfer endpoint number for USB device mode                      */
      __IM  uint8_t MASK_UIS_TOKEN : 2;         /*!< [5..4] RO, bit mask of current token PID code received for USB
                                                     device mode                                                               */
      __IM  uint8_t RB_UIS_TOG_OK : 1;          /*!< [6..6] RO, indicate current USB transfer toggle is OK                     */
      __IM  uint8_t RB_UIS_IS_NAK : 1;          /*!< [7..7] RO, indicate current USB transfer is NAK received for
                                                     USB device mode                                                           */
    } bit;
  } R8_USB_INT_ST;
  __IM  uint16_t  R16_USB_RX_LEN;               /*!< (@ 0x00000008) USB receiving length                                       */
  __IM  uint16_t  RESERVED1;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000000C) endpoint 4/1 mode                                          */
    
    struct {
      __IM  uint8_t             : 2;
      __IOM uint8_t RB_UEP4_TX_EN : 1;          /*!< [2..2] enable USB endpoint 4 transmittal (IN)                             */
      __IOM uint8_t RB_UEP4_RX_EN : 1;          /*!< [3..3] enable USB endpoint 4 receiving (OUT)                              */
      __IOM uint8_t RB_UEP1_BUF_MOD : 1;        /*!< [4..4] buffer mode of USB endpoint 1                                      */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP1_TX_EN : 1;          /*!< [6..6] enable USB endpoint 1 transmittal (IN)                             */
      __IOM uint8_t RB_UEP1_RX_EN : 1;          /*!< [7..7] enable USB endpoint 1 receiving (OUT)                              */
    } bit;
  } R8_UEP4_1_MOD;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000000D) endpoint 2/3 mode;host endpoint mode                       */
    
