ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD : 1;/*!< [0..0] buffer mode of USB endpoint 2;buffer mode of USB host
                                                     IN endpoint                                                               */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP2_TX_EN : 1;          /*!< [2..2] enable USB endpoint 2 transmittal (IN)                             */
      __IOM uint8_t RB_UEP2_RX_EN__RB_UH_EP_RX_EN : 1;/*!< [3..3] enable USB endpoint 2 receiving (OUT);enable USB host
                                                     IN endpoint receiving                                                     */
      __IOM uint8_t RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD : 1;/*!< [4..4] buffer mode of USB endpoint 3;buffer mode of USB host
                                                     OUT endpoint                                                              */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP3_TX_EN__RB_UH_EP_TX_EN : 1;/*!< [6..6] enable USB endpoint 3 transmittal (IN);enable USB host
                                                     OUT endpoint transmittal                                                  */
      __IOM uint8_t RB_UEP3_RX_EN : 1;          /*!< [7..7] enable USB endpoint 3 receiving (OUT)                              */
    } bit;
  } R8_UEP2_3_MOD__R8_UH_EP_MOD;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000000E) endpoint 5/6 mode                                          */
    
    struct {
      __IOM uint8_t RB_UEP5_BUF_MOD : 1;        /*!< [0..0] buffer mode of USB endpoint 5                                      */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP5_TX_EN : 1;          /*!< [2..2] enable USB endpoint 5 transmittal (IN)                             */
      __IOM uint8_t RB_UEP5_RX_EN : 1;          /*!< [3..3] enable USB endpoint 5 receiving (OUT)                              */
      __IOM uint8_t RB_UEP6_BUF_MOD : 1;        /*!< [4..4] buffer mode of USB endpoint 6                                      */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP6_TX_EN : 1;          /*!< [6..6] enable USB endpoint 6 transmittal (IN)                             */
      __IOM uint8_t RB_UEP3_RX_EN : 1;          /*!< [7..7] enable USB endpoint 6 receiving (OUT)                              */
    } bit;
  } R8_UEP5_6_MOD;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000000F) endpoint 7 mode                                            */
    
    struct {
      __IOM uint8_t RB_UEP7_BUF_MOD : 1;        /*!< [0..0] buffer mode of USB endpoint 7                                      */
      __IM  uint8_t             : 1;
      __IOM uint8_t RB_UEP7_TX_EN : 1;          /*!< [2..2] enable USB endpoint 7 transmittal (IN)                             */
      __IOM uint8_t RB_UEP7_RX_EN : 1;          /*!< [3..3] enable USB endpoint 7 receiving (OUT)                              */
    } bit;
  } R8_UEP7_MOD;
  __IOM uint32_t  R32_UEP0_DMA;                 /*!< (@ 0x00000010) endpoint 0 DMA buffer address                              */
  __IOM uint32_t  R32_UEP1_DMA;                 /*!< (@ 0x00000014) endpoint 1 DMA buffer address                              */
  __IOM uint32_t  R32_UEP2_DMA__R32_UH_RX_DMA;  /*!< (@ 0x00000018) endpoint 2 DMA buffer address;host rx endpoint
                                                                    buffer high address                                        */
  __IOM uint32_t  R32_UEP3_DMA__R32_UH_TX_DMA;  /*!< (@ 0x0000001C) endpoint 3 DMA buffer address;host tx endpoint
                                                                    buffer high address                                        */
  __IOM uint32_t  R32_UEP4_DMA;                 /*!< (@ 0x00000020) endpoint 4 DMA buffer address                              */
  __IOM uint32_t  R32_UEP5_DMA;                 /*!< (@ 0x00000024) endpoint 5 DMA buffer address                              */
  __IOM uint32_t  R32_UEP6_DMA;                 /*!< (@ 0x00000028) endpoint 6 DMA buffer address                              */
  __IOM uint32_t  R32_UEP7_DMA;                 /*!< (@ 0x0000002C) endpoint 7 DMA buffer address                              */
  __IOM uint8_t   R8_UEP0_T_LEN;                /*!< (@ 0x00000030) endpoint 0 transmittal length                              */
  __IM  uint8_t   RESERVED2;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000032) endpoint 0 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG : 1;        /*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP0_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000033) endpoint 0 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP0_R_CTRL;
  __IOM uint8_t   R8_UEP1_T_LEN;                /*!< (@ 0x00000034) endpoint 1 transmittal length                              */
  __IM  uint8_t   RESERVED3;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000036) endpoint 1 control                                         */
    
