ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG_ : 1;       /*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
      __IM  uint8_t             : 2;
      __IOM uint8_t USBHD_UH_SOF_EN : 1;        /*!< [6..6] USB host automatic SOF enable                                      */
      __IOM uint8_t USBHD_UH_PRE_PID_EN : 1;    /*!< [7..7] USB host PRE PID enable for low speed device via hub               */
    } bit;
  } R8_UEP1_T_CTRL___USBHD_UH_SETUP;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000037) endpoint 1 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP1_R_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000038) endpoint 2 transmittal length                              */
    
    struct {
      __IOM uint8_t USBHD_UH_ENDP_MASK : 4;     /*!< [3..0] bit mask of endpoint number for USB host transfer                  */
      __IOM uint8_t USBHD_UH_TOKEN_MASK : 4;    /*!< [7..4] bit mask of token PID for USB host transfer                        */
    } bit;
  } R8_UEP2_T_LEN__USBHD_UH_EP_PID;
  __IM  uint8_t   RESERVED4;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000003A) endpoint 2 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG_ : 1;       /*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP2_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000003B) endpoint 2 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES___USBHD_UH_R_RES : 2;/*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG___USBHD_UH_R_TOG : 1;/*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG___USBHD_UH_R_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP2_R_CTRL__USBHD_UH_RX_CTRL;
  __IOM uint8_t   R8_UEP3_T_LEN__USBHD_UH_TX_LEN;/*!< (@ 0x0000003C) endpoint 3 transmittal length                             */
  __IM  uint8_t   RESERVED5;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000003E) endpoint 3 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES___USBHD_UH_T_RES : 2;/*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG___USBHD_UH_T_TOG : 1;/*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP3_T_CTRL__USBHD_UH_TX_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000003F) endpoint 3 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP3_R_CTRL_;
  __IOM uint8_t   R8_UEP4_T_LEN;                /*!< (@ 0x00000040) endpoint 4 transmittal length                              */
  __IM  uint8_t   RESERVED6;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000042) endpoint 4 control                                         */
    
