ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG___USBHD_UH_T_TOG : 1;/*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP4_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000043) endpoint 4 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP4_R_CTRL_;
  __IOM uint8_t   R8_UEP5_T_LEN;                /*!< (@ 0x00000044) endpoint 5 transmittal length                              */
  __IM  uint8_t   RESERVED7;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000046) endpoint 5 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG___USBHD_UH_T_TOG : 1;/*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP5_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x00000047) endpoint 5 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP5_R_CTRL_;
  __IOM uint8_t   R8_UEP6_T_LEN;                /*!< (@ 0x00000048) endpoint 6 transmittal length                              */
  __IM  uint8_t   RESERVED8;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000004A) endpoint 6 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG___USBHD_UH_T_TOG : 1;/*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP6_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000004B) endpoint 6 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP6_R_CTRL_;
  __IOM uint8_t   R8_UEP7_T_LEN;                /*!< (@ 0x0000004C) endpoint 7 transmittal length                              */
  __IM  uint8_t   RESERVED9;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000004E) endpoint 7 control                                         */
    
