ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IOM uint8_t MASK_UEP_T_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X transmittal (IN)                                                        */
      __IOM uint8_t USBHD_UEP_T_TOG___USBHD_UH_T_TOG : 1;/*!< [2..2] prepared data toggle flag of USB endpoint X transmittal
                                                     (IN): 0=DATA0, 1=DATA1                                                    */
      __IOM uint8_t USBHD_UEP_AUTO_TOG__USBHD_UH_T_AUTO_TOG : 1;/*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP7_T_CTRL;
  
  union {
    __IOM uint8_t reg;                          /*!< (@ 0x0000004F) endpoint 7 control                                         */
    
    struct {
      __IOM uint8_t MASK_UEP_R_RES : 2;         /*!< [1..0] bit mask of handshake response type for USB endpoint
                                                     X receiving (OUT)                                                         */
      __IOM uint8_t USBHD_UEP_R_TOG : 1;        /*!< [2..2] expected data toggle flag of USB endpoint X receiving
                                                     (OUT): 0=DATA0, 1=DATA1                                                   */
      __IOM uint8_t USBHD_UEP_AUTO_TOG : 1;     /*!< [3..3] enable automatic toggle after successful transfer completion
                                                     on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle                    */
    } bit;
  } R8_UEP7_R_CTRL_;
  __IM  uint32_t  RESERVED10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) usb otg control                                            */
    
    struct {
      __IOM uint32_t USB_OTG_CR_DISCHARGEVBUS : 1;/*!< [0..0] usb otg control                                                  */
      __IOM uint32_t USB_OTG_CR_CHARGEVBUS : 1; /*!< [1..1] usb otg control                                                    */
      __IOM uint32_t USB_OTG_CR_IDPU : 1;       /*!< [2..2] usb otg control                                                    */
      __IOM uint32_t USB_OTG_CR_OTG_EN : 1;     /*!< [3..3] usb otg control                                                    */
      __IOM uint32_t USB_OTG_CR_VBUS : 1;       /*!< [4..4] usb otg control                                                    */
      __IOM uint32_t USB_OTG_CR_SESS : 1;       /*!< [5..5] usb otg control                                                    */
    } bit;
  } USB_OTG_CR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) usb otg status                                             */
    
    struct {
      __IOM uint32_t USB_OTG_SR_VBUS_VLD : 1;   /*!< [0..0] usb otg status                                                     */
      __IOM uint32_t USB_OTG_SR_SESS_VLD : 1;   /*!< [1..1] usb otg status                                                     */
      __IOM uint32_t USB_OTG_SR_SESS_END : 1;   /*!< [2..2] usb otg status                                                     */
      __IOM uint32_t USB_OTG_SR_ID_DIG : 1;     /*!< [3..3] usb otg status                                                     */
    } bit;
  } USB_OTG_SR;
} USB_OTG_FS_Type;                              /*!< Size = 92 (0x5c)                                                          */



/* =========================================================================================================================== */
/* ================                                           PFIC                                            ================ */
/* =========================================================================================================================== */

typedef struct {                                /*!< (@ 0xE000E000) PFIC Structure                                             */
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000000) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t            : 2;
      __IM  uint32_t INTENSTA2_3 : 2;           /*!< [3..2] Interrupt ID Status                                                */
      __IM  uint32_t            : 8;
      __IM  uint32_t INTENSTA12_31 : 20;        /*!< [31..12] Interrupt ID Status                                              */
    } bit;
  } ISR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000004) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t INTENSTA   : 32;           /*!< [31..0] Interrupt ID Status                                               */
    } bit;
  } ISR2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000008) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t INTENSTA   : 32;           /*!< [31..0] Interrupt ID Status                                               */
    } bit;
  } ISR3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000000C) Interrupt Status Register                                  */
    
    struct {
      __IM  uint32_t INTENSTA   : 8;            /*!< [7..0] Interrupt ID Status                                                */
    } bit;
  } ISR4;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000020) Interrupt Pending Register                                 */
    
    struct {
      __IM  uint32_t            : 2;
      __IM  uint32_t PENDSTA2_3 : 2;            /*!< [3..2] PENDSTA                                                            */
      __IM  uint32_t            : 8;
      __IM  uint32_t PENDSTA12_31 : 20;         /*!< [31..12] PENDSTA                                                          */
    } bit;
  } IPR1;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000024) Interrupt Pending Register                                 */
    
