ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t PENDSTA    : 32;           /*!< [31..0] PENDSTA                                                           */
    } bit;
  } IPR2;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x00000028) Interrupt Pending Register                                 */
    
    struct {
      __IM  uint32_t PENDSTA    : 32;           /*!< [31..0] PENDSTA                                                           */
    } bit;
  } IPR3;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000002C) Interrupt Pending Register                                 */
    
    struct {
      __IM  uint32_t PENDSTA    : 8;            /*!< [7..0] PENDSTA                                                            */
    } bit;
  } IPR4;
  __IM  uint32_t  RESERVED1[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Interrupt Priority Register                                */
    
    struct {
      __IOM uint32_t THRESHOLD  : 8;            /*!< [7..0] THRESHOLD                                                          */
    } bit;
  } ITHRESDR;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Interrupt Config Register                                  */
    
    struct {
      __IM  uint32_t            : 7;
      __OM  uint32_t RESETSYS   : 1;            /*!< [7..7] RESETSYS                                                           */
      __IM  uint32_t            : 8;
      __OM  uint32_t KEYCODE    : 16;           /*!< [31..16] KEYCODE                                                          */
    } bit;
  } CFGR;
  
  union {
    __IM  uint32_t reg;                         /*!< (@ 0x0000004C) Interrupt Global Register                                  */
    
    struct {
      __IM  uint32_t NESTSTA    : 8;            /*!< [7..0] NESTSTA                                                            */
      __IM  uint32_t GACTSTA    : 1;            /*!< [8..8] GACTSTA                                                            */
      __IM  uint32_t GPENDSTA   : 1;            /*!< [9..9] GPENDSTA                                                           */
    } bit;
  } GISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) ID Config Register                                         */
    
    struct {
      __IOM uint32_t VTFID0     : 8;            /*!< [7..0] VTFID0                                                             */
      __IOM uint32_t VTFID1     : 8;            /*!< [15..8] VTFID1                                                            */
      __IOM uint32_t VTFID2     : 8;            /*!< [23..16] VTFID2                                                           */
      __IOM uint32_t VTFID3     : 8;            /*!< [31..24] VTFID3                                                           */
    } bit;
  } VTFIDR;
  __IM  uint32_t  RESERVED3[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Interrupt 0 address Register                               */
    
    struct {
      __IOM uint32_t VTF0EN     : 1;            /*!< [0..0] VTF0EN                                                             */
      __IOM uint32_t ADDR0      : 31;           /*!< [31..1] ADDR0                                                             */
    } bit;
  } VTFADDRR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Interrupt 1 address Register                               */
    
    struct {
      __IOM uint32_t VTF1EN     : 1;            /*!< [0..0] VTF1EN                                                             */
      __IOM uint32_t ADDR1      : 31;           /*!< [31..1] ADDR1                                                             */
    } bit;
  } VTFADDRR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Interrupt 2 address Register                               */
    
    struct {
      __IOM uint32_t VTF2EN     : 1;            /*!< [0..0] VTF2EN                                                             */
      __IOM uint32_t ADDR2      : 31;           /*!< [31..1] ADDR2                                                             */
    } bit;
  } VTFADDRR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Interrupt 3 address Register                               */
    
    struct {
      __IOM uint32_t VTF3EN     : 1;            /*!< [0..0] VTF3EN                                                             */
      __IOM uint32_t ADDR3      : 31;           /*!< [31..1] ADDR3                                                             */
    } bit;
  } VTFADDRR3;
  __IM  uint32_t  RESERVED4[36];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000100) Interrupt Setting Register                                 */
    
    struct {
      __IM  uint32_t            : 12;
      __OM  uint32_t INTEN      : 20;           /*!< [31..12] INTEN                                                            */
    } bit;
  } IENR1;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000104) Interrupt Setting Register                                 */
    
    struct {
      __OM  uint32_t INTEN      : 32;           /*!< [31..0] INTEN                                                             */
    } bit;
  } IENR2;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000108) Interrupt Setting Register                                 */
    
    struct {
      __OM  uint32_t INTEN      : 32;           /*!< [31..0] INTEN                                                             */
    } bit;
  } IENR3;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000010C) Interrupt Setting Register                                 */
    
    struct {
      __OM  uint32_t INTEN      : 8;            /*!< [7..0] INTEN                                                              */
    } bit;
  } IENR4;
  __IM  uint32_t  RESERVED5[28];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000180) Interrupt Clear Register                                   */
    
