ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t            : 12;
      __OM  uint32_t INTRSET    : 20;           /*!< [31..12] INTRSET                                                          */
    } bit;
  } IRER1;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000184) Interrupt Clear Register                                   */
    
    struct {
      __OM  uint32_t INTRSET    : 32;           /*!< [31..0] INTRSET                                                           */
    } bit;
  } IRER2;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000188) Interrupt Clear Register                                   */
    
    struct {
      __OM  uint32_t INTRSET    : 32;           /*!< [31..0] INTRSET                                                           */
    } bit;
  } IRER3;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000018C) Interrupt Clear Register                                   */
    
    struct {
      __OM  uint32_t INTRSET    : 8;            /*!< [7..0] INTRSET                                                            */
    } bit;
  } IRER4;
  __IM  uint32_t  RESERVED6[28];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000200) Interrupt Pending Register                                 */
    
    struct {
      __IM  uint32_t            : 2;
      __OM  uint32_t PENDSET2_3 : 2;            /*!< [3..2] PENDSET                                                            */
      __IM  uint32_t            : 8;
      __OM  uint32_t PENDSET12_31 : 20;         /*!< [31..12] PENDSET                                                          */
    } bit;
  } IPSR1;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000204) Interrupt Pending Register                                 */
    
    struct {
      __OM  uint32_t PENDSET    : 32;           /*!< [31..0] PENDSET                                                           */
    } bit;
  } IPSR2;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000208) Interrupt Pending Register                                 */
    
    struct {
      __OM  uint32_t PENDSET    : 32;           /*!< [31..0] PENDSET                                                           */
    } bit;
  } IPSR3;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000020C) Interrupt Pending Register                                 */
    
    struct {
      __OM  uint32_t PENDSET    : 8;            /*!< [7..0] PENDSET                                                            */
    } bit;
  } IPSR4;
  __IM  uint32_t  RESERVED7[28];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000280) Interrupt Pending Clear Register                           */
    
    struct {
      __IM  uint32_t            : 2;
      __OM  uint32_t PENDRESET2_3 : 2;          /*!< [3..2] PENDRESET                                                          */
      __IM  uint32_t            : 8;
      __OM  uint32_t PENDRESET12_31 : 20;       /*!< [31..12] PENDRESET                                                        */
    } bit;
  } IPRR1;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000284) Interrupt Pending Clear Register                           */
    
    struct {
      __OM  uint32_t PENDRESET  : 32;           /*!< [31..0] PENDRESET                                                         */
    } bit;
  } IPRR2;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000288) Interrupt Pending Clear Register                           */
    
    struct {
      __OM  uint32_t PENDRESET  : 32;           /*!< [31..0] PENDRESET                                                         */
    } bit;
  } IPRR3;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000028C) Interrupt Pending Clear Register                           */
    
    struct {
      __OM  uint32_t PENDRESET  : 8;            /*!< [7..0] PENDRESET                                                          */
    } bit;
  } IPRR4;
  __IM  uint32_t  RESERVED8[28];
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000300) Interrupt ACTIVE Register                                  */
    
    struct {
      __IM  uint32_t            : 2;
      __OM  uint32_t IACTS2_3   : 2;            /*!< [3..2] IACTS                                                              */
      __IM  uint32_t            : 8;
      __OM  uint32_t IACTS12_31 : 20;           /*!< [31..12] IACTS                                                            */
    } bit;
  } IACTR1;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000304) Interrupt ACTIVE Register                                  */
    
    struct {
      __OM  uint32_t IACTS      : 32;           /*!< [31..0] IACTS                                                             */
    } bit;
  } IACTR2;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x00000308) Interrupt ACTIVE Register                                  */
    
    struct {
      __OM  uint32_t IACTS      : 32;           /*!< [31..0] IACTS                                                             */
    } bit;
  } IACTR3;
  
  union {
    __OM  uint32_t reg;                         /*!< (@ 0x0000030C) Interrupt ACTIVE Register                                  */
    
    struct {
      __OM  uint32_t IACTS      : 8;            /*!< [7..0] IACTS                                                              */
    } bit;
  } IACTR4;
  __IM  uint32_t  RESERVED9[60];
  __IOM uint8_t   IPRIOR0;                      /*!< (@ 0x00000400) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR1;                      /*!< (@ 0x00000401) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR2;                      /*!< (@ 0x00000402) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR3;                      /*!< (@ 0x00000403) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR4;                      /*!< (@ 0x00000404) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR5;                      /*!< (@ 0x00000405) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR6;                      /*!< (@ 0x00000406) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR7;                      /*!< (@ 0x00000407) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR8;                      /*!< (@ 0x00000408) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR9;                      /*!< (@ 0x00000409) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR10;                     /*!< (@ 0x0000040A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR11;                     /*!< (@ 0x0000040B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR12;                     /*!< (@ 0x0000040C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR13;                     /*!< (@ 0x0000040D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR14;                     /*!< (@ 0x0000040E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR15;                     /*!< (@ 0x0000040F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR16;                     /*!< (@ 0x00000410) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR17;                     /*!< (@ 0x00000411) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR18;                     /*!< (@ 0x00000412) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR19;                     /*!< (@ 0x00000413) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR20;                     /*!< (@ 0x00000414) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR21;                     /*!< (@ 0x00000415) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR22;                     /*!< (@ 0x00000416) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR23;                     /*!< (@ 0x00000417) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR24;                     /*!< (@ 0x00000418) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR25;                     /*!< (@ 0x00000419) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR26;                     /*!< (@ 0x0000041A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR27;                     /*!< (@ 0x0000041B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR28;                     /*!< (@ 0x0000041C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR29;                     /*!< (@ 0x0000041D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR30;                     /*!< (@ 0x0000041E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR31;                     /*!< (@ 0x0000041F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR32;                     /*!< (@ 0x00000420) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR33;                     /*!< (@ 0x00000421) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR34;                     /*!< (@ 0x00000422) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR35;                     /*!< (@ 0x00000423) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR36;                     /*!< (@ 0x00000424) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR37;                     /*!< (@ 0x00000425) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR38;                     /*!< (@ 0x00000426) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR39;                     /*!< (@ 0x00000427) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR40;                     /*!< (@ 0x00000428) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR41;                     /*!< (@ 0x00000429) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR42;                     /*!< (@ 0x0000042A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR43;                     /*!< (@ 0x0000042B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR44;                     /*!< (@ 0x0000042C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR45;                     /*!< (@ 0x0000042D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR46;                     /*!< (@ 0x0000042E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR47;                     /*!< (@ 0x0000042F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR48;                     /*!< (@ 0x00000430) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR49;                     /*!< (@ 0x00000431) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR50;                     /*!< (@ 0x00000432) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR51;                     /*!< (@ 0x00000433) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR52;                     /*!< (@ 0x00000434) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR53;                     /*!< (@ 0x00000435) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR54;                     /*!< (@ 0x00000436) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR55;                     /*!< (@ 0x00000437) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR56;                     /*!< (@ 0x00000438) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR57;                     /*!< (@ 0x00000439) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR58;                     /*!< (@ 0x0000043A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR59;                     /*!< (@ 0x0000043B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR60;                     /*!< (@ 0x0000043C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR61;                     /*!< (@ 0x0000043D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR62;                     /*!< (@ 0x0000043E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR63;                     /*!< (@ 0x0000043F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR64;                     /*!< (@ 0x00000440) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR65;                     /*!< (@ 0x00000441) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR66;                     /*!< (@ 0x00000442) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR67;                     /*!< (@ 0x00000443) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR68;                     /*!< (@ 0x00000444) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR69;                     /*!< (@ 0x00000445) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR70;                     /*!< (@ 0x00000446) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR71;                     /*!< (@ 0x00000447) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR72;                     /*!< (@ 0x00000448) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR73;                     /*!< (@ 0x00000449) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR74;                     /*!< (@ 0x0000044A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR75;                     /*!< (@ 0x0000044B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR76;                     /*!< (@ 0x0000044C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR77;                     /*!< (@ 0x0000044D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR78;                     /*!< (@ 0x0000044E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR79;                     /*!< (@ 0x0000044F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR80;                     /*!< (@ 0x00000450) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR81;                     /*!< (@ 0x00000451) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR82;                     /*!< (@ 0x00000452) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR83;                     /*!< (@ 0x00000453) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR84;                     /*!< (@ 0x00000454) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR85;                     /*!< (@ 0x00000455) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR86;                     /*!< (@ 0x00000456) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR87;                     /*!< (@ 0x00000457) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR88;                     /*!< (@ 0x00000458) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR89;                     /*!< (@ 0x00000459) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR90;                     /*!< (@ 0x0000045A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR91;                     /*!< (@ 0x0000045B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR92;                     /*!< (@ 0x0000045C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR93;                     /*!< (@ 0x0000045D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR94;                     /*!< (@ 0x0000045E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR95;                     /*!< (@ 0x0000045F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR96;                     /*!< (@ 0x00000460) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR97;                     /*!< (@ 0x00000461) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR98;                     /*!< (@ 0x00000462) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR99;                     /*!< (@ 0x00000463) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR100;                    /*!< (@ 0x00000464) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR101;                    /*!< (@ 0x00000465) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR102;                    /*!< (@ 0x00000466) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR103;                    /*!< (@ 0x00000467) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR104;                    /*!< (@ 0x00000468) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR105;                    /*!< (@ 0x00000469) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR106;                    /*!< (@ 0x0000046A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR107;                    /*!< (@ 0x0000046B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR108;                    /*!< (@ 0x0000046C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR109;                    /*!< (@ 0x0000046D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR110;                    /*!< (@ 0x0000046E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR111;                    /*!< (@ 0x0000046F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR112;                    /*!< (@ 0x00000470) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR113;                    /*!< (@ 0x00000471) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR114;                    /*!< (@ 0x00000472) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR115;                    /*!< (@ 0x00000473) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR116;                    /*!< (@ 0x00000474) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR117;                    /*!< (@ 0x00000475) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR118;                    /*!< (@ 0x00000476) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR119;                    /*!< (@ 0x00000477) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR120;                    /*!< (@ 0x00000478) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR121;                    /*!< (@ 0x00000479) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR122;                    /*!< (@ 0x0000047A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR123;                    /*!< (@ 0x0000047B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR124;                    /*!< (@ 0x0000047C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR125;                    /*!< (@ 0x0000047D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR126;                    /*!< (@ 0x0000047E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR127;                    /*!< (@ 0x0000047F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR128;                    /*!< (@ 0x00000480) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR129;                    /*!< (@ 0x00000481) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR130;                    /*!< (@ 0x00000482) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR131;                    /*!< (@ 0x00000483) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR132;                    /*!< (@ 0x00000484) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR133;                    /*!< (@ 0x00000485) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR134;                    /*!< (@ 0x00000486) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR135;                    /*!< (@ 0x00000487) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR136;                    /*!< (@ 0x00000488) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR137;                    /*!< (@ 0x00000489) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR138;                    /*!< (@ 0x0000048A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR139;                    /*!< (@ 0x0000048B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR140;                    /*!< (@ 0x0000048C) Interrupt Priority Register                                */
