ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
  __IOM uint8_t   IPRIOR141;                    /*!< (@ 0x0000048D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR142;                    /*!< (@ 0x0000048E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR143;                    /*!< (@ 0x0000048F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR144;                    /*!< (@ 0x00000490) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR145;                    /*!< (@ 0x00000491) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR146;                    /*!< (@ 0x00000492) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR147;                    /*!< (@ 0x00000493) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR148;                    /*!< (@ 0x00000494) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR149;                    /*!< (@ 0x00000495) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR150;                    /*!< (@ 0x00000496) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR151;                    /*!< (@ 0x00000497) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR152;                    /*!< (@ 0x00000498) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR153;                    /*!< (@ 0x00000499) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR154;                    /*!< (@ 0x0000049A) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR155;                    /*!< (@ 0x0000049B) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR156;                    /*!< (@ 0x0000049C) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR157;                    /*!< (@ 0x0000049D) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR158;                    /*!< (@ 0x0000049E) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR159;                    /*!< (@ 0x0000049F) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR160;                    /*!< (@ 0x000004A0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR161;                    /*!< (@ 0x000004A1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR162;                    /*!< (@ 0x000004A2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR163;                    /*!< (@ 0x000004A3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR164;                    /*!< (@ 0x000004A4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR165;                    /*!< (@ 0x000004A5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR166;                    /*!< (@ 0x000004A6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR167;                    /*!< (@ 0x000004A7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR168;                    /*!< (@ 0x000004A8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR169;                    /*!< (@ 0x000004A9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR170;                    /*!< (@ 0x000004AA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR171;                    /*!< (@ 0x000004AB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR172;                    /*!< (@ 0x000004AC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR173;                    /*!< (@ 0x000004AD) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR174;                    /*!< (@ 0x000004AE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR175;                    /*!< (@ 0x000004AF) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR176;                    /*!< (@ 0x000004B0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR177;                    /*!< (@ 0x000004B1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR178;                    /*!< (@ 0x000004B2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR179;                    /*!< (@ 0x000004B3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR180;                    /*!< (@ 0x000004B4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR181;                    /*!< (@ 0x000004B5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR182;                    /*!< (@ 0x000004B6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR183;                    /*!< (@ 0x000004B7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR184;                    /*!< (@ 0x000004B8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR185;                    /*!< (@ 0x000004B9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR186;                    /*!< (@ 0x000004BA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR187;                    /*!< (@ 0x000004BB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR188;                    /*!< (@ 0x000004BC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR189;                    /*!< (@ 0x000004BD) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR190;                    /*!< (@ 0x000004BE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR191;                    /*!< (@ 0x000004BF) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR192;                    /*!< (@ 0x000004C0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR193;                    /*!< (@ 0x000004C1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR194;                    /*!< (@ 0x000004C2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR195;                    /*!< (@ 0x000004C3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR196;                    /*!< (@ 0x000004C4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR197;                    /*!< (@ 0x000004C5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR198;                    /*!< (@ 0x000004C6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR199;                    /*!< (@ 0x000004C7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR200;                    /*!< (@ 0x000004C8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR201;                    /*!< (@ 0x000004C9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR202;                    /*!< (@ 0x000004CA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR203;                    /*!< (@ 0x000004CB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR204;                    /*!< (@ 0x000004CC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR205;                    /*!< (@ 0x000004CD) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR206;                    /*!< (@ 0x000004CE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR207;                    /*!< (@ 0x000004CF) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR208;                    /*!< (@ 0x000004D0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR209;                    /*!< (@ 0x000004D1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR210;                    /*!< (@ 0x000004D2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR211;                    /*!< (@ 0x000004D3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR212;                    /*!< (@ 0x000004D4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR213;                    /*!< (@ 0x000004D5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR214;                    /*!< (@ 0x000004D6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR215;                    /*!< (@ 0x000004D7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR216;                    /*!< (@ 0x000004D8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR217;                    /*!< (@ 0x000004D9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR218;                    /*!< (@ 0x000004DA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR219;                    /*!< (@ 0x000004DB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR220;                    /*!< (@ 0x000004DC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR221;                    /*!< (@ 0x000004DD) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR222;                    /*!< (@ 0x000004DE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR223;                    /*!< (@ 0x000004DF) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR224;                    /*!< (@ 0x000004E0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR225;                    /*!< (@ 0x000004E1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR226;                    /*!< (@ 0x000004E2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR227;                    /*!< (@ 0x000004E3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR228;                    /*!< (@ 0x000004E4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR229;                    /*!< (@ 0x000004E5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR230;                    /*!< (@ 0x000004E6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR231;                    /*!< (@ 0x000004E7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR232;                    /*!< (@ 0x000004E8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR233;                    /*!< (@ 0x000004E9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR234;                    /*!< (@ 0x000004EA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR235;                    /*!< (@ 0x000004EB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR236;                    /*!< (@ 0x000004EC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR237;                    /*!< (@ 0x000004ED) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR238;                    /*!< (@ 0x000004EE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR239;                    /*!< (@ 0x000004EF) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR240;                    /*!< (@ 0x000004F0) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR241;                    /*!< (@ 0x000004F1) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR242;                    /*!< (@ 0x000004F2) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR243;                    /*!< (@ 0x000004F3) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR244;                    /*!< (@ 0x000004F4) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR245;                    /*!< (@ 0x000004F5) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR246;                    /*!< (@ 0x000004F6) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR247;                    /*!< (@ 0x000004F7) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR248;                    /*!< (@ 0x000004F8) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR249;                    /*!< (@ 0x000004F9) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR250;                    /*!< (@ 0x000004FA) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR251;                    /*!< (@ 0x000004FB) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR252;                    /*!< (@ 0x000004FC) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR253;                    /*!< (@ 0x000004FD) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR254;                    /*!< (@ 0x000004FE) Interrupt Priority Register                                */
  __IOM uint8_t   IPRIOR255;                    /*!< (@ 0x000004FF) Interrupt Priority Register                                */
  __IM  uint32_t  RESERVED10[516];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D10) System Control Register                                    */
    
