ckormanyos/real-time-cpp/ref_app/src/mcal/wch_ch32v307/Mcal/CH32V30xxx.h
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t SLEEPONEXIT : 1;           /*!< [1..1] SLEEPONEXIT                                                        */
      __IOM uint32_t SLEEPDEEP  : 1;            /*!< [2..2] SLEEPDEEP                                                          */
      __IOM uint32_t WFITOWFE   : 1;            /*!< [3..3] WFITOWFE                                                           */
      __IOM uint32_t SEVONPEND  : 1;            /*!< [4..4] SEVONPEND                                                          */
      __IOM uint32_t SETEVENT   : 1;            /*!< [5..5] SETEVENT                                                           */
      __IM  uint32_t            : 25;
      __IOM uint32_t SYSRESET   : 1;            /*!< [31..31] SYSRESET                                                         */
    } bit;
  } SCTLR;
  __IM  uint32_t  RESERVED11[187];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001000) System counter control register                            */
    
    struct {
      __IOM uint32_t STE        : 1;            /*!< [0..0] System counter enable                                              */
      __IOM uint32_t STIE       : 1;            /*!< [1..1] System counter interrupt enable                                    */
      __IOM uint32_t STCLK      : 1;            /*!< [2..2] System selects the clock source                                    */
      __IOM uint32_t STRE       : 1;            /*!< [3..3] System reload register                                             */
      __IOM uint32_t MODE       : 1;            /*!< [4..4] System Mode                                                        */
      __IOM uint32_t INIT       : 1;            /*!< [5..5] System Initialization update                                       */
      __IM  uint32_t            : 25;
      __IOM uint32_t SWIE       : 1;            /*!< [31..31] System software triggered interrupts enable                      */
    } bit;
  } STK_CTLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001004) System START                                               */
    
    struct {
      __IOM uint32_t CNTIF      : 1;            /*!< [0..0] CNTIF                                                              */
    } bit;
  } STK_SR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001008) System counter low register                                */
    
    struct {
      __IOM uint32_t CNTL       : 32;           /*!< [31..0] CNTL                                                              */
    } bit;
  } STK_CNTL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000100C) System counter high register                               */
    
    struct {
      __IOM uint32_t CNTH       : 32;           /*!< [31..0] CNTH                                                              */
    } bit;
  } STK_CNTH;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001010) System compare low register                                */
    
    struct {
      __IOM uint32_t CMPL       : 32;           /*!< [31..0] CMPL                                                              */
    } bit;
  } STK_CMPLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00001014) System compare high register                               */
    
    struct {
      __IOM uint32_t CMPH       : 32;           /*!< [31..0] CMPH                                                              */
    } bit;
  } STK_CMPHR;
} PFIC_Type;                                    /*!< Size = 4120 (0x1018)                                                      */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

#define RNG_BASE                    0x40023C00UL
#define USB_BASE                    0x40005C00UL
#define CAN1_BASE                   0x40006400UL
#define CAN2_BASE                   0x40006800UL
#define ETHERNET_MAC_BASE           0x40028000UL
#define ETHERNET_MMC_BASE           0x40028100UL
#define ETHERNET_PTP_BASE           0x40028700UL
#define ETHERNET_DMA_BASE           0x40029000UL
#define SDIO_BASE                   0x40018000UL
#define FSMC_BASE                   0xA0000000UL
#define DVP_BASE                    0x50050000UL
#define DAC_BASE                    0x40007400UL
#define PWR_BASE                    0x40007000UL
#define RCC_BASE                    0x40021000UL
#define EXTEND_BASE                 0x40023800UL
#define OPA_BASE                    0x40023804UL
#define GPIOA_BASE                  0x40010800UL
#define GPIOB_BASE                  0x40010C00UL
#define GPIOC_BASE                  0x40011000UL
#define GPIOD_BASE                  0x40011400UL
#define GPIOE_BASE                  0x40011800UL
#define AFIO_BASE                   0x40010000UL
#define EXTI_BASE                   0x40010400UL
#define DMA1_BASE                   0x40020000UL
#define DMA2_BASE                   0x40020400UL
#define RTC_BASE                    0x40002800UL
#define BKP_BASE                    0x40006C00UL
#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define TIM1_BASE                   0x40012C00UL
#define TIM8_BASE                   0x40013400UL
#define TIM9_BASE                   0x40014C00UL
#define TIM10_BASE                  0x40015000UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define TIM4_BASE                   0x40000800UL
#define TIM5_BASE                   0x40000C00UL
#define TIM6_BASE                   0x40001000UL
#define TIM7_BASE                   0x40001400UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define SPI3_BASE                   0x40003C00UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define USART3_BASE                 0x40004800UL
#define UART4_BASE                  0x40004C00UL
#define UART5_BASE                  0x40005000UL
#define UART6_BASE                  0x40001800UL
#define UART7_BASE                  0x40001C00UL
#define UART8_BASE                  0x40002000UL
#define ADC1_BASE                   0x40012400UL
#define ADC2_BASE                   0x40012800UL
#define DBG_BASE                    0xE000D000UL
#define USBHD_BASE                  0x40023400UL
#define CRC_BASE                    0x40023000UL
#define FLASH_BASE                  0x40022000UL
#define USB_OTG_FS_BASE             0x50000000UL
#define PFIC_BASE                   0xE000E000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

#define RNG                         ((RNG_Type*)               RNG_BASE)
#define USB                         ((USB_Type*)               USB_BASE)
#define CAN1                        ((CAN1_Type*)              CAN1_BASE)
#define CAN2                        ((CAN1_Type*)              CAN2_BASE)
#define ETHERNET_MAC                ((ETHERNET_MAC_Type*)      ETHERNET_MAC_BASE)
#define ETHERNET_MMC                ((ETHERNET_MMC_Type*)      ETHERNET_MMC_BASE)
#define ETHERNET_PTP                ((ETHERNET_PTP_Type*)      ETHERNET_PTP_BASE)
#define ETHERNET_DMA                ((ETHERNET_DMA_Type*)      ETHERNET_DMA_BASE)
#define SDIO                        ((SDIO_Type*)              SDIO_BASE)
#define FSMC                        ((FSMC_Type*)              FSMC_BASE)
#define DVP                         ((DVP_Type*)               DVP_BASE)
#define DAC                         ((DAC_Type*)               DAC_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define EXTEND                      ((EXTEND_Type*)            EXTEND_BASE)
#define OPA                         ((OPA_Type*)               OPA_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define GPIOB                       ((GPIOA_Type*)             GPIOB_BASE)
#define GPIOC                       ((GPIOA_Type*)             GPIOC_BASE)
#define GPIOD                       ((GPIOA_Type*)             GPIOD_BASE)
#define GPIOE                       ((GPIOA_Type*)             GPIOE_BASE)
#define AFIO                        ((AFIO_Type*)              AFIO_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define DMA1                        ((DMA1_Type*)              DMA1_BASE)
#define DMA2                        ((DMA2_Type*)              DMA2_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define BKP                         ((BKP_Type*)               BKP_BASE)
#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define TIM8                        ((TIM1_Type*)              TIM8_BASE)
#define TIM9                        ((TIM1_Type*)              TIM9_BASE)
#define TIM10                       ((TIM1_Type*)              TIM10_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM3                        ((TIM2_Type*)              TIM3_BASE)
#define TIM4                        ((TIM2_Type*)              TIM4_BASE)
#define TIM5                        ((TIM2_Type*)              TIM5_BASE)
#define TIM6                        ((TIM6_Type*)              TIM6_BASE)
#define TIM7                        ((TIM6_Type*)              TIM7_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI2                        ((SPI2_Type*)              SPI2_BASE)
#define SPI3                        ((SPI2_Type*)              SPI3_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define USART3                      ((USART1_Type*)            USART3_BASE)
#define UART4                       ((USART1_Type*)            UART4_BASE)
#define UART5                       ((USART1_Type*)            UART5_BASE)
#define UART6                       ((USART1_Type*)            UART6_BASE)
#define UART7                       ((USART1_Type*)            UART7_BASE)
#define UART8                       ((USART1_Type*)            UART8_BASE)
#define ADC1                        ((ADC1_Type*)              ADC1_BASE)
#define ADC2                        ((ADC2_Type*)              ADC2_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define USBHD                       ((USBHD_Type*)             USBHD_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define FLASH                       ((FLASH_Type*)             FLASH_BASE)
#define USB_OTG_FS                  ((USB_OTG_FS_Type*)        USB_OTG_FS_BASE)
#define PFIC                        ((PFIC_Type*)              PFIC_BASE)

#ifdef __cplusplus
}
#endif

#endif /* CH32V30XXX_H */
